{"NeckBWFrontNeckBridge":{"id": "0",
"exerciseid": "BWFrontNeckBridge",
"musclegroup": "Neck",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Sternocleidomastoid",
"name": "Front Neck Bridge",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Push & Pull",
"preparation": "Kneel on all fours on well cushioned mat. Place head on mat between hands. Rise and straighten knees. Fold hands behind low back or hips.",
"execution": "Roll back onto forehead until nose touches mat. Roll forward onto top of head until chin touches upper chest. Repeat.",
"comments": "Exercise involves neck flexors as well as neck extensors. See controversial exercises. Easier Before attempting this exercise, beginners should perform movement on wall or column so neck structures have an opportunity to adapt. Standard neck exercise can also be used for progressive adaptation. Wall Rear Neck BridgeWeighted Neck Extension Harder Exercise can be made more challenging by placing weight behind hips.",
"stabilizers": "tensorfasciaelatae, iliopsoas, sartorius, soleus, erectorspinae, quadriceps, gastrocnemius, rectusabdominis, obliques",
"synergists": "levatorscapulae, trapeziusupper, splenius, erectorspinae",
"target": "sternocleidomastoid"},"NeckBWWallFrontNeckBridge":{"id": "1",
"exerciseid": "BWWallFrontNeckBridge",
"musclegroup": "Neck",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Sternocleidomastoid",
"name": "Wall Front Neck Bridge",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Push & Pull",
"preparation": "Place small or folded cushioned mat on wall or column approximately chest height. With hands supporting mat on each side stand back so feet are away from wall or column with body leaning forward. Place top of forehead on mat. Fold hands behind low back or hips.",
"execution": "Roll down onto forehead until nose touches mat. Roll up onto top of head until chin touches upper chest. Repeat.",
"comments": "Keep body somewhat straight bending spine and hips slightly as head rolls down. Exercise involves neck flexors as well as neck extensors. See controversial exercises. Easier Begin with feet slightly closer to wall or column, so neck structures have an opportunity to adapt. Standard neck exercises with light weights can also be less intense. Weighted Neck Flexion Harder Exercise is more challenging when feet are positioned further from column or wall. Movement is much more difficult when performed on floor. Front Neck Bridge on Floor",
"antagonist stabilizers": "erectorspinae",
"stabilizers": "quadriceps, rectusabdominis, obliques",
"synergists": "levatorscapulae, trapeziusupper, splenius, erectorspinae",
"target": "sternocleidomastoid"},"NeckBWWallSideNeckBridge":{"id": "2",
"exerciseid": "BWWallSideNeckBridge",
"musclegroup": "Neck",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Sternocleidomastoid",
"name": "Wall Side Neck Bridge",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Place small or folded cushioned mat on column or at end of wall approximately shoulder height. With hands supporting mat, stand with side toward mat. Step far to side so feet are away from wall or column forward. Place side of head on mat with shoulder extending over end of adjacent side of column or wall so body leans to side. Fold hands behind low back or hips.",
"execution": "Push side of head into mat and roll onto top of head moving body away from mat. Return to original position by rolling back down to side of head while bringing shoulder back over end of column or wall. Repeat.",
"comments": "Keep body somewhat straight allowing waist to bend outward away from mat slightly at end of lift. See all muscle used in Lateral Flexion Atlantoccipical  AntlantoaxialCervical SpineThoracic  Lumbar Spine Thoracic  Lumbar Spine movement is typical in this movement. Easier Begin with feet slightly closer to wall or column, so neck structures have an opportunity to adapt. Standard neck exercises with light weights can also be less intense. Weighted Lateral Neck Flexion Harder Movement is more challenging when feet are positioned further from column or wall.",
"stabilizers": "gluteusmedius, gluteusminimus",
"synergists": "trapeziusupper, splenius, levatorscapulae, iliopsoas, quadratuslumborum, erectorspinae, obliques",
"target": "sternocleidomastoid"}}