{"CalvesBWReverseCalfRaise":{"id": "0",
"exerciseid": "BWReverseCalfRaise",
"musclegroup": "Calves",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "TibialisAnterior",
"name": "Reverse Calf Raise",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Position heels on forward edge of calf block or platform. Grasp support with other hand for balance.",
"execution": "Pull forefoot of both feet up toward body as far as possible. Return by extending feet until toes are pointed downward. Repeat.",
"comments": "Keep knees and hips straight throughout exercise. See Dorsal Flexor Calf Exercise Analyses. Easier Resistance can be reduced positioning heels further onto calf block or platform. Harder The exercise can be made more difficult by positioning heels closer to edge of platform or using only one foot. Dumbbell can also be held in one hand. Single Leg Reverse Calf RaiseDumbbell",
"synergists": "None",
"target": "tibialisanterior"},"CalvesBWSingleLegRevCalfRaise":{"id": "1",
"exerciseid": "BWSingleLegRevCalfRaise",
"musclegroup": "Calves",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "TibialisAnterior",
"name": "Single Leg Reverse Calf Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Position one heel on forward edge of platform. Grasp support with other hand for balance. Lift other leg to rear by bending knee.",
"execution": "Pull forefoot up toward body as far as possible. Return by extending foot until toes are pointed downward. Repeat. Continue with opposite leg.",
"comments": "Keep knee and hip straight throughout exercise. Exercise can be made more difficult by positioning heels closer to edge of platform. See Dorsal Flexor Calf Exercise Analyses. Easier Use lighter load or position heels more on platform if you need to assist with hands used for support. Resistance can be reduced positioning heels further onto calf block or platform or using both legs. Reverse Calf Raise with both legs Harder The exercise can be made more difficult by positioning heels closer to edge of platform. Dumbbell can also be held in one hand. Dumbbell",
"stabilizers": "gluteusmedius, gluteusmaximus, quadratuslumborum, obliques",
"synergists": "None",
"target": "tibialisanterior"}}