{"NeckCBNeckExt":{"id": "0",
"exerciseid": "CBNeckExt",
"musclegroup": "Neck",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Splenius",
"name": "Cable Neck Extension",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on bench facing pulley. Place neck in harness cable attachment. Place forearms on lower thighs for support.",
"execution": "Move head away from pulley by hyperextending neck. Return by bending neck forward until chin touches upper chest. Repeat.",
"comments": "No comment.",
"stabilizers": "latissimusdorsi, pectoralisminor, pectoralisclavicular, pectoralissternal, rhomboids",
"synergists": "levatorscapulae, sternocleidomastoid, trapeziusupper, erectorspinae",
"target": "splenius"},"NeckCBNeckExtBelt":{"id": "1",
"exerciseid": "CBNeckExtBelt",
"musclegroup": "Neck",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Splenius",
"name": "Cable Neck Extension (with belt)",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on bench facing low pulley. Attach belt on low pulley cable by attaching carabiner on belt buckle. Place head in belt loop. With belt above ears, clamp belt snugly around head by tightly gripping ends close to forehead. Place other hand or forearm on lower thighs for support.",
"execution": "Pull head up and back by hyperextending neck. Return by bending neck forward until chin touches upper chest. Repeat.",
"comments": "Use neck to pull belt rather than allowing hand to assist. Keep clinched grip on belt against forehead throughout movement. Woven cotton or cloth belts tend to slip less, particularly on bald head. If belt slips from head, place small towel between belt and head. Cable carabiner slips to one side on square buckles and stresses belts structural integrity under heavy loads. Rounded buckle is more ideal since it provides more even stress on belt. Belts not made specifically for weight training may cause in jury if they fail under load in which they were not designed. Exercise can also be performed off of rack with belt, nylon rope, and plate holder from wrist roller. Nylon rope offers less friction on smooth rounded fixed surface. Alternatively, nonnylon ropes can be used off of revolving barbell sleeve on smith machine. See Cable Neck Extension with belt and rope.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, pectoralisclavicular, tricepsbrachii, pectoralissternal, gluteusmaximus, erectorspinae, pectoralisminor, rhomboids",
"synergists": "levatorscapulae, sternocleidomastoid, trapeziusupper, erectorspinae",
"target": "splenius"}}