{"ForearmsDBLyingPronationUp":{"id": "0",
"exerciseid": "DBLyingPronationUp",
"musclegroup": "Forearms",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Pronators",
"name": "Dumbbell Lying Pronation (arm up)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Lie on bench or mat. With hand of upper arm, grasp unilaterally loaded dumbbell pinkie positioned near weighted side. Bend elbow approximately 90degrees and place arm on hip or side of waist. Position thumb upward (supinated).",
"execution": "Rotate dumbbell so thumb turns downward (pronation). Return and repeat.",
"comments": "Pad or firm pillow (ball pictured) may be placed between hip and arm. Elevation of elbow allows resistance during initial range of motion. This exercise can also be performed seated by corner of table higher than shoulder height (See Dumbbell Seated Pronation. If unilaterally loaded dumbbell, or half dumbbell is not available, grasp conventional dumbbell to one side of handle with thumb against inside surface. Also see Dumbbell Lying Pronation with arm down.",
"stabilizers": "No significant stabilizers",
"synergists": "None",
"target": "forearm#pronation"},"ForearmsDBLyingPronationDown":{"id": "1",
"exerciseid": "DBLyingPronationDown",
"musclegroup": "Forearms",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Pronators",
"name": "Dumbbell Lying Pronation (arm down)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Grasp unilaterally loaded dumbbell with thumb next to weighted side. Lie on bench on side with weight and position arm with half dumbbell on bench. Bend elbow approximately 90degrees and tucked bent elbow under body. Position thumb down (supinated).",
"execution": "Rotate dumbbell so thumb turns upward (pronation). Return and repeat.",
"comments": "Bench can be flat or slightly incline (030 degrees) so resistance occurs during initial range of motion. If unilaterally loaded dumbbell, or half dumbbell is not available, grasp conventional dumbbell to one side of handle with pinkie against inside surface. Also see conventiontal Dumbbell Lying Pronation.",
"stabilizers": "No significant stabilizers",
"synergists": "None",
"target": "forearm#pronation"},"ForearmsDBSeatedPronation":{"id": "2",
"exerciseid": "DBSeatedPronation",
"musclegroup": "Forearms",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Pronators",
"name": "Dumbbell Seated Pronation",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Sit next to elevated surface, approximately arm pit height. With hand of upper arm, grasp unilaterally loaded dumbbell pinkie positioned near weighted side. Bend elbow approximately 90degrees and place upperarm on elevated surface. Position thumb upward (supinated).",
"execution": "Rotate dumbbell so thumb turns downward (pronation). Return and repeat.",
"comments": "If unilaterally loaded dumbbell, or half dumbbell is not available, grasp conventional dumbbell to one side of handle with thumb against inside surface.",
"stabilizers": "No significant stabilizers",
"synergists": "None",
"target": "forearm#pronation"}}