{"ChestLVInclineBenchPressPL":{"id": "0",
"exerciseid": "LVInclineBenchPressPL",
"musclegroup": "Chest",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralClavicular",
"name": "Lever Incline Bench Press (plate loaded)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie supine on incline bench with lever bars out to sides of chest. Grasp handles with wide overhand grip.",
"execution": "Press lever bars up until arms are extended. Lower weight toward upper chest. Repeat.",
"comments": "Range of motion will be compromised if grip is too wide. Also see exercise performed with parallel grip and exercise performed on alternative machine.Also see Bench Press Analysis. ",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "tricepsbrachii, deltoidanterior",
"target": "pectoralisclavicular"},"ChestLVBBInclineBenchPress":{"id": "1",
"exerciseid": "LVBBInclineBenchPress",
"musclegroup": "Chest",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralClavicular",
"name": "Lever Barbell Incline Bench Press (plate loaded)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie supine on incline bench with upper chest under bar. Grasp bar with wide oblique overhand grip. Disengage bar by rotating bar back.",
"execution": "Lower weight to chest. Press bar until arms are extended. Repeat.",
"comments": "Orientation relative to lever will depend upon height of fulcrum relative to bench. Position body so bar is over shoulders during extension, yet lower on chest in lowest position. Feet can be placed on bench as shown for more comfortable low back positioning. Range of motion will be compromised if grip is too wide. Also see Bench Press Analysis.",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "tricepsbrachii, deltoidanterior",
"target": "pectoralisclavicular"},"ChestLVParallelGripInclineBenchPressPL":{"id": "2",
"exerciseid": "LVParallelGripInclineBenchPressPL",
"musclegroup": "Chest",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralClavicular",
"name": "Lever Parallel Grip Incline Bench Press (plate loaded)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie supine on incline bench with parallel lever bars out to sides of rib cage. Grasp parallel handles.",
"execution": "Press lever bars up until arms are extended. Lower weight toward upper chest. Repeat.",
"comments": "Seat should be adjusted, so handles are to sides of lower chest. Parallel grip tends to place shoulders in a more stable position, with arms closer to sides, which may be more ideal for those with certain shoulder issues. See exercise on alternative machine. Also see exercise performed with standard grip providing greater emphasis on chest development. Also see Bench Press Analysis.",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "tricepsbrachii, deltoidanterior",
"target": "pectoralisclavicular"},"ChestLVInclineChestPressH":{"id": "3",
"exerciseid": "LVInclineChestPressH",
"musclegroup": "Chest",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralClavicular",
"name": "Lever Incline Chest Press (plate loaded)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on seat with upper chest just above grips on lever. Grasp grips with wide overhand grip and position elbows out to sides.",
"execution": "Press lever until arms are extended. Return weight until chest muscles are slightly stretched. Repeat.",
"comments": "Range of motion will be compromised if grip is too wide.",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "tricepsbrachii, deltoidanterior",
"target": "pectoralisclavicular"},"ChestLVInclineChestPressOnHammerMilitaryPress":{"id": "4",
"exerciseid": "LVInclineChestPressOnHammerMilitaryPress",
"musclegroup": "Chest",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralClavicular",
"name": "Lever Incline Chest Press (on Hammer military press)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on seat with upper chest just above base of handles on lever. Grasp grips with wide overhand grip. Lift levers into starting position with elbows slightly low.",
"execution": "Press levers until arms are extended. Return weight until chest muscles are slightly stretched with elbows positionedout to sides. Repeat.",
"comments": "This exercise is typically performed on Lever Incline Chest Press Machine. Seat alterations and precautions during mounting and dismounting of weight will need to be taken since this apperatus is designed for Lever Military Press. Seat should be positioned so base of handles are approximately arm pit height, higher than what is required for military press. Before initiation of movement, lift lever into lower starting position with elbows positioned slightly low. Once first rep is performed, position elbows slightly further out to sides. At bottom position of each rep, lower levers only as far back to allowslight stretch to be felt in chest or shoulders. Once last rep is performed, lower shoulders slightly before lowering levers to resting position.",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "tricepsbrachii, deltoidanterior",
"target": "pectoralisclavicular"}}