{"CalvesDBReverseCalfRaise":{"id": "0",
"exerciseid": "DBReverseCalfRaise",
"musclegroup": "Calves",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "TibialisAnterior",
"name": "Dumbbell Reverse Calf Raise",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp dumbbell in one hand to side. Position heels on forward edge of platform. Grasp support with other hand for balance.",
"execution": "Pull forefoot of both feet up toward body as far as possible. Return by extending feet until toes are pointed downward. Repeat.",
"comments": "Keep knees and hips straight throughout exercise. The exercise can be made more difficult by using only one leg or positioning heels closer to edge of platform. If you need to assist with hands used for support, use lighter load (or no weight), or position heels more on platform. See Dorsal Flexor Calf Exercise Analyses.",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle",
"synergists": "None",
"target": "tibialisanterior"},"CalvesDBSingleLegRevCalfRaise":{"id": "1",
"exerciseid": "DBSingleLegRevCalfRaise",
"musclegroup": "Calves",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "TibialisAnterior",
"name": "Dumbbell Single Leg Reverse Calf Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp dumbbell in one hand to side. Position one heel on forward edge of platform. Grasp support with other hand for balance. Lift other leg to rear by bending knee.",
"execution": "Pull forefoot up toward body as far as possible. Return by extending foot until toes are pointed downward. Repeat. Continue with opposite leg.",
"comments": "Keep knee and hip straight throughout exercise. Exercise can be made more difficult by positioning heels closer to edge of platform. If you need to assist with hands used for support, use lighter load (or no weight), or both feet, or position heels more on platform. See Dorsal Flexor Calf Exercise Analyses.",
"stabilizers": "trapeziusupper, trapeziusmiddle, gluteusmaximus, levatorscapulae, gluteusmedius",
"synergists": "None",
"target": "tibialisanterior"}}