{"CalvesSMDonkeyCalfRaise":{"id": "0",
"exerciseid": "SMDonkeyCalfRaise",
"musclegroup": "Calves",
"equipment": "smith",
"exercisetype": "WeightExercises",
"muscleclass": "Gastrocnemius",
"name": "Smith Donkey Calf Raise",
"utility": "Basic",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Engage both safety stops mid height so bar will be just above in lowest range of motion. Place calf block under bar. Position padded surface of tall bench or Roman Chair in front of smith machine for arm rest. Place stiffly padded board within arms reach. Step on calf block while standing between smith bar and arm rest. Situate padded board on back of hips while bending under smith bar. Arrange smith bar above upper hips or lower waist with padded board in between. Place forearms on supports. Lift bar off of safety stops by straighten knees. Position toes and balls of feet on calf block with arches and heels extending off.",
"execution": "Raise heels by extending ankles as high as possible. Lower heels by bending ankles until calves are stretched. Repeat.",
"comments": "Position smith bar just below lowest range of motion. Weight can be loaded with or without bar catch engaged. In event bar catch obstructs movement midset, reach back with one hand and rotate bar to move bar catch out of way. If this is not possible, lower weight, adjust catch, and start again. When set has been completed lower bar to safety catch by bending knees. Make certain both safety catches are secure before each set. Keep knees straight throughout exercise or bend knees slightly only during stretch. Quadriceps serve as synergists muscle if knees are bent slightly during stretch. See Calf Exercise Analyses.",
"stabilizers": "serratusanterior, pectoralissternal, pectoralisclavicular",
"synergists": "soleus",
"target": "gastrocnemius"},"CalvesSMStandingCalfRaise":{"id": "1",
"exerciseid": "SMStandingCalfRaise",
"musclegroup": "Calves",
"equipment": "smith",
"exercisetype": "WeightExercises",
"muscleclass": "Gastrocnemius",
"name": "Smith Standing Leg Calf Raise",
"utility": "Basic",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Position bar on upper chest height and place calf block under bar. Position back of shoulders under bar and grasp bar to sides. Position toes and balls of feet on calf block with arches and heels extending off. Disengage bar by rotating bar back. Stand erect by extending knees and hips.",
"execution": "Raise heels by extending ankles as high as possible. Lower heels by bending ankles until calves are stretched. Repeat.",
"comments": "Keep knees straight throughout exercise or bend knees slightly only during stretch. Quadriceps serve as synergists muscle if knees are bent slightly during stretch. Also see alternative form Standing Calf Popups involving Quadriceps. See Calf Exercise Analyses.",
"stabilizers": "No significant stabilizers",
"synergists": "soleus",
"target": "gastrocnemius"}}