{"ThighsWTGluteHamRaise":{"id": "0",
"exerciseid": "WTGluteHamRaise",
"musclegroup": "Thighs",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Weighted Glute-Ham Raise",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"execution": "From upright position, lower body by straightening knees until body is horizontal. Continue to lower torso by bending hips until body is upside down. Raise torso by extending hips until fully extended. Continue to raise body by flexing knees until body is upright. Repeat.",
"comments": "Weight can be positioned closer (easier) or further away (harder) from hips to adjust intensity see Arm Position During Waist Exercises. Exercise can be performed without added weight until more resistance is needed.",
"antagonist stabilizers": "tibialisanterior, rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"synergists": "popliteus, sartorius, gracilis, gluteusmaximus, adductors, gastrocnemius",
"target": "hamstrings"},"ThighsWTHamstringRaise":{"id": "1",
"exerciseid": "WTHamstringRaise",
"musclegroup": "Thighs",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Weighted Inverse Leg Curl",
"utility": "Basic",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Adjust padded supports and kneel upright in apparatus. Position knees against large roller pad or nearupper side of padded hump, ankles between padded supports, and feet on platform. Hold weight to chest or behind neck.",
"execution": "Lower body until horizontal by straightening knees. Raise body by flexing knees, only allowing hips to bend slightly. Repeat.",
"comments": "This is an advanced exercise performed on Glute Ham Raise Apparatus. This movement is also known as Weighted Hamstring Raise. Exercise can be performed without added weight until more resistance is needed. If weight is positioned behind head, neck extensors act as stabilizers. SpleniusErector SpinaeLevator Scapulae Dorsal flexion of ankle reduces active insufficiency of Gastrocnemius allowing it to assist in knee flexion. Also see Inverse Leg Curl comments and Arm Position During Waist Exercises.",
"antagonist stabilizers": "tibialisanterior, quadriceps, rectusabdominis, obliques",
"stabilizers": "erectorspinae, gluteusmaximus, adductors",
"synergists": "sartorius, popliteus, gracilis, gastrocnemius",
"target": "hamstrings"},"ThighsWtHyperextension":{"id": "2",
"exerciseid": "WtHyperextension",
"musclegroup": "Thighs",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Weighted Hyperextension",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Position thighs prone on large pad and lower leg under padded bar. Hold weight to chest or behind neck.",
"execution": "Raise upper body until hips and waist are fully extended. Lower body by bending hips and waist until fully flexed. Repeat.",
"comments": "If weight is positioned behind head, neck extensors act as stabilizers. SpleniusErector SpinaeLevator Scapulae See Arm Position During Waist Exercises. Adjust lower leg brace so pressure is evenly distributed on thigh pad. Begin with body weight and add additional weight gradually to allow lower back adequate adaptation. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings and low back. Full range of motion will vary from person to person. Also see Weighted Back Extension and Weighted Back Extension.",
"stabilizers": "See comments",
"synergists": "gluteusmaximus, adductors, erectorspinae",
"target": "hamstrings"},"ThighsWTHipExtension":{"id": "3",
"exerciseid": "WTHipExtension",
"musclegroup": "Thighs",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Weighted Back Raise (on hyperextension apparatus)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand in hyperextension apparatus. Position thighs prone on large pad and lower leg under padded bar. Hold weight to chest or behind neck.",
"execution": "Lower body by bending hips until fully flexed. Raise or extend hips until torso is parallel to legs. Repeat.",
"comments": "Exercise can be performed without added weight until more resistance is needed. If weight is positioned behind head, neck extensors act as stabilizers SpleniusErector SpinaeLevator Scapulae See Arm Position During Waist Exercises. Adjust lower leg brace so pressure is evenly distributed on thigh pad. Do not lower weight beyond mild stretch. Full range of motion will vary from person to person. Also known as Weighted Hip Extension. Also see Weighted Hyperextension and Weighted Back Extension.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, tricepsbrachii, brachioradialis, bicepsbrachii, deltoidposterior, brachialis, trapeziusmiddle, teresmajor, erectorspinae, trapeziuslower, rhomboids",
"synergists": "gluteusmaximus, adductors",
"target": "hamstrings"},"ThighsWt45Hyperextension":{"id": "4",
"exerciseid": "Wt45Hyperextension",
"musclegroup": "Thighs",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Weighted 45° Hyperextension",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Position thighs prone on padding. Hook heels underplatform lip or padded brace. Hold weight to chest or behind neck.",
"execution": "Raise upper body until hips and waist are fully extended. Lower body by bending hips and waist until fully flexed. Repeat.",
"comments": "If weight is positioned behind head, neck extensors act as stabilizers SpleniusErector SpinaeLevator Scapulae See Arm Position During Waist Exercises. Position pad high enough to evenly distribute body weight on thigh but not so high that range of motion is limited abdomen should not press on top side of pad when upper body is lowered. Begin with body weight and add additional weight gradually to allow lower back adequate adaptation. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings and low back. Full range of motion will vary from person to person. Also see Weighted Back Extension and Weighted Back Raise.",
"stabilizers": "See comments",
"synergists": "gluteusmaximus, adductors, erectorspinae",
"target": "hamstrings"},"ThighsWT45HipExtension":{"id": "5",
"exerciseid": "WT45HipExtension",
"musclegroup": "Thighs",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Weighted 45° Back Raise (on hyperextension apparatus)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Position thighs prone on padding of 45degree hyperextension apparatus. Hook heels on platform lip or under padded brace. Hold weight to chest or behind neck.",
"execution": "Lower body by bending hips until fully flexed. Raise or extend hips until torso is parallel to legs. Repeat.",
"comments": "Exercise can be performed without added weight until more resistance is needed. If weight is positioned behind head, neck extensors act as stabilizers. SpleniusErector SpinaeLevator Scapulae See Arm Position During Waist Exercises. Position pad high enough to evenly distribute body weight on thigh but not so high that range of motion is limited abdomen should not press on top side of pad when upper body is lowered. Do not lower weight beyond mild stretch. Full range of motion will vary from person to person. Also known as Weighted 45degree Hip Extension. Also see Weighted Hyperextension and Weighted Back Extension.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, tricepsbrachii, brachioradialis, bicepsbrachii, deltoidposterior, brachialis, trapeziusmiddle, teresmajor, erectorspinae, trapeziuslower, rhomboids",
"synergists": "gluteusmaximus, adductors",
"target": "hamstrings"}}