{"CalvesFloorBoard":{"id": "0",
"exerciseid": "FloorBoard",
"musclegroup": "Calves",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Gastrocnemius",
"name": "Floor Board Straight Leg Calf Stretch",
"preparation": "Face wall with both knees slightly bent. Position fore foot on wall with heel on floor.",
"execution": "Straighten knees and lean body toward wall. Hold stretch . Repeat with opposite leg.",
"comments": "None.",
"target": "gastrocnemius"},"CalvesLunging":{"id": "1",
"exerciseid": "Lunging",
"musclegroup": "Calves",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Gastrocnemius",
"name": "Lunging Straight Leg Calf Stretch",
"preparation": "Stand with one leg far forward and other leg extended back with knees straight. Both feet are positioned directly forward.",
"execution": "Lower body forward by bending forward knee only. Hold stretch. Repeat with opposite leg.",
"comments": "Keep knee of rear leg straight and both feet flat on floor. Keep upper body upright. Experiment with positioning feet further apart so minimum bending of forward knee is required.",
"other": "iliopsoas",
"target": "gastrocnemius"},"CalvesBentover":{"id": "2",
"exerciseid": "Bentover",
"musclegroup": "Calves",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Gastrocnemius",
"name": "Pike Straight Leg Calf Stretch",
"comments": "Although angle of ankles increase as hands travel closer to feet (requiring less ankleGastrocnemius flexibility), angle of hips decreases (requiring more hipHamstrings flexibility). As hamstrings are stretched through hip, they pull on gastrocnemius due to intertwining contact hamstrings have on gastrocnemius behind knee. If ankle or hip flexibility is not sufficient to place foot flat on floor, keep knees straight and bring heals as close as possible to floor while feeling mild stretch in calf.",
"other": "hamstrings",
"target": "gastrocnemius"},"CalvesSingleLegBentover":{"id": "3",
"exerciseid": "SingleLegBentover",
"musclegroup": "Calves",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Gastrocnemius",
"name": "Single Leg Pike Straight Leg Calf Stretch",
"preparation": "Step forward with one front forward. Bend over and place hands on floor well in front of forward foot with arms straight.",
"execution": "Position rear foot flat on floor while keeping rear knee straight and hold stretch. Repeat with opposite leg position.",
"comments": "Soleus may also be stretched in forward bent leg if it is placed far enough back to be sufficiently stretched. Although angle of ankle is greater with hands closer to rear foot (requiring less ankle flexibility), angle of hips is less (requiring more hip flexibility). As hamstrings are stretched through hip, they pull on gastrocnemius due to intertwining contact hamstrings have on gastrocnemius behind knee. If ankle or hip flexibility is not sufficient to place rear foot flat on floor, keep knee straight and bring heel as close as possible to floor while feeling mild stretch in calf.",
"other": "hamstrings, soleus",
"target": "gastrocnemius"},"CalvesStep":{"id": "4",
"exerciseid": "Step",
"musclegroup": "Calves",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Gastrocnemius",
"name": "Step Straight Leg Calf Stretch",
"preparation": "Position toes and balls of feet on stair step or calf block with arches and heels extending off. Use railing or wall for balance.",
"execution": "With knees straight, shift body weight to one foot. Hold stretch. Repeat with opposite leg.",
"comments": "None",
"target": "gastrocnemius"},"CalvesTowel":{"id": "5",
"exerciseid": "Towel",
"musclegroup": "Calves",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Gastrocnemius",
"name": "Towel Straight Leg Calf Stretch",
"preparation": "Sit of floor or mat and place towel or band under foot. With both ends of towel or band in each hand, straighten leg with towel under foot.",
"execution": "Pull towel and hold stretch. Repeat with opposite leg.",
"comments": "Opposite leg may be keep bent or straight off to side.",
"target": "gastrocnemius"},"CalvesWall":{"id": "6",
"exerciseid": "Wall",
"musclegroup": "Calves",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Gastrocnemius",
"name": "Wall Straight Leg Calf Stretch",
"preparation": "Place both hands on wall with arms extended. Lean against wall with one leg bent forward and other leg extended back with knee straight and foot positioned directly forward.",
"execution": "Push rear heal to floor and move hips slightly forward. Hold stretch. Repeat with opposite leg.",
"comments": "None.",
"target": "gastrocnemius"}}