{"ShouldersSTRearDeltRow":{"id": "0",
"exerciseid": "STRearDeltRow",
"musclegroup": "Shoulders",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Suspended Rear Delt Row",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Grasp suspension handles and momentarily step back until arms are extended forward and straight. While keeping arms straight and shoulders back, step forward so body reclines back behind suspension handles.Position body and legs straight at desired angle hanging from handles with arms straight. Internally rotate shoulders so elbows are positioned directly outwards.",
"execution": "Pull body up while keeping elbows pointed directly out to each side and body and legs straight. Pull until elbows are directly lateral to each side without allowing elbows to drop. Return until arms are extended straight and shoulders are stretched forward, maintaining high elbow position. Repeat.",
"comments": "If elbows fall so upper arms no longer travels perpendicular to trunk, Latissimus Dorsi becomes involved. Elbows should be positioned directly lateral to shoulders at highest position throughout movement. Executing exercise with elbows dropping lower than shoulders is not sufficient position to target rear deltoids. A more upright position (ie lighter resistance) is required than what is used on Suspended Row for General B ack. Dismounting can be achieved by walking backward until body is upright. This exercise can be performed on TRX style suspension trainer or adjustable length gymnastics rings. Also known as Suspended Rear Delt Body Row, Suspended Rear Delt Supine Row, or Suspended Rear Delt Inverted Row. Easier Resistance is least when body is positioned upright at top of exercise. Movement can be made easier with staggered foot position by placing one foot slightly back. Harder This movement can be made more challenging by placing feet more forward, thereby, angling body back at initiation of movement. In which case, stance can be on heels with forefeet pointing upward. See Gravity Vectors for greater understanding of how body angle influences resistance.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "hamstrings, gluteusmaximus, deltoidlateral, erectorspinae",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "brachialis, infraspinatus, trapeziusmiddle, rhomboids, trapeziuslower, brachioradialis, teresminor",
"target": "deltoidposterior"},"ShouldersSTReverseFly":{"id": "1",
"exerciseid": "STReverseFly",
"musclegroup": "Shoulders",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Suspended Reverse Fly",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Grasp suspension handles and momentarily step back until arms are extended forward and straight. While keeping arms straight and shoulders back, step forward so body reclines back behind suspension handles. Position body and legs straight at desired angle hanging from handles with arms straight. Internally rotate shoulders so elbows are positioned directly outwards with arms straight or slightly bent. Shoulder should be positioned approximately 90 relative to torso position.",
"execution": "Pull handles out to sides while keeping stiff elbow position and maintaining shoulder at 90 plane to torso throughout exercise. Raise up until upper arms are inline to one another. Return to original position in same plane and repeat.",
"comments": "Upper arms should travel in transverse path at shoulder level without allowing elbows to drop to minimize Latissimus Dorsi involvement. A very upright position (ie very light resistance) with one foot positioned slightly back (see Easier) is typically required for proper execution. Take care to maintain tension on suspension trainer near top of movement. Dismounting can be achieved by walking backward until body is upright or stepping out at top of movement. This exercise can be performed on TRX style suspension trainer or adjustable length gymnastics rings. Easier Resistance is least when body is positioned upright at top of exercise. Movement can be made easier with staggered foot position by placing one foot slightly back (as shown), as most commonly performed in this particular exercises. Harder Apart from a regular stance (no staggering feet). This movement can be made more challenging by placing feet more forward, thereby angling body back at initiation of movement. In which case, stance can be on heels with forefeet pointing upward. See Gravity Vectors for greater understanding of how body angle influences resistance.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "hamstrings, gluteusmaximus, deltoidlateral, erectorspinae",
"synergists": "infraspinatus, trapeziusmiddle, rhomboids, trapeziuslower, teresminor",
"target": "deltoidposterior"}}