{"ThighsSMGoodMorning":{"id": "0",
"exerciseid": "SMGoodMorning",
"musclegroup": "Thighs",
"equipment": "smith",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Smith Good-morning",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Position bar on back of shoulders. Grasp bar to sides. Disengage bar by rotating bar back.",
"execution": "Bend hips to lower torso forward until parallel to floor. Raise torso until hips are extended. Repeat.",
"comments": "Begin with very light weight and add additional weight gradually to allow adequate adaptation. Throughout lift, keep back and knees straight. At lower position, forefoot may raise off floor slightly. Do not lower weight beyond mild stretch. Full range of motion will vary from person to person depending on flexibility. Also see Bent Knee Goodmorning emphasizing Glutes.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"synergists": "gluteusmaximus, adductors",
"target": "hamstrings"},"ThighsSMStraightLegDeadlift":{"id": "1",
"exerciseid": "SMStraightLegDeadlift",
"musclegroup": "Thighs",
"equipment": "smith",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Smith Straight Leg Deadlift",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand with shoulder width or narrower stance on elevated platform with thigh against bar. Grasp bar with shoulder width or slightly wider overhand grip. Disengage bar by rotating bar back.",
"execution": "With knees straight, lower bar toward top of feet by bending hips. After hips can no longer flex, bend waist as bar approaches top of feet. Lift bar by extending waist and hip until standing upright. Pull shoulders back slightly if rounded. Repeat.",
"comments": "Begin with very light weight and add additional weight gradually to allow lower back adequate adaptation. Throughout lift, keep arms and knees straight. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings and low back. Full range of motion will vary from person to person. Those with less flexibility may not even need to stand on platform. See Dangerous Exercise Essay. Also see Straight Back Straight Leg Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, trapeziusmiddle, levatorscapulae, trapeziuslower, rhomboids",
"synergists": "gluteusmaximus, adductors, erectorspinae",
"target": "hamstrings"},"ThighsSMStrBackStrLegDeadlift":{"id": "2",
"exerciseid": "SMStrBackStrLegDeadlift",
"musclegroup": "Thighs",
"equipment": "smith",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Smith Straight-back Straight-leg Deadlift",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand with shoulder width or narrower stance with thigh against bar. Grasp bar with shoulder width or slightly wider overhand grip. Disengage bar by rotating bar back.",
"execution": "With knees and back straight, lower bar by bending hips until hamstrings are tight, or just before lower back bends. Lift bar by extending hips until straight. Pull shoulders back slightly if rounded. Repeat.",
"comments": "Throughout lift, keep arms, knees, and back straight. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch. Full range of motion will vary from person to person depending on flexibility. Stand on elevated platform if smith machine does not allow full range of motion. Also see Straight Leg Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, trapeziusmiddle, erectorspinae, levatorscapulae, trapeziuslower, rhomboids",
"synergists": "gluteusmaximus, adductors",
"target": "hamstrings"}}