{"UpperArmsLVPreacherCurlH":{"id": "0",
"exerciseid": "LVPreacherCurlH",
"musclegroup": "UpperArms",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Brachialis",
"name": "Lever Preacher Curl (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on curl machine placing back of arms on pad. Grasp lever handles with underhand grip. Align elbows at same pivot point as fulcrum of lever.",
"execution": "Raise lever handles toward shoulders. Lower handles until arms are fully extended. Repeat.",
"comments": "Seat should be adjusted to allow arm pit to rest near top of pad. Back of upper arm should remain on pad throughout movement. If no resistance is experienced during initial range of motion, make sure seat is adjusted to allow for back of arm to be positioned flush against arm pad. If resistance is still not experienced, consider keeping wrists in a slight flexed position to compensate. If machine has secondary lever (as shown), it is not as essential to position elbows inline with the primary fulcrum, as would otherwise be required. Long head (lateral head) of biceps brachii is activated significantly more than short head (medial head) of biceps brachii since short head enters into active insufficiency as it continues to contract. Long head of Triceps Brachii is only significant activated as antagonist stabilizer when it approaches passive insufficiency as elbow nears full flexion.",
"antagonist stabilizers": "tricepsbrachii",
"stabilizers": "wristflexors",
"synergists": "brachioradialis, bicepsbrachii",
"target": "brachialis"},"UpperArmsLVPreacherCurlHighPL":{"id": "1",
"exerciseid": "LVPreacherCurlHighPL",
"musclegroup": "UpperArms",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Brachialis",
"name": "Lever Preacher Curl (arms high, plate loaded)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on curl machine. Grasp lever handles with underhand grip. Align elbows at same pivot point as fulcrum of lever while placing back of arms up on pads.",
"execution": "Pull lever handles toward shoulders. Return handles until arms are fully extended. Repeat.",
"comments": "Back of upper arms should remain on pad throughout movement. If machine has secondary lever (as shown), it is not as essential to position elbows inline with the primary fulcrum, as would otherwise be required. Long head (lateral head) of biceps brachii is activated significantly more than short head (medial head) of biceps brachii since short head enters into active insufficiency as it continues to contract. Long head of Triceps Brachii is only significantly activated as antagonist stabilizer when it approaches passive insufficiency as elbow nears full flexion. Also see movement on preacher machine with arms positioned lower.",
"antagonist stabilizers": "tricepsbrachii",
"stabilizers": "wristflexors",
"synergists": "brachioradialis, bicepsbrachii",
"target": "brachialis"},"UpperArmsLVAlterPreacherCurlHighPL":{"id": "2",
"exerciseid": "LVAlterPreacherCurlHighPL",
"musclegroup": "UpperArms",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Brachialis",
"name": "Lever Alternating Preacher Curl (arms high, plate loaded)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on curl machine. Grasp lever handles with underhand grip. Align elbows at same pivot point as fulcrum of lever while placing back of arms up on pads.",
"execution": "Pull one lever handle toward shoulder. Return handle until arm is fully extended. Repeat with opposite arm. Continue alternating movement between arms.",
"comments": "Back of upper arms should remain on pad throughout movement. If machine has secondary lever (as shown), elbows can be positioned further away from primary fulcrum. Long head (lateral head) of biceps brachii is activated significantly more than short head (medial head) of biceps brachii since short head enters into active insufficiency as it continues to contract. Long head of Triceps Brachii is only significantly activated as antagonist stabilizer when it approaches passive insufficiency as elbow nears full flexion. See exercise performed with both arms simultaneously.",
"antagonist stabilizers": "tricepsbrachii",
"stabilizers": "wristflexors",
"synergists": "brachioradialis, bicepsbrachii",
"target": "brachialis"},"UpperArmsLVPreacherCurlNoSeatPL":{"id": "3",
"exerciseid": "LVPreacherCurlNoSeatPL",
"musclegroup": "UpperArms",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Brachialis",
"name": "Lever Preacher Curl (no seat, plate loaded)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand behind arm pad and face lever handles on opposite side. Place one foot forward under arm pad and opposite foot back on foot bar. Lean over arm pads and grasp handles with slightly narrower than shoulder width underhand grip. Squat down and position back of upper arms on arm pads.",
"execution": "Raise lever handles toward shoulders. Lower handles until arms are fully extended. Repeat.",
"comments": "Position armpit to rest near top of pad. Back of upper arm should remain on pad throughout movement. Notice that this machine has secondary lever so elbows are not aligned with primary fulcrum. Also see movement performed with narrow grip. The particular machine shown doubles as Triceps Extension Machine by placing weight on opposite side of fulcrum. Long head (lateral head) of biceps brachii is activated significantly more than short head (medial head) of biceps brachii since short head enters into active insufficiency as it continues to contract. Long head of Triceps Brachii is only significantly activated as antagonist stabilizer when it approaches passive insufficiency as elbow nears full flexion. Also see movements performed on machine with seat and arms positioned higher.",
"antagonist stabilizers": "tricepsbrachii",
"stabilizers": "wristflexors",
"synergists": "brachioradialis, bicepsbrachii",
"target": "brachialis"}}