{"ChestCBStandingChestPress":{"id": "0",
"exerciseid": "CBStandingChestPress",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Cable Standing Chest Press",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between two shoulder height pulleys, facing away from cable columns. Grasp cable stirrups from each side. Position stirrups to sides of chest with elbows out to sides. Position forearms horizontally and parallel with hands elbow width. Step forward in lunging posture (one foot in front and other foot behind). Lean and step forward with one foot in front, bending forward leg.",
"execution": "Push stirrups forward until arms are straight and parallel to one another. Return stirrups to original position until slight stretch is felt in chest or shoulders. Repeat.",
"comments": "Stirrup should follow slight arch pattern as hands travel closer together toward extension. Cable pulleys should be relatively close together, narrower than width of arms extended out to sides (but not too close), closer than what is typically found on standard cable cross over setup.",
"stabilizers": "serratusanterior, pectoralisminor",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "tricepsbrachii, pectoralisclavicular, deltoidanterior",
"target": "pectoralissternal"},"ChestCBBarBenchPress":{"id": "1",
"exerciseid": "CBBarBenchPress",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Cable Bar Bench Press",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Position adjustable pulley higher than intended height but within arms reach from bench. Position bench under cable bar. Lie supine on bench. While lying on bench, reach over and lower each pulley into intended position so that cables are taut in lowest position with bar on chest. Grasp bar with both hands using wide oblique overhand grip.",
"execution": "Press bar upward until arms are extended. Lower bar to chest or until slight stretch is felt in shoulders. Repeat.",
"comments": "Range of motion will be compromised if grip is too wide. Also see Bench Press Analysis and Cable Bar Standing Bench Press.",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "tricepsbrachii, pectoralisclavicular, deltoidanterior",
"target": "pectoralissternal"},"ChestCBBenchPress":{"id": "2",
"exerciseid": "CBBenchPress",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Cable Bench Press",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie on bench and grasp stirrups attached to low cable pulley on each side. Position stirrups out to each side of chest with bent arm under each wrist.",
"execution": "Push stirrups up over each shoulder until arms are straight and parallel to one another. Return stirrups to original position, until slight stretch is felt in shoulders or chest. Repeat.",
"comments": "Stirrup should follow slight arch pattern, above upper arm between elbow and chest at bottom, traveling inward over each shoulder at t op. Also see Bench Press Analysis.",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "tricepsbrachii, pectoralisclavicular, deltoidanterior",
"target": "pectoralissternal"},"ChestCBTwistingChestPress":{"id": "3",
"exerciseid": "CBTwistingChestPress",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Cable Twisting Chest Press",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on seat and grasp stirrup to one side. Position elbow out to side, slightly lower than shoulder height. Position hand slightly narrower than elbow width, in front of upper arm. Lean forward in seat.",
"execution": "Push stirrup out in front of upper chest while turning torso away from pulley. Return stirrup and torso back to original position allowing torso to rotate back until slight stretch is felt through chest, shoulder or waist. Repeat.",
"comments": "The effective range of motion of Pectoralis Major is only about half of what it is in nontwisting movement.",
"antagonist stabilizers": "erectorspinae",
"stabilizers": "rectusabdominis",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "pectoralisclavicular, tricepsbrachii, serratusanterior, deltoidanterior, obliques",
"target": "pectoralissternal"},"ChestCBDeclineChestPress":{"id": "4",
"exerciseid": "CBDeclineChestPress",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Cable Decline Chest Press",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on seat and grasp stirrups to each side. Position elbows out to sides, slightly lower than shoulder height. Position hands slightly narrower than elbow width in front of upper arms.",
"execution": "Push stirrups forward and slightly downward until arms are straight and parallel to one another. Return stirrups to original position, until slight stretch is felt in shoulders or chest. Repeat.",
"comments": "Stirrup should follow slight arch pattern, in front of upper arm between elbow and chest in stretched position, traveling inward and slightly downward just below each shoulder at ex tended position. Latissimus Dorsi involvement is low on Decline Bench Press (Barnett 1995).",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "tricepsbrachii, pectoralisclavicular, deltoidanterior",
"target": "pectoralissternal"},"ChestCBSeatedFly":{"id": "5",
"exerciseid": "CBSeatedFly",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Cable Seated Fly",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Sit on seat and grasp stirrups to each side. Slightly bend elbows and internally rotate shoulders so elbows are back.",
"execution": "Keeping elbows pointed high, bring cable attachments together in hugging motion with elbows in fixed position. Return to starting position until slight stretch. Repeat.",
"comments": "Shoulders are kept internally rotated so elbows are pointing back and out to sides.",
"stabilizers": "brachialis, wristflexors, bicepsbrachii, tricepsbrachii",
"synergists": "bicepsbrachii, pectoralisclavicular, deltoidanterior",
"target": "pectoralissternal"},"ChestCBChestPress":{"id": "6",
"exerciseid": "CBChestPress",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Cable Chest Press",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on seat and grasp stirrups to each side. Position elbows out to sides, slightly lower than shoulder height. Position hands slightly narrower than elbow width in front of upper arms.",
"execution": "Push stirrups out straight until arms are straight and parallel to one another. Return stirrups to original position, until slight stretch is felt in shoulders or chest. Repeat.",
"comments": "Stirrup should follow slight arch pattern, in front of upper arm between elbow and chest in stretched position, traveling inward in front of each shoulder at extended position.",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "tricepsbrachii, pectoralisclavicular, deltoidanterior",
"target": "pectoralissternal"},"ChestCBOneArmChestPress":{"id": "7",
"exerciseid": "CBOneArmChestPress",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Cable One Arm Chest Press",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on seat and grasp stirrup to one side. Position elbows out to side, slightly lower than shoulder height. Position hand slightly narrower than elbow width in front of upper arm.",
"execution": "Push stirrups out straight in front of shoulder until arm is straight. Return stirrups to original position until slight stretch is felt through shoulder or chest. Repeat.",
"comments": "Also see exercise performed with twisting movement. Pectoralis Minor and Serratus Anterior act as stabilizers if torso is not against back support as shown.",
"stabilizers": "serratusanterior, pectoralisminor",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "tricepsbrachii, pectoralisclavicular, deltoidanterior",
"target": "pectoralissternal"},"ChestCBDeclineFly":{"id": "8",
"exerciseid": "CBDeclineFly",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Cable Decline Fly",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Grasp two opposing high pulley dumbbell attachments. Lie supine on decline bench, in middle and perpendicular to both pulleys. Slightly bend elbows and internally rotate shoulders so elbows are back.",
"execution": "Bring cable stirrups together above upper abdomen in hugging motion elbows in fixed position and shoulders internally rotated so elbows are to sides. Return to starting position until chest is slightly stretched. Repeat.",
"comments": "Since incline of bench does not actually affect angle of pull as with dumbbells, similar effect can be achieved on flat bench if cable stirrups are brought together above upper abdomen instead of chest. Keep shoulders internally rotated so elbows point downward at bottom position and outward at top position. Keep elbows at fixed angle, only slightly bent. Anterior Deltoid will no longer act as synergist in steep decline bench position.",
"stabilizers": "brachialis, wristflexors, bicepsbrachii, tricepsbrachii",
"synergists": "bicepsbrachii, pectoralisclavicular, deltoidanterior",
"target": "pectoralissternal"},"ChestCBStandingDeclineChestPress":{"id": "9",
"exerciseid": "CBStandingDeclineChestPress",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Cable Standing Decline Chest Press",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between two high pulleys, facing away from cable columns. Grasp cable stirrups from each side. Position stirrups down to sides of lower chest with elbows high out to sides. Angle forearms downward with hands elbow width or slightly narrower. Lean and step forward with forward leg bent or stand feet side by side with both legs slightly bent (as shown).",
"execution": "Push stirrups at forwarddownward angle until arms are straight and parallel to one another. Return stirrups to original position until slight stretch is felt in chest or shoulders. Repeat.",
"comments": "Stirrup should follow slight arch pattern as hands travel closer together toward extension. Cable pulleys should be relatively close together, narrower than width of arms extended out to sides (but not too close), closer than what is typically found on standard cable cross over setup.",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "pectoralisminor, tricepsbrachii, pectoralisclavicular, deltoidanterior",
"target": "pectoralissternal"},"ChestCBTwistingStandingChestPress":{"id": "10",
"exerciseid": "CBTwistingStandingChestPress",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Cable Twisting Standing Chest Press",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Grasp cable stirrup from chest height pulley. Turn body away from pulley. Position elbow of loaded arm out to side, lower chest height. Position loaded hand back approximately shoulder height and elbow width. Step far forward with foot of opposite side of loaded arm. Bend knees and position heel off rear foot off floor.",
"execution": "Push stirrups away from body, horizontally until arm is straight and inline with cable. Return stirrups to original position until slight stretch is felt in chest or shoulder. Repeat. Continue with opposite arm.",
"comments": "Stirrup should follow slight arch pattern, in front of upper arm between elbow and chest in stretched position, traveling inward in front shoulder at contracted position. In standing position, both spinal rotation and hip rotation contribute to bodys rotation. Because rear leg is only supported by forefoot, hip of forward leg is utilized (hip internal rotation  transverse adduction) much greater than hip of rear leg since forward leg offers more secured base of support. The effective range of motion of Pectoralis Major is only about half of what it is in bilateral nontwisting movement.",
"antagonist stabilizers": "erectorspinae",
"stabilizers": "rectusabdominis",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "erectorspinae, pectoralisclavicular, tricepsbrachii, tensorfasciaelatae, gluteusmedius, serratusanterior, iliopsoas, gluteusminimus, quadratuslumborum, deltoidanterior, adductors, obliques",
"target": "pectoralissternal"},"ChestCBLyingFly":{"id": "11",
"exerciseid": "CBLyingFly",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Cable Lying Fly",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Grasp two opposing low pulley stirrup attachments. Lie supine on bench, in middle and perpendicular to both pulleys. Slightly bend elbows and internally rotate shoulders so elbows are back.",
"execution": "Bring cable attachments together in hugging motion with elbows in fixed position and shoulders internally rotated so elbows are to sides. Return to starting position until slight stretch. Repeat.",
"comments": "Keep shoulders internally rotated so elbows point downward at bottom position and outward at top position. Keep elbows at fixed angle, only slightly bent.",
"stabilizers": "brachialis, wristflexors, bicepsbrachii, tricepsbrachii",
"synergists": "bicepsbrachii, pectoralisclavicular, deltoidanterior",
"target": "pectoralissternal"},"ChestCBStandingFly":{"id": "12",
"exerciseid": "CBStandingFly",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Cable Standing Fly",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Grasp two opposing high pulley dumbbell attachments. Stand with pulleys to each side. Bend over slightly by flexing hips and knees. Bend elbows slightly and internally rotate shoulders so elbows are back initially.",
"execution": "Bring cable attachments together in hugging motion with elbows in fixed position. Keep shoulders internally rotated so elbows are pointed upward at top and out to sides at bottom. Return to starting position until chest muscles are stretched. Repeat.",
"comments": "Under greater resistance, positioning torso at lower angle downward (by bending over at hips), will allow upper body weight to counterbalance upward pull of cables, as opposed to stepping forward and struggling with backward pull of cables.",
"antagonist stabilizers": "erectorspinae",
"stabilizers": "brachialis, tricepsbrachii, wristflexors, rectusabdominis, bicepsbrachii, obliques",
"synergists": "latissimusdorsi, pectoralisclavicular, levatorscapulae, pectoralisminor, rhomboids",
"target": "pectoralissternal"},"ChestCBBarStandingChestPress":{"id": "13",
"exerciseid": "CBBarStandingChestPress",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Cable Bar Standing Chest Press",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand facing behind cable bar, mounted on each side to shoulder height narrow double pulley cables. Grasp cable bar with wide overhand grip. Position bar chest height with elbows angled behind. Lean and step forward with one foot in front, bending forward leg.",
"execution": "Push cable bar forward until arms are straight. Return cable bar to original position until slight stretch is felt in chest or shoulders. Repeat.",
"comments": "Cable pulleys should be relatively close together, narrower than width of arms extended out to sides (but not too close), closer than what is typically found on standard cable cross over setup. Range of motion will be compromised if grip is too wide.",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "pectoralisminor, tricepsbrachii, pectoralisclavicular, deltoidanterior",
"target": "pectoralissternal"},"ChestCBBarStandingDeclineChestPress":{"id": "14",
"exerciseid": "CBBarStandingDeclineChestPress",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Cable Bar Standing Decline Chest Press",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand facing behind cable bar mounted on each side to shoulder height narrow double pulley cables. Grasp cable bar with wide overhand grip. Position bar chest height with elbows angled behind and above. Lean and step forward with one foot in front, bending forward knee.",
"execution": "Push cable bar forward and downward until bar is about hip height and arms are straight. Return cable bar to original position until slight stretch is felt in chest or shoulders. Repeat.",
"comments": "Cable pulleys should be relatively close together, narrower than width of arms extended out to sides (but not too close), closer than what is typically found on standard cable cross over setup.",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "pectoralisminor, tricepsbrachii, pectoralisclavicular, deltoidanterior",
"target": "pectoralissternal"},"ChestCBChestDip":{"id": "15",
"exerciseid": "CBChestDip",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Cable Chest Dip",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Step between wide dip bars with dip belt around waist. Kneel as close as possible to low pulley and attach cable to dip belt. Stand up and mount dip bar with oblique grip (bar diagonal under palm), arms straight with shoulders above hands. Keep hips and knees bent.",
"execution": "Lower body by bending arms, allowing elbows to flare out to sides. When slight stretch is felt in chest or shoulders, push body up until arms are straight and repeat.",
"comments": "The animation depicts dip bar placed in front of low pull cable. If cable dip machine is available, attach hip harness and step up to dip bar. Also see Cable Triceps Dip.",
"stabilizers": "trapeziuslower",
"synergists": "latissimusdorsi, pectoralisclavicular, tricepsbrachii, levatorscapulae, teresmajor, deltoidanterior, pectoralisminor, rhomboids",
"target": "pectoralissternal"}}