{"HipsWtSquat":{"id": "0",
"exerciseid": "WtSquat",
"musclegroup": "Hips",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Weighted Belt Squat",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Place weight on dip belt around waist. Step up onto boxes or benches spaced apart foot on each bench. Arms can be extended forward throughout exercise.",
"execution": "Squat down by bending hips back while allowing knees to bend forward slightly, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Squat up by extending knees and hips until legs are straight. Return and repeat.",
"comments": "Keep head facing forward, back straight, chest high, and feet flat on surface equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis. Also see similar exercise Cable Belt Squat.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsWTFrontSquat":{"id": "1",
"exerciseid": "WTFrontSquat",
"musclegroup": "Hips",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Weighted Front Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand with feet shoulder width or slightly narrower apart. Holding weight plate upper chest height with both hands.",
"execution": "Squat down by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Extend knees and hips until legs are straight. Return and repeat.",
"comments": "Keep head facing forward, back straight, chest high, and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis. Also see Kettlebell Goblet Squat.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, erectorspinae, pectoralisclavicular, levatorscapulae, brachioradialis, serratusanterior, bicepsbrachii, brachialis, supraspinatus, trapeziusmiddle, deltoidlateral, deltoidanterior, trapeziuslower",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsWtReverseHyperextension":{"id": "2",
"exerciseid": "WtReverseHyperextension",
"musclegroup": "Hips",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Weighted Reverse Hyper-extension",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Place sandbag or medicine ball between ankles. Lay torso and waist on bench and grasp handles. Feet should be above floor with legs straight.",
"execution": "Raise weight by extending hips as high as possible until legs are nearly straight. Lower legs to original position. Repeat.",
"comments": "Exercise can be performed without added weight. Some individuals may be able to articulate both through the hips and through the lower back (i.e. lumbar spine), in which case, Erector Spinae also becomes synergist.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"synergists": "hamstrings",
"target": "gluteusmaximus"},"HipsWtSingleLegSquat":{"id": "3",
"exerciseid": "WtSingleLegSquat",
"musclegroup": "Hips",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Weighted Single Leg Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand with arms extended out in front, holding medicine ball or weight plate. Balance on one leg with opposite leg extended straight leg forward as high as possible.",
"execution": "Squat down as far as possible while keeping leg elevated off of floor. Keep supporting knee pointed same direction as foot supporting. Raise body back up to original position until knee and hip of supporting leg is straight. Return and repeat. Continue with opposite leg.",
"comments": "Supporting knee should point same direction as foot throughout movement. Range of motion will be improved with greater leg strength and glute flexibility. Significant spinal flexion occurs at bottom of deep single leg squat to maintain center of gravity over foot. Erector Spinae becomes a stabilizer if spine is kept straight. An easier alternative style is to place barbell on back of shoulders, cross lower leg above knee of supporting leg or wrap one foot around back of supporting leg.",
"stabilizers": "trapeziusupper, levatorscapulae, deltoidanterior, sartorius, trapeziusmiddle, gluteusminimus, deltoidlateral, trapeziuslower, rectusabdominis, pectoralisclavicular, gluteusmedius, tensorfasciaelatae, serratusanterior, wristextensors, iliopsoas, quadratuslumborum, obliques, pectineus, quadriceps",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, erectorspinae, adductors, quadriceps",
"target": "gluteusmaximus"}}