{"ThighsDBStraightLegDeadlift":{"id": "0",
"exerciseid": "DBStraightLegDeadlift",
"musclegroup": "Thighs",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Dumbbell Straight Leg Deadlift",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand with shoulder width or narrower stance. Grasp dumbbells to sides.",
"execution": "With knees straight, lower dumbbells to top or sides of feet by bending hips. Bend waist as bar approaches feet. Lift dumbbells by extending hips and waist until standing upright. Pull shoulders back slightly if rounded. Repeat.",
"comments": "Begin with very light weight and add additional weight gradually to allow lower back adequate adaptation. Throughout lift, keep arms and knees straight. Keep dumbbells close to legs. Do not pause or bounce at bottom of lift. Lower back may bend slightly during full hip flexion phase. Do not lower weight beyond mild stretch throughout hamstrings and low back. Full range of motion will vary from person to person depending on flexibility. See Dangerous Exercise Essay. Also see Straight Back Straight Leg Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, trapeziusmiddle, levatorscapulae, trapeziuslower, rhomboids",
"synergists": "gluteusmaximus, adductors, erectorspinae",
"target": "hamstrings"},"ThighsDBStrBackStrLegDeadlift":{"id": "1",
"exerciseid": "DBStrBackStrLegDeadlift",
"musclegroup": "Thighs",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Dumbbell Straight-back Straight-leg Deadlift",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand with shoulder width or narrower stance. Grasp dumbbells to each side.",
"execution": "With knees straight, lower dumbbells by bending hips until hamstrings are tight, or just before lower back bends. Lift dumbbells by extending hips until straight. Pull shoulders back slightly at top of lift if rounded. Repeat.",
"comments": "Throughout lift, keep arms, knees, and back straight. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch. Full range of motion will vary from person to person depending on flexibility. Also see Straight Leg Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, trapeziusmiddle, erectorspinae, levatorscapulae, trapeziuslower, rhomboids",
"synergists": "gluteusmaximus, adductors",
"target": "hamstrings"}}