{"ThighsBBGoodMorning":{"id": "0",
"exerciseid": "BBGoodMorning",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Barbell Good-morning",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Position barbell on back of shoulders and grasp bar to sides.",
"execution": "Keeping back straight, bend hips to lower torso forward until parallel to floor. Raise torso until hips are extended. Repeat.",
"comments": "Begin with very light weight and add additional weight gradually to allow adequate adaptation. Throughout lift, keep back and knees straight. Do not lower weight beyond mild stretch through hamstrings. Full range of motion will vary from person to person depending on flexibility. Also see Bent Knee Goodmorning emphasizing Glutes.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"synergists": "gluteusmaximus, adductors",
"target": "hamstrings"},"ThighsBBGluteHamRaise":{"id": "1",
"exerciseid": "BBGluteHamRaise",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Barbell Glute-Ham Raise",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Place ankles between ankle roller pads with feet on vertical platform and position knees on pad with lower thighs against large padded hump. If barbell can safely be placed on horizontal handles, grasp barbell in upright position and place behind shoulders. If barbell is placed on floor, lower torso by extending knees and flexing hips, then position barbell on back of shoulders. Grasp bar to sides.",
"execution": "From lower position, raise torso by extending hips until fully extended. Continue to raise body by flexing knees until body is upright. Lower body by straightening knees until body is horizontal. Continue to lower torso by bending hips until body is upside down. Repeat.",
"comments": "Exercise can be performed without added weight until more resistance is needed.",
"antagonist stabilizers": "tibialisanterior, rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"synergists": "popliteus, sartorius, gracilis, gluteusmaximus, adductors, gastrocnemius",
"target": "hamstrings"},"ThighsBBHamstringRaise":{"id": "2",
"exerciseid": "BBHamstringRaise",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Barbell Inverse Leg Curl",
"utility": "Basic",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Adjust padded supports and kneel upright in apparatus. Position knees against large roller pad or nearupper side of padded hump, ankles between padded supports, and feet on platform. Place barbell on back of shoulders and grasp bar to sides.",
"execution": "Lower body until horizontal by straightening knees. Raise body by flexing knees only allowing hips to bend slightly. Repeat.",
"comments": "This is an advanced exercise performed on Glute Ham Raise Apparatus. This movement is also known as Barbell Hamstring Raise. Exercise can be performed without added weight until more resistance is needed. Dorsal flexion of ankle reduces active insufficiency of Gastrocnemius allowing it to assist in knee flexion. Also see Inverse Leg Curl comments.",
"antagonist stabilizers": "tibialisanterior, quadriceps, rectusabdominis, obliques",
"stabilizers": "erectorspinae, gluteusmaximus, adductors",
"synergists": "sartorius, popliteus, gracilis, gastrocnemius",
"target": "hamstrings"},"ThighsBBHyperextension":{"id": "3",
"exerciseid": "BBHyperextension",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Barbell Hyperextension",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Position thighs prone on large pad and lower leg under padded brace. Place barbell on back of shoulders and grasp bar to sides.",
"execution": "Raise upper body until hip and waist are fully extended. Lower body by bending hips and waist until fully flexed. Repeat.",
"comments": "Adjust lower leg brace so pressure is evenly distributed on thigh pad. Begin with body weight and add additional weight gradually to allow lower back adequate adaptation. Maintain barbells position on back of shoulders when upper body is lowered. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings and low back. Full range of motion will vary from person to person. Also see Barbell Back Extension and Barbell Back Raise.",
"stabilizers": "latissimusdorsi, tricepsbrachii, brachioradialis, bicepsbrachii, deltoidposterior, brachialis, teresmajor, trapeziuslower, pectoralisminor, rhomboids",
"synergists": "gluteusmaximus, adductors, erectorspinae",
"target": "hamstrings"},"ThighsBBHipExtension":{"id": "4",
"exerciseid": "BBHipExtension",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Barbell Back Raise (on hyperextension apparatus)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand in hyperextension apparatus. Position thighs prone on large pad and lower leg under padded bar. Place barbell on back of shoulders and grasp bar to sides.",
"execution": "Lower body by bending hips until fully flexed. Raise, or extend hips until torso is parallel to legs. Repeat.",
"comments": "Adjust lower leg brace so pressure is evenly distributed on thigh pad. Maintain barbells position on back of shoulders when upper body is lowered. Do not lower weight beyond mild stretch. Full range of motion will vary from person to person. Also known as Barbell Hip Extension. Also see Barbell Hyperextension and Barbell Back Extension.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, tricepsbrachii, brachioradialis, bicepsbrachii, deltoidposterior, brachialis, teresmajor, erectorspinae, trapeziuslower, rhomboids",
"synergists": "gluteusmaximus, adductors",
"target": "hamstrings"},"ThighsBB45Hyperextension":{"id": "5",
"exerciseid": "BB45Hyperextension",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Barbell 45° Hyperextension",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Position thighs prone on padding. Hook heels on platform lip or under padded brace. Place barbell on back of shoulders and grasp bar to sides.",
"execution": "Raise upper body until hip and waist are fully extended. Lower body by bending hips and waist until fully flexed. Repeat.",
"comments": "Position pad high enough to evenly distribute body weight on thigh but not so high that range of motion is limited abdomen should not press on top side of pad when upper body is lowered. Begin with body weight and add additional weight gradually to allow lower back adequate adaptation. Maintain barbells position on back of shoulders when upper body is lowered. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings and low back. Full range of motion will vary from person to person. Also see Barbell Back Extension and Barbell Back Raise.",
"stabilizers": "latissimusdorsi, tricepsbrachii, brachioradialis, bicepsbrachii, deltoidposterior, brachialis, teresmajor, trapeziuslower, pectoralisminor, rhomboids",
"synergists": "gluteusmaximus, adductors, erectorspinae",
"target": "hamstrings"},"ThighsBB45HipExtension":{"id": "6",
"exerciseid": "BB45HipExtension",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Barbell 45° Back Raise (on hyperextension apparatus)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Position thighs prone on upper padding of 45degree hyperextension apparatus. Hook heels on platform lip or under padded brace. Place barbell on back of shoulders and grasp bar to sides.",
"execution": "Lower body by bending hips until fully flexed. Raise or extend hips until torso is parallel to legs. Repeat.",
"comments": "Position pad high enough to evenly distribute body weight on thigh but not so high that range of motion is limited abdomen should not press on top side of pad when upper body is lowered. Maintain barbells position on back of shoulders when upper body is lowered. Do not lower weight beyond mild stretch. Full range of motion will vary from person to person. Also known as Barbell 45degree Hip Extension. Also see Barbell Hyperextension and Barbell Back Extension.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, tricepsbrachii, brachioradialis, bicepsbrachii, deltoidposterior, brachialis, teresmajor, erectorspinae, trapeziuslower, rhomboids",
"synergists": "gluteusmaximus, adductors",
"target": "hamstrings"},"ThighsBBStraightLegDeadlift":{"id": "7",
"exerciseid": "BBStraightLegDeadlift",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Barbell Straight Leg Deadlift",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand with shoulder width or narrower stance on shallow platform with feet flat beneath bar. Bend knees and bend over with lower back straight. Grasp barbell with shoulder width overhand or mixed grip, shoulder width or slightly wider. Lift weight to standing position.",
"execution": "With knees straight, lower bar toward top of feet by bending hips. After hips can no longer flex, bend waist as bar approaches top of feet. Lift bar by extending waist and hip until standing upright. Pull shoulders back slightly if rounded. Repeat.",
"comments": "Begin with very light weight and add additional weight gradually to allow lower back adequate adaptation. Throughout lift, keep arms and knees straight. Keep bar over top of feet, close to legs. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings and low back. Full range of motion will vary from person to person. Choose platform height that allows contact with floor with slight stretch or set to height that allows bar to be lowered only millimeters from floor during warm up. This small reserve allows additional room to accommodate the hips loosen up and the grip to give slightly, but not so much that would increase risk of descending too far down, beyond a slight stretch. Those with less flexibility may not even need to stand on platform. When finished with set, dismount by lowering weight with knees bent and low back straight. See Dangerous Exercise Essay. Also see Straight Back Straight Leg Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, trapeziusmiddle, levatorscapulae, trapeziuslower, rhomboids",
"synergists": "gluteusmaximus, adductors, erectorspinae",
"target": "hamstrings"},"ThighsBBStrBackStrLegDeadlift":{"id": "8",
"exerciseid": "BBStrBackStrLegDeadlift",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Barbell Straight-back Straight-leg Deadlift",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp barbell from rack or deadlift from floor with shoulder width or slightly wider overhand or mixed grip. Stand with shoulder width or narrower stance.",
"execution": "With knees and back straight, lower bar by bending hips until hamstrings are tight, or just before lower back bends. Lift bar by extending hips until upright. Pull shoulders slightly back at top of lift if rounded. Repeat.",
"comments": "Throughout lift, keep arms, knees, and back straight. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch. Full range of motion will vary from person to person depending on flexibility. Rerack or deadlift weight back to floor. Also see Straight Leg Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, trapeziusmiddle, erectorspinae, levatorscapulae, trapeziuslower, rhomboids",
"synergists": "gluteusmaximus, adductors",
"target": "hamstrings"},"ThighsTBStraightLegDeadlift":{"id": "9",
"exerciseid": "TBStraightLegDeadlift",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Trap Bar Straight Leg Deadlift",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand on platform under loaded trap bar. Squat down and grasp handles to sides. Squat  Deadlift bar up to standing position.",
"execution": "With knees straight, lower bar down by bending hips. After hips can no longer flex, bend waist as weights approach foor. Hands should be lowered near sides of ankles. Set weight on floor. Lift bar by extending waist and hip until standing upright. Pull shoulders back slightly if rounded. Repeat.",
"comments": "Not all trap bar designs may allow for this movement. A squared, openended trap bar is used in this demonstration. Begin with very light weight and add additional weight gradually to allow lower back adequate adaptation. Throughout lift, keep arms and knees straight. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings and low back. When finished with set, dismount by lowering weight with knees bent and low back straight. Full range of motion will vary from person to person. Those with less flexibility may need lower platform or may not even need to stand on elevated surface. See Dangerous Exercise Essay. Also see Straight Back Straight Leg Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, trapeziusmiddle, levatorscapulae, trapeziuslower, rhomboids",
"synergists": "gluteusmaximus, adductors, erectorspinae",
"target": "hamstrings"},"ThighsTBStrBackStrLegDeadlift":{"id": "10",
"exerciseid": "TBStrBackStrLegDeadlift",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Trap Bar Straight-back Straight-leg Deadlift",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand with feet shoulder width or narrower in trap bar, weight to each side. Squat down with feet flat and grasp handles to sides. Deadlift from floor.",
"execution": "With knees and back straight, lower bar by bending hips until hamstrings are tight, or just before lower back bends. Lift bar by extending hips until upright. Pull shoulders slightly back at top of lift if rounded. Repeat.",
"comments": "Not all trap bar designs may allow for this movement. A squared, openended trap bar is used in this demonstration. Throughout lift, keep arms, knees, and back straight. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch. Full range of motion will vary from person to person depending on flexibility. Deadlift weight back to floor.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, trapeziusmiddle, erectorspinae, levatorscapulae, trapeziuslower, rhomboids",
"synergists": "gluteusmaximus, adductors",
"target": "hamstrings"}}