{"CalvesASSingleLegCalfRaiseSelf":{"id": "0",
"exerciseid": "ASSingleLegCalfRaiseSelf",
"musclegroup": "Calves",
"equipment": "self-assisted",
"exercisetype": "WeightExercises",
"muscleclass": "Gastrocnemius",
"name": "Self-assisted Leg Calf Raise",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Position toes and balls of feet on calf block with heels and arches extending off. Place hands on support for assistance. Lift one leg to rear by bending knee.",
"execution": "Raise heel by extending ankle as high as possible, assisting with upper body as little as possible. Lower heel by bending ankle until calf is stretched. Repeat. Continue with opposite leg.",
"comments": "Keep knee straight throughout exercise or bend knee slightly only during stretch. Quadriceps serve as synergists muscle if knee is bent slightly during stretch. Clip shows use of pulling assistance from high support. If support is lower, assist by pushing on support. See Calf Exercise Analyses. Also see technique with assistance from opposite leg. Easier Resistance can be reduced by using both feet even with additional weight. Dumbbell Standing Calf Raise Harder To make movement more difficult, use only one hand for assistance or dont use assistance. Single Leg Calf Raise",
"stabilizers": "gluteusmedius, gluteusminimus, quadratuslumborum, obliques",
"synergists": "soleus",
"target": "gastrocnemius"},"CalvesASSingleLegCalfRaiseSelfFoot":{"id": "1",
"exerciseid": "ASSingleLegCalfRaiseSelfFoot",
"musclegroup": "Calves",
"equipment": "self-assisted",
"exercisetype": "WeightExercises",
"muscleclass": "Gastrocnemius",
"name": "Self-assisted Single Leg Calf Raise (with opposite leg)",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Position toes and ball of foot on calf block with heels and arches extending off. Place hand or hands on support for balance. Raise one ankle by bending knee forward, keeping forefoot on platform.",
"execution": "Raise body upward as high as possible by extending lower ankle while straightening knee of assisting leg. Lower heel by bending ankle while bending knee of assisting leg forward. Repeat. Continue with opposite leg positioning.",
"comments": "Keep knee of exercised leg straight throughout exercise. On assisting leg, keep ankle high and only assist minimal, just enough to raise body in a steady motion. See Calf Exercise Analyses. Also see technique with assistance from upper body. Easier Exercise can be made easier by exercising both legs simultaneously, even with additional resistance added. Dumbbell Standing Calf Raise Harder Use no assistance to make exercise more difficult. Single Leg Calf Raise",
"stabilizers": "gluteusmedius, gluteusminimus, quadratuslumborum, obliques",
"synergists": "soleus, gluteusmaximus, quadriceps",
"target": "gastrocnemius"}}