{"UpperArmsDBCurl":{"id": "0",
"exerciseid": "DBCurl",
"musclegroup": "UpperArms",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Biceps",
"name": "Dumbbell Curl",
"utility": "Basic",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Position two dumbbells to sides, palms facing in, arms straight.",
"execution": "With elbows to sides, raise one dumbbell and rotate forearm until forearm is vertical and palm faces shoulder. Lower to original position and repeat with opposite arm. Continue to alternate between sides.",
"comments": "Biceps may be exercised alternating (as described), simultaneous, or in simultaneousalternating fashion. When elbow is fully flexed, it can travel forward slightly, allowing forearms to be no more than vertical. This additional movement allows for relative release of tension in muscles between repetitions. Also see mechanical analysis of arm curl and question regarding elbow position.",
"stabilizers": "trapeziusupper, trapeziusmiddle, deltoidanterior, levatorscapulae, wristflexors",
"synergists": "brachialis, brachioradialis",
"target": "bicepsbrachii"},"UpperArmsDBInclineCurl":{"id": "1",
"exerciseid": "DBInclineCurl",
"musclegroup": "UpperArms",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Biceps",
"name": "Dumbbell Incline Curl",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit back on 4560 degree incline bench. With arms hanging down straight, position two dumbbells with palms facing inward.",
"execution": "With elbows back to sides, raise one dumbbell and rotate forearm until forearm is vertical and palm faces shoulder. Lower to original position and repeat with opposite arm. Continue to alternate between sides.",
"comments": "This exercise may be performed by alternating (as described), simultaneous, or in simultaneousalternating fashion. When elbow is fully flexed, it can travel forward slightly, allowing forearms to be no more than vertical. This additional movement allows for relative release of tension in muscles between repetitions. Also see mechanical analysis of arm curl and question regarding elbow position.",
"stabilizers": "wristflexors, deltoidanterior",
"synergists": "brachialis, brachioradialis",
"target": "bicepsbrachii"}}