{"HipsBWHangingLegRaise":{"id": "0",
"exerciseid": "BWHangingLegRaise",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Hanging Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp and hang from high bar with slightly wider than shoulder width overhand grip.",
"execution": "Raise legs by flexing hips and knees until hips are completely flexed or knees are well above hips. Return until hips and knees are extended downward. Repeat.",
"comments": "Exercise can be performed with ab straps. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible, as in leghip raise. Also see Spot Reduction Myth and Lower Ab Myth. Easier Lie on flat surface or incline to make this exercise less intense. Incline Leg RaiseLying Leg Raise Harder Knees may be kept extended throughout leg raise to increase intensity. Alternatively, exercise can be performed with added weight. Knees can also be raise to shoulders to dynamically involve Rectus Abdominis. Hanging Straight Leg RaiseWeight Hanging Leg RaiseHanging LegHip Raise",
"dynamic stabilizers": "quadriceps",
"stabilizers": "rectusabdominis, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsBWHangingLegRaiseAbStrap":{"id": "1",
"exerciseid": "BWHangingLegRaiseAbStrap",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Hanging Leg Raise (with ab straps)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand below ab straps hanging from high bar. Place upper arms in straps and grasp straps above.",
"execution": "Raise legs by flexing hips and knees until hips are completely flexed or knees are well above hips. Return until hips and knees are extended downward. Repeat.",
"comments": "Exercise can be performed without ab straps, by hanging from high bar. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible, as in leghip raise. Also see Spot Reduction Myth and Lower Ab Myth. Easier Lie on flat surface or incline to make this exercise less intense. Incline Leg RaiseLying Leg Raise Harder Exercise can be performed with added weight. Knees may be kept extended throughout leg raise to increase intensity. Knees can also be raised to shoulders to dynamically involve Rectus Abdominis. Weighted Hanging Leg RaiseWeighted Hanging Straight Leg RaiseHanging LegHip Raise",
"dynamic stabilizers": "quadriceps",
"stabilizers": "rectusabdominis, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsBWHangingStraightLegRaise":{"id": "2",
"exerciseid": "BWHangingStraightLegRaise",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Hanging Straight Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp and hang from high bar with slightly wider than shoulder width overhand grip.",
"execution": "With knees straight, raise legs by flexing hips until hips are completely flexed or knees are well above hips. Return until hips are extended downward. Repeat.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible as in hip leg raise. Also see Spot Reduction Myth and Lower Ab Myth. Easier Knees can flex along with hips to decrease intensity. Alternatively, exercise can be made easier by lying on flat surface or incline board. Hanging Leg RaiseIncline Straight Leg RaiseLying Straight Leg Raise Harder Exercise can be performed with added weight. Knees may also be kept straighter throughout leg raise to increase intensity. Knees can also be raised to shoulders to dynamically involve Rectus Abdominis. Weighted Hanging Straight Leg RaiseHanging Straight LegHip Raise",
"stabilizers": "quadriceps, rectusabdominis, obliques",
"synergists": "sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps",
"target": "iliopsoas"},"HipsBWInclineLegRaise":{"id": "3",
"exerciseid": "BWInclineLegRaise",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Incline Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie supine on incline board with torso elevated. Grasp feet hooks or sides of board for support.",
"execution": "Raise legs by flexing hips and knees until hips are completely flexed. Return until hips and knees are extended. Repeat.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible, as in leghip raise. Also see Spot Reduction Myth and Lower Ab Myth. Easier Lower incline or lie on floor or bench to decrease intensity. Lying Leg Raise Harder Elevate incline or straighten knees more to increase resistance. Once highest incline has been achieved, exercise can be performed vertically. Bent knees can also be raised to shoulders to dynamically involve Rectus Abdominis. Exercise can also be performed with added weight. Incline Straight Leg RaiseVertical Leg RaiseVertical Leg Raise on dip barWeighted Incline Leg RaiseIncline LegHip Raise",
"dynamic stabilizers": "quadriceps",
"stabilizers": "latissimusdorsi, deltoidposterior, teresmajor, tricepsbrachii, rectusabdominis, pectoralissternal, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsBWInclineLegRaiseArmPads":{"id": "4",
"exerciseid": "BWInclineLegRaiseArmPads",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Incline Leg Raise (arms on pads)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie back on incline board. Grasp handles and place forearms on arm pads to each side.",
"execution": "Raise legs by flexing hips and knees until hips are flexed. Return until hips and knees are extended. Repeat.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible see Weighted Incline LegHip Raise. Exercise can also be performed on incline board. Also see Spot Reduction Myth and Lower Ab Myth. Easier Lower incline or lie on floor or bench to decrease intensity. Lying Leg Raise Harder Elevate incline or straighten knees more to increase resistance. Once highest incline has been achieved, exercise can be performed vertically. Exercise can also be performed with added weight. Incline Straight Leg RaiseVertical Leg RaiseVertical Leg Raise on dip barWeighted Incline Leg Raise (arms on pads)",
"dynamic stabilizers": "quadriceps",
"stabilizers": "latissimusdorsi, pectoralissternal, pectoralisminor, trapeziuslower, quadriceps, rectusabdominis, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsBWInclineStraightLegRaise":{"id": "5",
"exerciseid": "BWInclineStraightLegRaise",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Incline Straight Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on incline board. Lie supine on incline board with torso elevated. Grasp feet rollers or sides of board for support.",
"execution": "With knees straight, raise legs by flexing hips until hips are completely flexed. Return until hips and knees are extended. Repeat.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible, as in leghip raise. Attempting to perform Incline Straight LegHip Raise at a low incline would not load waist and hip flexors after they travel beyond vertical so that sort of movement would need to be performed on steep incline or vertical position, requiring much greater strength. Also see Spot Reduction Myth and Lower Ab Myth. Easier Lower incline or lie on floor or bench to decrease intensity. Exercise can also be performed by bending knees and hips. Lying Straight Leg RaiseIncline Leg Raise Harder Elevate incline or straighten knees more to increase resistance. Once highest incline has been achieved, exercise can be performed vertically. Knees can also be raised to shoulders to dynamically involve Rectus Abdominis. Exercise can also be performed with added weight. Vertical Straight Leg RaiseHanging Straight Leg RaiseIncline LegHip RaiseWeighted Incline Straight Leg Raise",
"stabilizers": "latissimusdorsi, tricepsbrachii, pectoralissternal, deltoidposterior, teresmajor, obliques, rectusabdominis, quadriceps",
"synergists": "sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps",
"target": "iliopsoas"},"HipsBWInclineStraightLegRaiseArmPads":{"id": "6",
"exerciseid": "BWInclineStraightLegRaiseArmPads",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Incline Straight Leg Raise (arms on pads)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie back on incline board. Grasp handles and place forearms on arm pads to each side.",
"execution": "With knees straight, raise legs by flexing hips until hips are flexed. Return until hips and knees are extended. Repeat.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible, as in leghip raise. Attempting to perform Incline Straight LegHip Raise at a low incline would not load waist and hip flexors after they travel beyond vertical so that sort of movement would need to be performed on steep incline or vertical position, requiring much greater strength. Also see Spot Reduction Myth and Lower Ab Myth. Easier Lower incline or lying on floor or bench to decrease intensity. Exercise can also be performed by bending knees and hips. Lying Straight Leg RaiseIncline Leg Raise Harder Elevate incline or straighten knees more to increase resistance. Once highest incline has been achieved, exercise can be performed vertically. Knees can also be raised to shoulders to dynamically involve Rectus Abdominis. Exercise can also be performed with added weight. Vertical Straight Leg RaiseHanging Straight Leg RaiseIncline LegHip RaiseWeighted Incline Straight Leg Raise",
"stabilizers": "latissimusdorsi, pectoralissternal, rectusabdominis, trapeziuslower, quadriceps, pectoralisminor, obliques",
"synergists": "sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps",
"target": "iliopsoas"},"HipsBWLyingLegRaise":{"id": "7",
"exerciseid": "BWLyingLegRaise",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Lying Leg Raise (on bench)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie supine on bench. Place hands under lower buttock on each side to support pelvis.",
"execution": "Raise legs by flexing hips and knees until thighs are completely flexed. Return until hips and knees are extended. Repeat.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible, as in leghip raise. Also see Spot Reduction Myth and Lower Ab Myth. Easier To decrease intensity, perform exercise on floor and allow heels to make contact with floor each repetition. on floor Harder Perform on incline board or perform with knees straight to increase resistance. Knees can also be raised to shoulders to dynamically involve Rectus Abdominis. Exercise can also be performed with added weight. Incline Leg RaiseStraight Leg RaiseLying LegHip RaiseWeighted Lying Leg Raise",
"dynamic stabilizers": "quadriceps",
"stabilizers": "quadriceps, rectusabdominis, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsBWSimAltLyingLegRaise":{"id": "8",
"exerciseid": "BWSimAltLyingLegRaise",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Lying Simultaneous Alternating Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie supine on bench or mat. Place hands under lower buttock on each side to support pelvis. Raise bent leg up so lower leg is approximately horizonal above hip. If lying on floor, raise other leg slightly off of floor.",
"execution": "Simultaneously change positions of legs, lowering and straightening raised leg down just above floor while raising and bending lower leg to opposite position. Continue alternating leg positions.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. Conversely, it may be necessary to completely flex hips before waist flexion is possible, which is not practical with alternating leg movements. Also see Spot Reduction Myth and Lower Ab Myth. Easier To decrease intensity, perform exercise on floor and allow alternating heels to make contact with floor each repetition. Harder Perform on incline board or perform with knees straight to increase resistance. Exercise can also be performed with added weight using ankle straps. Straight Leg",
"dynamic stabilizers": "quadriceps",
"stabilizers": "quadriceps, rectusabdominis, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsBWLyingLegRaiseFloor":{"id": "9",
"exerciseid": "BWLyingLegRaiseFloor",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Lying Leg Raise (on floor)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie supine on mat or floor. Place hands under lower buttock on each side to support pelvis.",
"execution": "Raise legs by flexing hips and knees until thighs are completely flexed. Return until hips and knees are extended. Repeat.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible, as in leghip raise. Also see Spot Reduction Myth and Lower Ab Myth. Easier To decrease intensity, allow heels to make contact with floor each repetition. Harder Perform on bench or do not let heels to make contact with floor. For greater resistance, perform on incline board or with knees straight. Knees can also be raised to shoulders to dynamically involve Rectus Abdominis. Exercise can also be performed with added weight. Lying Leg Raise on benchIncline Leg RaiseStraight Leg RaiseLying LegHip RaiseWeighted Lying Leg Raise",
"dynamic stabilizers": "quadriceps",
"stabilizers": "quadriceps, rectusabdominis, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsBWStraightLegRaise":{"id": "10",
"exerciseid": "BWStraightLegRaise",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Lying Straight Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie supine on bench or mat. Place hands under lower buttock on each side to support pelvis.",
"execution": "Keeping knees straight, raise legs by flexing hips until hips are completely flexed. Return until hips and knees are extended. Repeat.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible, as in leghip raise. Attempting to perform Lying Straight Leg Hip Raise would not load waist and hip flexors after they travel beyond vertical so that sort of movement would need to be performed on steep incline or vertical position, requiring much greater strength. Also see Spot Reduction Myth and Lower Ab Myth. Easier To decrease intensity, flex knees along with hips. Alternatively, perform exercise on floor and allow heels to make contact with floor each repetition. Lying Leg Raise Harder Unless ankle weights are used, weighted version of this movement is not recommended due to potentially vulnerable position if dummbell accidentally slips from feet. To increase resistance, perform on incline board. Knees can also be raised to shoulders to dynamically involve Rectus Abdominis. Incline Straight Leg RaiseIncline LegHip Raise",
"stabilizers": "quadriceps, rectusabdominis, obliques",
"synergists": "sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps",
"target": "iliopsoas"},"HipsBWSimAltStraightLegRaise":{"id": "11",
"exerciseid": "BWSimAltStraightLegRaise",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Lying Simultaneous Alternating Straight Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie supine on bench or mat. Place hands under lower buttock on each side to support pelvis. Raise one leg up vertically with knee nearly straight. If lying on floor, raise other leg slightly off of floor.",
"execution": "Keeping knees nearly straight, simultaneously change positions of legs so vertical leg is lowered while lower leg is raised vertically. Continue alternating leg positions.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible. Conversely, it may be necessary to completely flex hips before waist flexion is possible, which is not practical with alternating leg movements. Also see Spot Reduction Myth and Lower Ab Myth. Easier To decrease intensity, flex knees along with hips. Alternatively, perform exercise on floor and allow alternating heels to make contact with floor each repetition. Lying Simultaneous Alternating Leg Raise (knees bend) Harder To increase resistance use ankle weights or perform on incline board. Raising legs up only short height challenges greater isometriclike endurance. Scissor Kick",
"stabilizers": "quadriceps, rectusabdominis, obliques",
"synergists": "sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps",
"target": "iliopsoas"},"HipsBWSeatedLegRaise":{"id": "12",
"exerciseid": "BWSeatedLegRaise",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Seated Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on edge of bench with legs extended to floor. Place weight between ankles or use no weight. Grasp edge of bench. Lean torso back and balance body weight on edge of bench.",
"execution": "Raise legs by flexing hips and knees while pulling torso slightly forward to maintain balance. Return by extending hips and knees and lean torso back to counter balance. Repeat.",
"comments": "Heels may make contact with floor to maintain balance at bottom of movement. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible. Typically, the spine is not extended enough in this movement to constitute significant spinal flexion, so it remains classified as a hip flexor movement. Also known as Seated Leg Tuck or Leg Tuck (across bench). Also see Spot Reduction Myth and Lower Ab Myth.",
"dynamic stabilizers": "quadriceps",
"stabilizers": "rectusabdominis, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsBWVerticalLegRaise":{"id": "13",
"exerciseid": "BWVerticalLegRaise",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Vertical Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Position forearms on padded parallel bars with hands on handles, and back on vertical pad.",
"execution": "Raise legs by flexing hips and knees until hips are completely flexed or knees are well above hips. Return until hips and knees are extended. Repeat.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible, as in leghip raise. Also see Spot Reduction Myth and Lower Ab Myth. Easier Lie on flat surface or incline to make this exercise less intense. Incline Leg RaiseLying Leg Raise Harder Exercise can be performed with added weight or knees may be kept extended throughout leg raise to increase intensity. Knees can also be raised to shoulders to dynamically involve Rectus Abdominis. Weighted Vertical Leg RaiseVertical Straight Leg RaiseWeighted Vertical LegHip Raise",
"dynamic stabilizers": "quadriceps",
"stabilizers": "latissimusdorsi, pectoralissternal, pectoralisminor, trapeziuslower, rectusabdominis, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsBWVerticalLegRaisePB":{"id": "14",
"exerciseid": "BWVerticalLegRaisePB",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Vertical Leg Raise (on parallel bars)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand between parallel bars and grip bar on each side with overhand grip. Lift body off floor and balance body upright with arms straight.",
"execution": "Raise legs by flexing hips and knees until hips are completely flexed. Return until hips and knees are extended. Repeat.",
"comments": "This exercise is alternative to Vertical Leg Raise when apparatus is not available, or Hanging Leg Raise when high bar is not available or too low to allow for adequate leg clearance. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible see Weighted Vertical LegHip Raise on parallel bars. Also see Spot Reduction Myth and Lower Ab Myth. Easier Lie on flat surface or incline to make this exercise less intense. Incline Leg Raise Harder Exercise can be performed with added weight. Knees may be kept extended throughout leg raise to increase intensity. Knees can also be raised to shoulders to dynamically involve Rectus Abdominis. Weighted Vertical Leg Raise (on parallel bars)Vertical LegHip Raise (parallel bars)",
"dynamic stabilizers": "quadriceps",
"stabilizers": "latissimusdorsi, tricepsbrachii, rectusabdominis, pectoralissternal, deltoidposterior, deltoidanterior, trapeziuslower, pectoralisminor, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsBWVerticalStraightLegRaise":{"id": "15",
"exerciseid": "BWVerticalStraightLegRaise",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Vertical Straight Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Position forearms on padded parallel bars with hands on handles, and back on vertical pad.",
"execution": "With knees straight, raise legs by flexing hips until thighs are just pass parallel to floor. Return until hips are extended. Repeat.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible, as in leghip raise. Also see Spot Reduction Myth and Lower Ab Myth. Easier Lie back on incline board or bend knees along with hip to make this exercise less intense. Incline Straight Leg RaiseVertical Leg Raise Harder Exercise can be performed with added weight. Knees may be kept straighter throughout movement to increase intensity. Knees can also be raised to shoulders to dynamically involve Rectus Abdominis. Weighted Vertical Straight Leg RaiseVertical LegHip Raise",
"stabilizers": "latissimusdorsi, pectoralissternal, pectoralisminor, trapeziuslower, quadriceps, rectusabdominis, obliques",
"synergists": "sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps",
"target": "iliopsoas"},"HipsBWJackKnifeBall":{"id": "16",
"exerciseid": "BWJackKnifeBall",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Jack-knife on Ball",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Kneel with chest or waist on exercise ball. Dive over top and place hands on floor with arms extended down supporting upper body. While keeping body horizontal, walk hands further away from ball until shins are positioned on top of ball. With arms vertical and straight, support body off of floor with body straight. See suggested mount onto exercise ball.",
"execution": "Bend hips and knees, allowing shins to roll over top of ball. Pull knees toward chest until heels are under or near glutes. Return by extending hips and knees to original position. Repeat.",
"comments": "Keep arms straight with shoulders positioned above hands. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique act only to stabilize pelvis and waist during hip flexion. If waist flexion were to occur after complete hip flexion, resistive forces are no longer working against abdominal muscles in this final position when knees and hips are flexed. However, abdominal muscles are activated isometrically to keep spine straight when knees are not under body. Also see Spot Reduction Myth and Lower Ab Myth. Easier For less intensity try Lying Leg Raise. Harder For greater intensity, try these exercise Vertical Leg RaiseVertical Leg Raise on Parallel BarsHanging Leg Raise",
"antagonist stabilizers": "trapeziuslower, trapeziusmiddle, rhomboids, erectorspinae",
"dynamic stabilizers": "hamstrings, quadriceps",
"stabilizers": "pectoralisclavicular, tricepsbrachii, serratusanterior, pectoralissternal, deltoidanterior, quadriceps, rectusabdominis, obliques",
"synergists": "sartorius, gluteusmaximus, adductors, pectineus, tensorfasciaelatae",
"target": "iliopsoas"},"HipsBWRomanChairSitup":{"id": "17",
"exerciseid": "BWRomanChairSitup",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Roman Chair Sit-up",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on chair or bench with lower leg secured under low over hang or heavy bar. Place hands on waist, chest, neck, or head depending upon desired difficulty.",
"execution": "Lower body back until hips are almost extended. Raise body by flexing hips until torso is upright. Repeat.",
"comments": "Feet must be propped securely to prevent injury. Exercise can also be performed on Roman Chair Situp apparatus. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. See Spot Reduction Myth and Lower Ab Myth. Also see Dangerous Exercise Essay. Easier Movement can be made easier by placing arms further down away from head. Harder Exercise can be made more challenging by placing hands further up toward head. See Arm Position During Waist Exercises. Exercise can also be performed with additional weight. Weighted",
"stabilizers": "rectusabdominis, obliques",
"synergists": "sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps",
"target": "iliopsoas"},"HipsBWScissorKick":{"id": "18",
"exerciseid": "BWScissorKick",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Lying Scissor Kick",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie supine on bench or mat. Place hands under lower buttock on each side to support pelvis. Raise one leg up vertical with knee nearly straight. If lying on floor, raise other leg slightly off of floor.",
"execution": "Keeping knees nearly straight, simultaneously change positions of legs so vertical leg is lowered while lower leg is raised vertically. Continue alternating leg positions.",
"comments": "Also known as Scissors Kick. Movement involves very short range of motion so greater isometriclike endurance is required. Also see overunder variation. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible. Conversely, it may be necessary to completely flex hips before waist flexion is possible, which is not practical with this movement since it involves alternating legs and partial range of movement. Also see Spot Reduction Myth and Lower Ab Myth. Easier To make movement slightly easier, perform exercise on floor and allow alternating heels to make contact with floor each repetition. Unlike other lying hip flexor exercises executed through full range, performing Scissor Kick on a steep incline actually makes the movement easier. Lying Simultaneous Alternating Straight Leg Raise Harder To increase resistance, use ankle weights.",
"stabilizers": "quadriceps, rectusabdominis, obliques",
"synergists": "sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps",
"target": "iliopsoas"},"HipsBWJackKnifeWheel":{"id": "19",
"exerciseid": "BWJackKnifeWheel",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Jack-knife on Power Wheel",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "With feet strapped to power wheel, kneel on floor. Place hands shoulder width apart on floor. With arms vertical and straight, support body off of floor while rolling power wheel back until body is straight.",
"execution": "Bend hips and knees, pulling legs under body. Pull bent knees toward chest, allowing rear end to raise upward. Return by extending hips and knees to original position. Repeat.",
"comments": "Keep arms straight with shoulders positioned above hands. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique act only to stabilize pelvis and waist during hip flexion. In this movement, even if waist flexion were to occur after complete hip flexion, the abs have endured much more stabilizing forces in their extended position than dynamic forces they could possibly encounter in the flexed position. Also see Spot Reduction Myth and Lower Ab Myth. Easier For less intensity try performing on slightly declined slope. Harder For greater intensity, keep knees straight. Pike on power wheel",
"dynamic stabilizers": "hamstrings, quadriceps",
"stabilizers": "pectoralisclavicular, tricepsbrachii, serratusanterior, pectoralissternal, deltoidanterior, quadriceps, rectusabdominis, obliques",
"synergists": "sartorius, gluteusmaximus, adductors, pectineus, tensorfasciaelatae",
"target": "iliopsoas"},"HipsBWKneelingWheelRollout":{"id": "20",
"exerciseid": "BWKneelingWheelRollout",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Wheel Rollout",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Kneel on floor or mat. Grasp handles on wheel to each side with overhand grip. Position wheel near front of knees and lean over wheel with arms extended downward, supporting upper body.",
"execution": "With arms straight, roll wheel out as far as possible. Lower body gently to floor extending arms forward. Raise body back up by flexing hips and pulling arms back to original position. Return until hips are extended. Repeat.",
"comments": "Keep elbows straight or nearly straight throughout exercise. Also known as Wheel Kneeling Rollout. Rectus Abdominis and Obliques practically contract isometrically since little waist flexion occurs under resistance. With no waist flexion, Rectus Abdominis and External Oblique act to stabilize pelvis and waist during hip flexion. See target muscle of rollout question. Also see Spot Reduction Myth and Lower Ab Myth. Easier Descending only part way down is much easier and can be performed in this way to progress into exercise. Movement can also be made easier by performing exercise up an incline (i.e. end of incline ab board or decline bench) or assisted by cable. Cable Assisted Wheel Rollout Harder Make sure to roll out until shoulder is fully extended through full range of motion. Exercise can be made much more challenging by performing exercise on feet with knees straight, up an incline, progressing to floor.",
"antagonist stabilizers": "erectorspinae",
"dynamic stabilizers": "quadriceps",
"stabilizers": "pectoralisclavicular, tricepsbrachii, wristflexors, rectusabdominis, obliques",
"synergists": "latissimusdorsi, tensorfasciaelatae, pectoralissternal, sartorius, deltoidposterior, teresmajor, adductors, pectineus, pectoralisminor, rhomboids",
"target": "iliopsoas"},"HipsBWPikeWheel":{"id": "21",
"exerciseid": "BWPikeWheel",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Pike on Power Wheel",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "With feet strapped to power wheel, kneel on floor. Place hands shoulder width apart on floor. With arms vertical and straight, support body off of floor while rolling power wheel back until body is straight.",
"execution": "From plank position, raise rear end up as high as possible by bending hips. Pull power wheel toward hands while keeping knees straight. Return by extending hips to original position. Repeat.",
"comments": "Keep arms straight with shoulders positioned above hands. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique act only to stabilize pelvis and waist during hip flexion. If waist flexion were to occur after complete hip flexion, resistive forces are no longer working against abdominal muscles in this final position when knees and hips are flexed. However, abdominal muscles are activated isometrically to keep spine straight when knees are not under body. Also see Spot Reduction Myth and Lower Ab Myth. Easier Allow knees to bend in a jackknife movement to decrease intensity. Jackknife on power wheel Harder For greater intensity try performing on slightly inclined slope.",
"stabilizers": "pectoralisclavicular, tricepsbrachii, rectusabdominis, serratusanterior, pectoralissternal, deltoidanterior, quadriceps, pectoralisminor, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsBWPikeDiscs":{"id": "22",
"exerciseid": "BWPikeDiscs",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Pike on Discs",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Kneel on floor with forefeet on gliding discs. Place hands shoulder width apart on floor. With arms vertical and straight, support body off of floor while sliding gliding discs back until body is straight.",
"execution": "From plank position, raise rear end up as high as possible by bending hips. Pull gliding discs toward hands while keeping knees straight. Return by extending hips to original position. Repeat.",
"comments": "Keep arms straight with shoulders positioned above hands. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique act only to stabilize pelvis and waist during hip flexion. If waist flexion were to occur after complete hip flexion, resistive forces are no longer working against abdominal muscles in this final position when knees and hips are flexed. However, abdominal muscles are activated isometrically to keep spine straight when knees are not under body. Also see Spot Reduction Myth and Lower Ab Myth. Easier Allow knees to bend in a jackknife movement to decrease intensity. Harder For greater intensity try performing on slightly inclined slope.",
"stabilizers": "pectoralisclavicular, tricepsbrachii, rectusabdominis, serratusanterior, pectoralissternal, deltoidanterior, quadriceps, pectoralisminor, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"}}