{"HipsBWSideBridgeHipAbduction":{"id": "0",
"exerciseid": "BWSideBridgeHipAbduction",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipAbductor",
"name": "Side Bridge Hip Abduction",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Lie on side with legs straight, one leg on top of the other. Place forearm under shoulder perpendicular to body.",
"execution": "Keeping side of bottom foot on ground, raise hips up off ground while raising upper leg upward away from lower leg. Return to original position and repeat. Continue with opposite leg.",
"comments": "Keep feet pointed forward. Exercise can be performed on mat or towel or cushioning can be placed under forearm. See ROM Criteria and Spot Reduction Myth. Easier Exercise can be performed with bent knees. Movement can also be made easier by leaning body up against wall, horizontal bar or platform. Angled  LeaningBent Knee Harder Exercise can be made more challenging with ankle weight attached to upper ankle.",
"stabilizers": "latissimusdorsi, levatorscapulae, pectoralisminor",
"synergists": "iliopsoas, erectorspinae, quadratuslumborum, obliques",
"target": "gluteusmedius, tensorfasciaelatae, gluteusminimus"},"HipsBWAngledSideBridgeHipAbduction":{"id": "1",
"exerciseid": "BWAngledSideBridgeHipAbduction",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipAbductor",
"name": "Angled Side Bridge Hip Abduction",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Grasp vertical bar with one hand and turn to side. Position feet out away from vertical bar with arm supporting body extended out to side. Legs should be straight and positioned side by side. Supporting arm should be approximately vertical to body and other arm can be placed on hips. Lower hips downward to floor until slight stretch is felt.",
"execution": "Keeping foot closest to bar on ground, raise hips upward and away from bar while raising leg furthest from bar upward away from lower leg. Return to original position with hips sagging downward and repeat. Continue with opposite leg.",
"comments": "Keep feet pointed forward. See ROM Criteria and Spot Reduction Myth. Easier Movement can be made easier by performing movement on higher bar. Harder Exercise can be made more challenging by performing movement on lower bar. Exercise is hardest when performed off of floor. Side Bridge Hip Abduction",
"stabilizers": "latissimusdorsi, pectoralisminor, tricepsbrachii",
"synergists": "iliopsoas, deltoidlateral, erectorspinae, levatorscapulae, quadratuslumborum, obliques",
"target": "gluteusmedius, tensorfasciaelatae, gluteusminimus"},"HipsBWBentKneeSideBridgeHipAbduction":{"id": "2",
"exerciseid": "BWBentKneeSideBridgeHipAbduction",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipAbductor",
"name": "Bent Knee Side Bridge Hip Abduction",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Lie on side with legs bent back 90 degrees, one leg on top of the other. Place forearm under shoulder perpendicular to body.",
"execution": "Keeping shank of lower leg on mat or floor, raise hips up off ground while raising upper leg upward away from lower leg. Return to original position and repeat. Continue with opposite leg.",
"comments": "Keep knees bent throughout exercise. Exercise can be performed on mat or towel or cushioning can be placed under forearm. See ROM Criteria and Spot Reduction Myth. Easier Exercise can be performed by rising only leg upward, keeping hips down. Harder Exercise can be made more challenging with legs straight Straight Leg",
"stabilizers": "latissimusdorsi, levatorscapulae, pectoralisminor",
"synergists": "iliopsoas, erectorspinae, quadratuslumborum, obliques",
"target": "gluteusmedius, tensorfasciaelatae, gluteusminimus"}}