{
  "CalvesLVBentKneeSeatedCalfExtension": {
    "id": "0",
    "exerciseid": "LVBentKneeSeatedCalfExtension",
    "musclegroup": "Calves",
    "equipment": "lever(selectorized)",
    "exercisetype": "WeightExercises",
    "muscleclass": "Soleus",
    "name": "Lever Bent Knee Calf Extension",
    "utility": "Auxiliary",
    "mechanics": "Isolated",
    "force": "Push",
    "preparation": "With seat close to lever platform or foot pedals, sit on seat. Position forefeet on lever platform or foot pedals. Grasp handles to sides. Push feet into lever platform or foot pedals to prevent knees from coming back during lift.",
    "execution": "Push lever by extending ankles as far as possible. Return by bending ankles until calves are stretched. Repeat.",
    "comments": "Movement is predominately Soleus. Gastrocnemius are in active insufficiency since knees are significantly bent. See Calf Exercise Analyses.",
    "stabilizers": "gluteusmaximus, quadriceps",
    "synergists": "gastrocnemius",
    "target": "soleus"
  },
  "CalvesLVAltBentKneeSeatedCalfExt": {
    "id": "1",
    "exerciseid": "LVAltBentKneeSeatedCalfExt",
    "musclegroup": "Calves",
    "equipment": "lever(selectorized)",
    "exercisetype": "WeightExercises",
    "muscleclass": "Soleus",
    "name": "Lever Alternating Bent-knee Seated Calf Extension",
    "utility": "Auxiliary",
    "mechanics": "Isolated",
    "force": "Push",
    "preparation": "Sit on seat and position forefeet on pedals. Grasp handles to sides and extend knees but maintain small bend in knees.",
    "execution": "Push left pedal by extending ankle knee Simultaneously allow right pedal to return back by relaxing ankle and bending knee more. Reverse motion by pushing right pedal and allowing left pedal to return back by same means. Continue to alternate motion.",
    "comments": "Position seat to allow full range of motion. Gastrocnemius act as dynamic stabilizers because when they contract at ankle they are simultaneously stretched at knee. It could be argued they also act as synergist since bend at knee could be considered relatively smaller range of motion as compared to ankle articulation resulting in net contraction of Gastrocnemius. See Calf Exercise Analyses. Also see Lever Alternating Seated Calf Extension with straight knee.",
    "dynamic stabilizers": "hamstrings, gastrocnemius",
    "synergists": "gluteusmaximus, quadriceps",
    "target": "soleus"
  },
  "CalvesLVSeatedCalfRaise": {
    "id": "2",
    "exerciseid": "LVSeatedCalfRaise",
    "musclegroup": "Calves",
    "equipment": "lever(selectorized)",
    "exercisetype": "WeightExercises",
    "muscleclass": "Soleus",
    "name": "Lever Seated Calf Raise",
    "utility": "Auxiliary",
    "mechanics": "Isolated",
    "force": "Push",
    "preparation": "Sit on seat facing lever. Reach forward and pull hand lever toward body. Place forefeet on platform with heels extending off. Position lower thighs under lever pads. Release hand lever by pushing away from body. Place hands on top of thigh pads.",
    "execution": "Raise heels by extending ankles as high as possible. Lower heels by bending ankles until calves are stretched. Repeat.",
    "comments": "Movement is predominately Soleus. Gastrocnemius are in active insufficiency since knees are significantly bent. See mount and dismount and Calf Exercise Analyses.",
    "stabilizers": "No significant stabilizers",
    "synergists": "gastrocnemius",
    "target": "soleus"
  },
  "CalvesLVSeatedCalfExtension": {
    "id": "3",
    "exerciseid": "LVSeatedCalfExtension",
    "musclegroup": "Calves",
    "equipment": "lever(selectorized)",
    "exercisetype": "WeightExercises",
    "muscleclass": "Soleus",
    "name": "Lever Seated Calf Extension",
    "utility": "Auxiliary",
    "mechanics": "Isolated",
    "force": "Push",
    "preparation": "With leg pads in upper position, sit on seat and place feet on lever platform with legs under pads. Lower leg pads on legs so they are snuggly adjusted just behind knees.Place hands on top of thigh pads.",
    "execution": "Push lever platform down by extending ankles as far as possible. Return by bending ankles until calves are stretched. Repeat.",
    "comments": "This machine design is very rare in comparison to Lever Seated Calf Raise machine. This particular machinewas missing its adjustable leg pad so fists were placed between legs and cross bar.Movement is predominately Soleus. Gastrocnemius are in active insufficiency since knees are significantly bent. SeeCalf Exercise Analyses.",
    "stabilizers": "No significant stabilizers",
    "synergists": "gastrocnemius",
    "target": "soleus"
  }
}
