{"WaistCBCrossArmTwist":{"id": "0",
"exerciseid": "CBCrossArmTwist",
"musclegroup": "Waist",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Cable Seated Cross Arm Twist",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp stirrup from medium height cable pulley with far hand. Sit on stool or straddle bench with lower body facing away from pulley. Allow torso to turn to side of near arm. Place far arm across body onto near arm. Support far elbow with near hand.",
"execution": "Rotate torso through waist to face opposite side until slight stretch if felt. Return to original side until slight stretch is felt. Repeat. Continue with opposite side.",
"comments": "Place feet wide for support, or if straddling bench, slightly squeeze legs on sides of bench to prevent shifting. Upper body stabilizing occurs primarily on far side through isometric shoulder abduction and isometric scapular upward rotation. Upper body stabilization also occurs somewhat on near side through shoulder protraction. See Spot Reduction Myth.",
"stabilizers": "serratusanterior, pectoralissternal, deltoidposterior, trapeziusmiddle, adductors, trapeziuslower, pectoralisminor, rhomboids",
"synergists": "iliopsoas, quadratuslumborum, erectorspinae",
"target": "obliques"},"WaistCBStandingTwistingCrunchSingle":{"id": "1",
"exerciseid": "CBStandingTwistingCrunchSingle",
"musclegroup": "Waist",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Cable Standing Twisting Crunch (single side)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Position back against back pad with knees slightly bent, shoulders back, and chest high. Place cable straps over shoulder. Hold against front of body with opposite hand so that cable is taut. If available, place hand in rope slot that allows cable to be taut when hand is in position with shoulders back.",
"execution": "Flex and twist spine so shoulder pulls strap diagonally forward and downward away from pulley. Return until back of shoulder returns to back pad and repeat.",
"comments": "To allow for full range of motion, grip height on strap should not allow weight to bottom out (weights touching stack) when shoulders are back. Padded hump should be adjusted to height of low back. See Spot Reduction Myth.",
"stabilizers": "No significant stabilizers",
"synergists": "iliopsoas, rectusabdominis",
"target": "obliques"},"WaistCBDownUpTwist":{"id": "2",
"exerciseid": "CBDownUpTwist",
"musclegroup": "Waist",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Cable Twist (down up)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp stirrup from low cable pulley. Turn to one side, away from pulley. Position feet wide apart with furthest foot away from pulley and nearest foot close to pulley. Point both feet away from pulley. Raise heel of nearest foot off floor. Bend knees of both legs slightly. Place far hand over other hand or interlace fingers.",
"execution": "Keeping arms straight, pull stirrup diagonally upward around shoulders by rotating torso and raising arms gradually upward until cable makes contact with side of body. Bend knees slightly more as stirrup approaches top. Return to original position and repeat. Continue with opposite side.",
"comments": "Both arms should be straight following diagonal path upward. Both arms should be horizontal and straight. This movement arguably involves more hip internal rotation and transverse adduction than spinal rotation. Although it is considered oblique movement, remarkably little rotation actually occurs through spine, although rotators of spine act largely as stabilizers except at very beginning and end of motion where resistance from cable is minimal. A large part of rotational force actually occurs through rotationtransverse adduction of forward hip. Because rear leg is only supported by forefoot, hip of forward leg is utilized much greater than hip of rear leg since forward leg offers more secured base of support. Continued rotation would occur through spine except cable when makes contact with body, precluding further movement and resistance would no longer be provided through cable since line of force is no longer perpendicular to line of pull. Seated oblique exercises or those exercises where hips are stabilized allow for greater range of movement through spine. See Spot Reduction Myth.",
"stabilizers": "trapeziusupper, levatorscapulae, deltoidanterior, soleus, trapeziusmiddle, gluteusmaximus, deltoidlateral, trapeziuslower, rectusabdominis, pectoralisclavicular, tricepsbrachii, deltoidposterior, supraspinatus, erectorspinae, gastrocnemius, rhomboids, quadriceps",
"synergists": "iliopsoas, gluteusminimus, tensorfasciaelatae, erectorspinae, quadratuslumborum, gluteusmedius, adductors",
"target": "obliques"},"WaistCBSideBend":{"id": "3",
"exerciseid": "CBSideBend",
"musclegroup": "Waist",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Cable Side Bend",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "With side to low pulley, grasp stirrup attachment with near arm. Stand with arm straight.",
"execution": "Pull stirrup by bending sideways through waist so torso moves away from pulley. Lower stirrup by leaning torso toward pulley. Repeat. Continue with opposite side.",
"comments": "See Spot Reduction Myth.",
"stabilizers": "trapeziusupper, trapeziusmiddle, gluteusminimus, levatorscapulae, gluteusmedius",
"synergists": "iliopsoas, quadratuslumborum, erectorspinae",
"target": "obliques"},"WaistCBTwist":{"id": "4",
"exerciseid": "CBTwist",
"musclegroup": "Waist",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Cable Twist",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp stirrup from shoulder height cable pulley with both hands. Step and turn lower body away from pulley until near arm is horizontal and straight. Position feet wide apart facing away from pulley, furthest foot further away from pulley. Raise heel of nearest foot off floor. Bend knees of both legs slightly. Place far hand over other hand or interlace fingers.",
"execution": "Keeping arms straight, rotate torso to opposite side until cable makes contact with shoulder. Return to original position and repeat. Continue with opposite side.",
"comments": "Both arms should be horizontal and straight. This movement arguably involves more hip internal rotation and transverse adduction than spinal rotation. Although it is considered oblique movement, remarkably little rotation actually occurs through spine, although rotators of spine act largely as stabilizers except at very beginning and end of motion where resistance from cable is minimal. A large part of rotational force actually occurs through rotationtransverse adduction of forward hip. Because rear leg is only supported by forefoot, hip of forward leg is utilized much greater than hip of rear leg since forward leg offers more secured base of support. Continued rotation would occur through spine except when cable makes contact with body precluding further movement and resistance would no longer be provided through cable since line of force is no longer perpendicular line of pull. Seated oblique exercises or those exercises where hips are stabilized allow for greater range of movement through spine. See Spot Reduction Myth.",
"stabilizers": "pectoralisclavicular, tricepsbrachii, rectusabdominis, pectoralissternal, deltoidposterior, trapeziusmiddle, deltoidlateral, erectorspinae, trapeziuslower, pectoralisminor, rhomboids",
"synergists": "iliopsoas, gluteusminimus, tensorfasciaelatae, erectorspinae, quadratuslumborum, gluteusmedius, adductors",
"target": "obliques"},"WaistCBSideCrunch":{"id": "5",
"exerciseid": "CBSideCrunch",
"musclegroup": "Waist",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Cable Side Crunch",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "With side close to high pulley, grasp stirrup attachment with near hand. Position stirrup at side of shoulder, palm orientated inward, and elbow down to side.",
"execution": "Pull stirrup downward by bending toward cable column through waist so torso moves toward base of cable column. Bend in opposite direction by leaning torso away from cable column, allowing stirrup to rise upward. Repeat. Continue with opposite side.",
"comments": "Keep stirrup attachment near side of shoulder with elbow down to side. See Spot Reduction Myth.",
"stabilizers": "latissimusdorsi, tricepsbrachii, levatorscapulae, brachioradialis, pectoralissternal, bicepsbrachii, brachialis, teresmajor, trapeziuslower, pectoralisminor, rhomboids",
"synergists": "iliopsoas, quadratuslumborum, erectorspinae",
"target": "obliques"},"WaistCBSeatedTwist":{"id": "6",
"exerciseid": "CBSeatedTwist",
"musclegroup": "Waist",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Cable Seated Twist",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp stirrup and straddle bench orientated with side facing medium height cable pulley. Sit with feet on floor. Hold onto stirrup with both hands with arms extending out straight toward stirrup.",
"execution": "Keeping arms straight, rotate torso to opposite side until cable makes contact with shoulder. Return to original position and repeat. Continue with opposite side.",
"comments": "Slightly squeeze legs on sides of bench to prevent shifting. Bench should be far enough away from cable pulley so cable is taut when stirrup is turned back toward cable pulley. See side view and Spot Reduction Myth.",
"stabilizers": "pectoralisclavicular, tricepsbrachii, rectusabdominis, pectoralissternal, deltoidanterior, deltoidposterior, trapeziusmiddle, deltoidlateral, erectorspinae, trapeziuslower, adductors, pectoralisminor, rhomboids",
"synergists": "iliopsoas, quadratuslumborum, erectorspinae",
"target": "obliques"},"WaistCBUpDownTwist":{"id": "7",
"exerciseid": "CBUpDownTwist",
"musclegroup": "Waist",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Cable Twist (up down)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp stirrup from shoulder height cable pulley. Turn to one side, away from pulley until near arm is extended straight. Position feet wide apart with furthest foot away from pulley and nearest foot close to pulley. Point both feet away from pulley. Raise heel of nearest foot off floor. Place far hand over other hand or interlace fingers.",
"execution": "Keeping arms straight, pull stirrup diagonally downward around shoulders by rotating torso and gradually lowering arms downward until cable is just above shoulder. Gradually bend knees as stirrup makes its way around body and approaches bottom. Return to original position and repeat. Continue with opposite side.",
"comments": "Both arms should be straight following diagonal path downward. This movement arguably involves more hip internal rotation and transverse adduction than spinal rotation. Although it is considered oblique movement, remarkably little rotation actually occurs through spine, although rotators of spine act largely as stabilizers except at very beginning and end of motion where resistance from cable is minimal. A large part of rotational force actually occurs through rotationtransverse adduction of forward hip. Because rear leg is only supported by forefoot, hip of forward leg is utilized much greater than hip of rear leg since forward leg offers more secured base of support. Continued rotation would occur through spine except when cable would make contact with body precluding further movement and resistance would no longer be provided through cable since line of force is no longer perpendicular line of pull. Seated oblique exercises or those exercises where hips are stabilized allow for greater range of movement through spine. See Spot Reduction Myth.",
"stabilizers": "latissimusdorsi, tricepsbrachii, rectusabdominis, pectoralissternal, deltoidposterior, trapeziusmiddle, teresmajor, erectorspinae, trapeziuslower, pectoralisminor, rhomboids",
"synergists": "iliopsoas, gluteusminimus, tensorfasciaelatae, erectorspinae, quadratuslumborum, gluteusmedius, adductors",
"target": "obliques"},"WaistCBRussianTwistBall":{"id": "8",
"exerciseid": "CBRussianTwistBall",
"musclegroup": "Waist",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Cable Russian Twist (on stability ball)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp stirrup and sit on stability ball with side facing low cable pulley. Roll body down and lie with back on ball, hips nearly straight, and feet apart on floor. Hold onto stirrup with both hands with arms extending straight upward.",
"execution": "Allow resistance from cable to turn torso downward, toward direction of pulley while keeping arms straight and perpendicular to torso throughout movement. Pull stirrup in an arch over shoulders by rotating torso to opposite direction of pulley until cable makes contact with shoulder. Return to original position in opposite direction and repeat. Continue with opposite side.",
"comments": "Both arms should be kept straight and perpendicular to torso. Hips should also be kept nearly straight, only slightly bent. Also see other view. This movement involves both spinal rotation and hip external rotation. Because leg furthest from pulley acts to counter weight of cables resistance, greatest downward force onto floor is place on foot closest to pulley. Since foot of near leg provides more secured base of support, external rotation of near hip provides significantly more torque as compared to relatively passive internal rotation of far hip. Continued rotation would occur through spine except when cable makes contact with body precluding further movement and resistance would no longer be provided through cable since line of force is no longer perpendicular line of pull. Seated oblique exercises or those exercises where hips are stabilized, allow for greater range of movement through spine. See Spot Reduction Myth.",
"stabilizers": "pectoralisclavicular, tricepsbrachii, pectoralissternal, deltoidposterior, trapeziusmiddle, gluteusmaximus, deltoidlateral, erectorspinae, trapeziuslower, pectoralisminor, rhomboids",
"synergists": "hipexernalrotators, iliopsoas, quadratuslumborum, erectorspinae",
"target": "obliques"},"WaistCBKneelingTwistingCrunch":{"id": "9",
"exerciseid": "CBKneelingTwistingCrunch",
"musclegroup": "Waist",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Cable Kneeling Twisting Crunch",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Kneel below high pulley. Grasp cable rope attachment with both hands. Place wrists against head. Position hips back and flex hips, allowing resistance on cable pulley to lift torso upward so spine is hyperextended.",
"execution": "With hips stationary, flex waist to one side so elbow travels toward midthigh on opposite side. Return to original position and repeat on opposite side. Continue by alternating between sides.",
"comments": "Note movement occurs in waist, not hips. See Spot Reduction Myth. Hyperextension of spine at top of motion is achieved by anterior rotation of pelvis with flexed hips. Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. If two soft stirrups are used instead of rope attachment, grasp stirrups at side of head.",
"stabilizers": "latissimusdorsi, pectoralisclavicular, tricepsbrachii, tensorfasciaelatae, serratusanterior, pectoralissternal, iliopsoas, sartorius, deltoidposterior, teresmajor, trapeziuslower, pectoralisminor, rhomboids, quadriceps",
"synergists": "rectusabdominis",
"target": "obliques"},"WaistCBStandingTwistingCrunch":{"id": "10",
"exerciseid": "CBStandingTwistingCrunch",
"musclegroup": "Waist",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Cable Standing Twisting Crunch",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Position back against back pad with knees slightly bent, shoulders back, and chest high. Place both cable straps over shoulders, one in each hand. Place hands with cable strap in front of each shoulder so that cable is taut. If available, place hands in strap slots that allow cable to be taut when hands are in position with shoulders back.",
"execution": "Flex and twist spine so torso pulls strap forward and downward while twisting one shoulder to forward center. Return until back of shoulders return to back pad. Repeat alternating twists with opposite sides.",
"comments": "To allow for full range of motion, grip height on strap should not allow weight to bottom out (weights touching stack) when shoulders are back. Padded hump should be adjusted to height of low back. See Spot Reduction Myth.",
"stabilizers": "No significant stabilizers",
"synergists": "iliopsoas, rectusabdominis",
"target": "obliques"}}