{"NeckBWRearNeckBridge":{"id": "0",
"exerciseid": "BWRearNeckBridge",
"musclegroup": "Neck",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Splenius",
"name": "Rear Neck Bridge",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lying supine on well cushioned mat. Position feet very close to hips. Raise buttocks and low back slightly off of floor and fold hands on abdomen.",
"execution": "Extend hips and knees while pushing head back into floor. Roll back on head while arching spine high off of floor. Hyperextend neck back in attempt to bring forehead toward mat. Return body to close to mat until back of head and shoulders make contact with mat. Repeat.",
"comments": "Also known as wrestlers bridge. See controversial exercises. Easier Before attempting this exercise, beginners should perform movement on wall or column so neck structures have an opportunity to adapt. Standard neck exercise can also be used for progressive adaptation. Wall Rear Neck BridgeWeighted Neck Extension Harder Exercise can be made more challenging by placing weight plate on abdomen.",
"stabilizers": "No significant stabilizers",
"synergists": "trapeziusupper, gluteusmaximus, erectorspinae, levatorscapulae, sternocleidomastoid, quadriceps",
"target": "splenius"},"NeckBWWallRearNeckBridge":{"id": "1",
"exerciseid": "BWWallRearNeckBridge",
"musclegroup": "Neck",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Splenius",
"name": "Wall Rear Neck Bridge",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Hold small or folded cushioned mat behind head. Facing away from wall or column position head and back of shoulders low on wall or column with mat between. Stand with feet far away from wall or column so body is angled back. Position hips and back straight and bend knees just slightly. Place arms to side or hold hands on abdomen.",
"execution": "Push head back into mat and roll head upward. Arch spine and straighten knees. Hyperextend neck so head is facing up. Return to origianl position by rolling head down while allowing low back to straighten and knees to bend slightly. Continue down until back of head and shoulders make contact with mat. Repeat.",
"comments": "See controversial exercises. Easier Begin with feet slightly closer to wall or column, so neck structures have an opportunity to adapt. Standard neck exercises with light weights can also be less intense. Weighted Neck ExtensionWeighted Lying Neck Extension Harder Exercise is more challenging when feet are positioned further from column or wall. Movement is much more difficult when performed on floor. Rear Neck Bridge on Floor ",
"stabilizers": "gluteusmaximus",
"synergists": "trapeziusupper, erectorspinae, levatorscapulae, sternocleidomastoid, quadriceps",
"target": "splenius"}}