{"BackCBSeatedExternalRotation":{"id": "0",
"exerciseid": "CBSeatedExternalRotation",
"musclegroup": "Back",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Infraspinatus",
"name": "Cable Seated Shoulder External Rotation",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit with side to low pulley. Grasp dumbbell cable attachment with far arm. Position elbow against side and forearm across belly.",
"execution": "Pull cable attachment away from body by externally rotating shoulder. Return and repeat. Turn around and continue with opposite arm.",
"comments": "Maintain elbow against side and fixed elbow position (90 angle) throughout exercise. Exercise may be performed standing with medium high pulley.",
"stabilizers": "wristextensors, trapeziuslower, rhomboids, deltoidlateral",
"synergists": "deltoidposterior, teresminor",
"target": "infraspinatus"},"BackCBStandingExternalRotation":{"id": "1",
"exerciseid": "CBStandingExternalRotation",
"musclegroup": "Back",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Infraspinatus",
"name": "Cable Standing Shoulder External Rotation",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand with side to elbow height cable pulley. Grasp stirrup attachment with far arm. Position elbow against side and forearm across belly.",
"execution": "Pull cable attachment away from body as far as possible by externally rotating shoulder. Return and repeat. Turn around and continue with opposite arm.",
"comments": "Maintain elbow against side and fixed elbow position (90 angle) throughout exercise. Exercise may be performed seated on chair with pulley lowered to elbow height or seated on floor with low pulley.",
"stabilizers": "wristextensors, trapeziuslower, rhomboids, deltoidlateral",
"synergists": "deltoidposterior, teresminor",
"target": "infraspinatus"},"BackCBUprightExternalRotation":{"id": "2",
"exerciseid": "CBUprightExternalRotation",
"musclegroup": "Back",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Infraspinatus",
"name": "Cable Upright Shoulder External Rotation",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand facing low to medium height cable pulley. Grasp stirrup attachment and position bent elbow shoulder height out to side with forearm in line with cable.",
"execution": "Pull stirrup up and back as far as possible. Return by lowering stirrup to original position. Repeat. Continue with opposite arm.",
"comments": "Wrist may be kept straighter throughout movement than what is shown. Also, keep elbow at shoulder height and bent at right angle. Height of cable pulley is dependent upon Individual range of motion shoulder internal and external rotationalso see Flexibility AssessmentsFor example, pulley cable can be lowered if exerciser has adequate shoulder internal rotation. Desired emphasis of resistance near specific range of motion.Greatest relative resistance is at range of motion where cable is perpendicular to forearm.Low pulley is hardest at beginning.Pulley at height of elbow is hardest at end.See Force Vectors.See side view.",
"stabilizers": "wristextensors, trapeziusmiddle, trapeziuslower, serratusanterior, rhomboids",
"synergists": "deltoidposterior, infraspinatus, supraspinatus",
"target": "teresminor"}}