{"ShouldersDBFrontLateralRaise":{"id": "0",
"exerciseid": "DBFrontLateralRaise",
"musclegroup": "Shoulders",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Supraspinatus",
"name": "Dumbbell Front Lateral Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp dumbbell and position in front of thigh with arm straight. Turn pinkie finger side outward.",
"execution": "Raise arms to side, slightly to front until shoulder height or slightly higher. Lower and repeat. Continue with opposite arm.",
"comments": "Raise toward 10 oclock with left arm and toward 2 oclock with right arm. Maintain straight elbow position with elbow pointing outward throughout exercise. Jobe FW, Moynes DR (1982) describes this exercise to strengthen supraspinatus muscle with abduction in scapular plane (30 anteriorto the frontal plane) with glenohumeral internally rotated, AKA empty can exercise. Shoulders should be kept back since scapula protraction can decrease width of subacromical space, possibly increasing risk of subacromical impingement (SolemBertift E, et al. 1993). Also see Dumbbell Full Can Lateral Raise.",
"stabilizers": "wristextensors, trapeziusupper",
"synergists": "trapeziusmiddle, deltoidlateral, deltoidanterior, trapeziuslower, serratusanterior",
"target": "supraspinatus"},"ShouldersDBFrontLateralRaiseSeated":{"id": "1",
"exerciseid": "DBFrontLateralRaiseSeated",
"musclegroup": "Shoulders",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Supraspinatus",
"name": "Dumbbell Seated Front Lateral Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on stool or end of bench with dumbbell. Position dumbbell down to side with arm straight. Turn pinkie finger side outward.",
"execution": "Raise arms to side, slightly in front until shoulder height or slightly higher. Lower and repeat. Continue with opposite arm.",
"comments": "Raise toward 10 oclock with left arm and toward 2 oclock with right arm. Maintain straight elbow position with elbow pointing outward throughout exercise. Jobe FW, Moynes DR (1982) describes this exercise to strengthen supraspinatus muscle with abduction in scapular plane (30 anterior to the frontal plane) with glenohumeral internally rotated, AKA empty can exercise. Shoulders should be kept back since scapula protraction can decrease width of subacromical space, possibly increasing risk of subacromical impingement (SolemBertift E, et al. 1993). Also see Dumbbell Full Can Lateral Raise.",
"stabilizers": "wristextensors, trapeziusupper",
"synergists": "trapeziusmiddle, deltoidlateral, deltoidanterior, trapeziuslower, serratusanterior",
"target": "supraspinatus"},"ShouldersDBFullCanLateralRaise":{"id": "2",
"exerciseid": "DBFullCanLateralRaise",
"musclegroup": "Shoulders",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Supraspinatus",
"name": "Dumbbell Full Can Lateral Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp dumbbells with each hand with palms facing forward.",
"execution": "Raise arms to side with thumb side up. Lower and repeat.",
"comments": "Maintain straight elbow position throughout exercise. Exercise may also be performed with shoulder traveling up to 30 forward, more inline with plane of scapular. Supraspinatus activity is similar between empty can and full can exercises. However, full can results in less risk of subacromial impingement. Scapular internal rotation and scapular anterior tilt, both of which decrease subacromial space width and increase impingement risk, are greater when performing scaption with shoulder internal rotation (empty can) compared with scaption with external rotation (full can ). (Escamilla 2009)",
"stabilizers": "wristextensors, trapeziusupper",
"synergists": "trapeziusmiddle, deltoidlateral, deltoidanterior, trapeziuslower, serratusanterior",
"target": "supraspinatus"}}