{"WaistSTPullThrough":{"id": "0",
"exerciseid": "STPullThrough",
"musclegroup": "Waist",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Suspended Pull Through",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Sit on floor with feet under suspension trainer loops in low position. Reach and grasp bottom of loops and lay back supine. Raise legs and place heels in loops with soles contacting handles (or ankles through loops as shown). Extend legs out straight. Sit up and place hands on floor to sides at desired distance from suspension trainer. Raise hips from floor supporting upper body with arms.",
"execution": "Pull hips back while flexing spine in C shape. Raise hips up high by straightening spine and hips until straight.",
"comments": "See Suspended Supine Feet MountDismount. Abdominals are exercised during spinal flexion , whereas, Erector Spinae is exercised during spinal extension. See Spot Reduction Myth and Lower Ab Myth. This exercise can be performed on TRX style suspension trainer. Easier Movement can be made easier for Abdominals, yet harder for Erector Spinae by positioning body closer under anchor of suspension trainer. Harder Movement can be made harder for Abdominals, yet easier for Erector Spinae by positioning body further back, away horizontally from anchor of suspension trainer.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, tricepsbrachii, levatorscapulae, pectoralissternal, trapeziusmiddle, deltoidanterior, trapeziuslower, pectoralisminor, rhomboids",
"synergists": "iliopsoas, sartorius, hamstrings, gluteusmaximus, erectorspinae, tensorfasciaelatae, obliques",
"target": "rectusabdominis"},"WaistSTRollout":{"id": "1",
"exerciseid": "STRollout",
"musclegroup": "Waist",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Suspended Rollout",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Kneel on floor or mat and grasp suspension trainer handles. Position body upright with subtle bend through hip. Also, straighten arms in front of body with slight bend.",
"execution": "Lean body forward while maintaining small bend in hip. Allow arms to bend forward to sides of head. Bend over as far as possible. Raise body back up by pulling arms back until kneeling upright in original position. Repeat.",
"comments": "Try to keep elbows nearly straight throughout exercise. Target muscle, Rectus Abdominis practically contracts isometrically since only a small degree of waist flexion occurs under resistance and, with the assistance of the External Oblique, act to stabilize spine. See target muscle of rollout question. Also see Spot Reduction Myth and Lower Ab Myth. This exercise can be performed on TRX style suspension trainer or adjustable length gymnastics rings. Also known as Suspended Kneeling Rollout. Easier Movement can be made easier by kneeling closer under anchor of suspension trainer. Movement can also be made slightly easier by performing exercise with slightly higher suspension handles. Bending elbow more or descending only part way down is easier and can be performed this ways to progress into exercise. Harder Movement can be made more challenging by kneeling further behind, away horizontally from anchor of suspension trainer. Exercise can be made slightly more challenging by performing movement with lower suspension handles. Make sure to roll out until shoulder is fully extended through full range of motion with arm straight.",
"antagonist stabilizers": "erectorspinae",
"dynamic stabilizers": "quadriceps",
"stabilizers": "pectoralisclavicular, tricepsbrachii, tensorfasciaelatae, wristflexors, iliopsoas, sartorius, adductors, pectineus, obliques",
"synergists": "latissimusdorsi, deltoidposterior, pectoralisminor, teresmajor, pectoralissternal, rhomboids",
"target": "rectusabdominis"},"WaistSTJackknife":{"id": "2",
"exerciseid": "STJackknife",
"musclegroup": "Waist",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Suspended Jack-knife",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Sit on floor facing suspension trainer loops in low position. Place right foot in left lower loop. Cross left leg over right leg placed in right lower loop. Turn body to right and place hands on floor, shoulder width apart. Turn body to kneel on hands and knees. Reposition hands squared with desired distance from suspension trainer, shoulder width or slightly wider. With arms straight, raise knees from ground so body is supported by arms and suspension trainer.",
"execution": "Pull legs under torso by bending hips and knees. Pull knees toward chest hips and knees until completely flexed. Return by extending hips and knees to original position. Repeat.",
"comments": "See Suspended Prone Feet MountDismount. Keep shins close to horizontal and arms straight with shoulders positioned above hands. Dismount by removing straps while kneeling or after sitting on one side of hip before rotating body to seated position. This exercise can be performed on TRX style suspension trainer. Flexion and extension of knees are passive. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique act only isometrically contract to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible. See Spot Reduction Myth and Lower Ab Myth. Easier Movement can be made easier by lying closer under anchor of suspension trainer. Harder Movement can be made more challenging by lying further forward, away horizontally from anchor of suspension trainer. Alternately raise hips much higher while keeping shin near horizontal. Jackknife Pike",
"antagonist stabilizers": "trapeziuslower, trapeziusmiddle, rhomboids, erectorspinae",
"dynamic stabilizers": "quadriceps",
"stabilizers": "tricepsbrachii, rectusabdominis, quadriceps, serratusanterior, pectoralissternal, deltoidanterior",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, obliques",
"target": "rectusabdominis"},"WaistSTJackknifePike":{"id": "3",
"exerciseid": "STJackknifePike",
"musclegroup": "Waist",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Suspended Jack-knife Pike",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Sit on floor facing suspension trainer loops in low position. Place right foot in left lower loop. Cross left leg over right leg placed in right lower loop. Turn body to right and place hands on floor, shoulder width apart. Turn body to kneel on hands and knees. Reposition hands (shoulder width or slightly wider) at desired distance from suspension trainer so that body is square with suspension trainer straps. With arm straight, raise knees from ground so body is supported by arms and suspension trainer.",
"execution": "Pull knees toward shoulders while raising hips very high. Lower hips by extending body to original straight position, while keeping shins close to horizontal. Repeat.",
"comments": "See Suspended Prone Feet MountDismount . Keep shins close to horizontal and arms straight with shoulders positioned above hands. Dismount by removing straps, while kneeling or after sitting on one side of hip before rotating body to seated position. This exercise can be performed on TRX style suspension trainer. Flexion and extension of knees are passive. Quadriceps actually contracts eccentrically during concentric contraction of lift. Flexion of shoulders are also passive. Trapezius acts as Stabilizer in inverted position, whereas, its middle and lower fibers act as Antagonist Stabilizers in plank position. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique only isometrically contract to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible. See Spot Reduction Myth and Lower Ab Myth . Easier Movement can be made easier by lying closer under anchor of suspension trainer. Alternately, do not raise hips nearly as high, allowing knees and hip to bend in jackknife movement to decrease intensity. Suspended Jackknife Harder Movement can be made more challenging by lying further forward, away horizontally from anchor of suspension trainer. Alternately, perform a pike position by not bending knees. Suspended Pike",
"antagonist stabilizers": "trapeziuslower, trapeziusmiddle, rhomboids, erectorspinae",
"dynamic stabilizers": "quadriceps",
"stabilizers": "trapeziusupper, tricepsbrachii, serratusanterior, pectoralissternal, trapeziusmiddle, deltoidanterior, trapeziuslower, rectusabdominis, quadriceps",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, obliques",
"target": "rectusabdominis"},"WaistSTRollout":{"id": "4",
"exerciseid": "STRollout",
"musclegroup": "Waist",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Suspended Rollout",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Kneel on floor or mat and grasp suspension trainer handles. Position body upright with subtle bend through hip. Also, straighten arms in front of body with slight bend.",
"execution": "Lean body forward while maintaining small bend in hip. Allow arms to bend forward to sides of head. Bend over as far as possible. Raise body back up by pulling arms back until kneeling upright in original position. Repeat.",
"comments": "Try to keep elbows nearly straight throughout exercise. Target muscle, Rectus Abdominis practically contracts isometrically since only a small degree of waist flexion occurs under resistance and, with the assistance of the External Oblique, act to stabilize spine. See target muscle of rollout question. Also see Spot Reduction Myth and Lower Ab Myth. This exercise can be performed on TRX style suspension trainer or adjustable length gymnastics rings. Also known as Suspended Kneeling Rollout. Easier Movement can be made easier by kneeling closer under anchor of suspension trainer. Movement can also be made slightly easier by performing exercise with slightly higher suspension handles. Bending elbow more or descending only part way down is easier and can be performed this ways to progress into exercise. Harder Movement can be made more challenging by kneeling further behind, away horizontally from anchor of suspension trainer. Exercise can be made slightly more challenging by performing movement with lower suspension handles. Make sure to roll out until shoulder is fully extended through full range of motion with arm straight.",
"antagonist stabilizers": "erectorspinae",
"dynamic stabilizers": "quadriceps",
"stabilizers": "pectoralisclavicular, tricepsbrachii, tensorfasciaelatae, wristflexors, iliopsoas, sartorius, adductors, pectineus, obliques",
"synergists": "latissimusdorsi, deltoidposterior, pectoralisminor, teresmajor, pectoralissternal, rhomboids",
"target": "rectusabdominis"}}