{"HipsPCPiriformis":{"id": "0",
"exerciseid": "PCPiriformis",
"musclegroup": "Hips",
"equipment": "stretch(piriformis)",
"exercisetype": "Stretches",
"muscleclass": "HipExternalRotators",
"name": "Lever Piriformis Stretch",
"preparation": "Sit on seat in forward position with lower leg on shin pad, feet on foot rest. Place hands through wrist straps. Hold upper bar with overhand grip, both hands left of center. Position left leg extended toward right center.",
"execution": "Push and lower seat back. Repeat with opposite leg.",
"comments": "Low back may be stretched if hips and low back muscles are tight.",
"other": "hamstrings, rhomboids, erectorspinae",
"target": "hipexernalrotators"},"HipsLyingPiriformis":{"id": "1",
"exerciseid": "LyingPiriformis",
"musclegroup": "Hips",
"equipment": "stretch(piriformis)",
"exercisetype": "Stretches",
"muscleclass": "HipExternalRotators",
"name": "Lying Piriformis Stretch",
"preparation": "Lie on floor or mat with feet on floor and knees bent approximately 90 degrees. Cross thighs by lacing back of knee on thigh of other leg. Lift legs and hug both thighs locking both hands together behind knee of lower leg.",
"execution": "Pull leg toward torso. Hold stretch. Repeat with opposite leg.",
"comments": "An alternative preparation set on floor or mat reclining back with support of both arms behind body. Bend knees with feet on floor. Place back of knee on thigh of other leg. Hug both thighs locking both hands together behind knee of lower leg. Lie down supine by rolling to back. Notice position of upper leg in contrast to Lying Glute Stretch. Also see modified version of Lying Piriformis Stretch for alternative form.",
"target": "hipexernalrotators"},"HipsLyingPiriformisMod":{"id": "2",
"exerciseid": "LyingPiriformisMod",
"musclegroup": "Hips",
"equipment": "stretch(piriformis)",
"exercisetype": "Stretches",
"muscleclass": "HipExternalRotators",
"name": "Lying Piriformis Stretch (single leg)",
"preparation": "Lie on floor or mat. Lift one leg and grasp ankle and knee with both hands.",
"execution": "Pull thigh toward torso while keeping knee over torso. Hold stretch. Repeat with opposite leg.",
"comments": "Notice knee is keep over torso in contrast to Lying Glute Stretch. Also see Lying Piriformis Stretch for alternative form.",
"target": "hipexernalrotators"},"HipsPNFLyingPiriformis":{"id": "3",
"exerciseid": "PNFLyingPiriformis",
"musclegroup": "Hips",
"equipment": "stretch(piriformis)",
"exercisetype": "Stretches",
"muscleclass": "HipExternalRotators",
"name": "PNF Lying Piriformis Stretch",
"preparation": "Instruct participant to lie on floor or mat with legs bent. Stand near their feet facing them. Assist them crossing their thighs, placing outside of one knee close to top of their other knee. Bend over participants hips, position their foot of closest bent leg on your chest or shoulder while grasping their lower leg, in addition to knee of opposite leg with other hand.",
"execution": "Push your bodyweight down on foot while pushing down on side of participants knee. Hold stretch. Repeat with legs in opposite position.",
"comments": "Low back may be stretched if hips raise off of floor significantly. If spinal flexion is not desired, care should be given to keep back of hips on floor by monitoring hips position and pushing downward instead of toward participants chest. See PNF stretch techniques. Also see Lying Piriformis Stretch for similar static stretch.",
"other": "erectorspinae",
"target": "hipexernalrotators"},"HipsSeatedPiriformis":{"id": "4",
"exerciseid": "SeatedPiriformis",
"musclegroup": "Hips",
"equipment": "stretch(piriformis)",
"exercisetype": "Stretches",
"muscleclass": "HipExternalRotators",
"name": "Seated Piriformis Stretch",
"preparation": "Sit on floor or mat, reclining back with support of both arms behind body, and feet on floor and knees bent approximately 90 degrees. Cross thighs by placing back of knee on thigh of other leg. Grasp lower leg.",
"execution": "Reposition hands forward with arms straight to place torso closer to legs. Hold stretch. Repeat with opposite leg.",
"comments": "Low back may be stretched if spine flexes significantly during stretch. Arms can hug and pull upper legs toward torso as shown in lower photo.",
"other": "erectorspinae",
"target": "hipexernalrotators"},"HipsSeatedPiriformisChair":{"id": "5",
"exerciseid": "SeatedPiriformisChair",
"musclegroup": "Hips",
"equipment": "stretch(piriformis)",
"exercisetype": "Stretches",
"muscleclass": "HipExternalRotators",
"name": "Seated Piriformis Stretch (chair or bench)",
"preparation": "Sit on chair of bench with feet on floor and knees bent approximately 90 degrees. Cross thighs by placing back of knee on thigh of other leg. Grasp lower leg.",
"execution": "Lean forward pulling body toward legs. Hold stretch. Repeat with opposite leg.",
"comments": "Low back may be stretched if hips and low back muscles are tight.",
"other": "erectorspinae",
"target": "hipexernalrotators"},"HipsPNFSeatedPiriformis":{"id": "6",
"exerciseid": "PNFSeatedPiriformis",
"musclegroup": "Hips",
"equipment": "stretch(piriformis)",
"exercisetype": "Stretches",
"muscleclass": "HipExternalRotators",
"name": "PNF Seated Piriformis Stretch",
"preparation": "Instruct participant to sit on floor or mat, reclining back with support of both arms behind body, and feet on floor and knees bent. Have them cross their thighs by placing back of knee on thigh of other leg. Ask them position foot on floor closer to hip. Place your hands on back of participants shoulders or position your chest on participants upper back and your hands under participants lower thighs.",
"execution": "Push participants torso toward legs. Hold stretch. Repeat with legs in opposite position.",
"comments": "See PNF stretch techniques. A static Seated Piriformis Stretch can also be performed without assistance.",
"other": "erectorspinae",
"target": "hipexernalrotators"}}