{"ThighsASHamstringRaiseSelf":{"id": "0",
"exerciseid": "ASHamstringRaiseSelf",
"musclegroup": "Thighs",
"equipment": "self-assisted",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Self-assisted Inverse Leg Curl",
"utility": "Basic",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Place elevated platform in front of glutehamstring apparatus. Adjust padded supports and kneel upright in apparatus. Position knees against large roller pad or nearupper side of padded hump (depending on model), ankles between padded supports, and feet on platform.",
"execution": "Lower body with hips straight by slowly straightening knees. Position hands forward, ready to push body weight back up off of surface. Control descent only with hamstrings as low as possible before catching body by quickly placing hands on elevated platform and rapidly pushing off against platform, just enough to assist hamstrings in raising body upward. Return to upright kneeling position and repeat.",
"comments": "This movement is also known as Selfassisted Hamstring Raise. To keep exercise challenging, push off only hard enough to minimally assist raising of body with hamstrings only.  Place hands on top of platform when controlled descent can no longer be maintained with hamstring strength alone. Also attempt to keep hips as straight as possible throughout movement Dorsal flexion of ankle reduces active insufficiency of Gastrocnemius allowing it to assist in knee flexion. Also see Inverse Leg Curl comments and Arm Position During Exercises. Easier GluteHam Raise Harder Inverse Leg Curl",
"antagonist stabilizers": "tibialisanterior, quadriceps, rectusabdominis, obliques",
"stabilizers": "erectorspinae, gluteusmaximus, adductors",
"synergists": "popliteus, gracilis, pectoralisclavicular, tricepsbrachii, wristflexors, pectoralissternal, sartorius, deltoidanterior, gastrocnemius",
"target": "hamstrings"},"ThighsASHamstringRaiseSelfFloor":{"id": "1",
"exerciseid": "ASHamstringRaiseSelfFloor",
"musclegroup": "Thighs",
"equipment": "self-assisted",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Self-assisted Inverse Leg Curl (on floor)",
"utility": "Basic",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Kneel on floor. Position ankles under fixed bar or pad and knees on thick dense pad. Kneel upright with hips straight. Extend arms out to sides with elbow pointing back and slightly bent. Position hands slightly forward with palms facing forward or slightly toward floor.",
"execution": "Lower body with hips straight by slowly straightening knees. Control descent only with hamstrings as low as possible. Only when body begins to fall, touch down with tensed finger tips out to each side. Once fingers make contact with floor, control remaining descent with assistance of arms. Allowing chest to come very close to floor, rapidly push off against floor, again just enough to assist hamstrings in raising body upward. Return to upright kneeling position and repeat.",
"comments": "This movement is also known as Selfassisted Hamstring Raise on Floor. Bar or pad height should be only just high enough to position ankles underneath, allowing room for vertical orientation of feet with toes on floor.  To keep exercise challenging, push off only hard enough to minimally assist raising of body with hamstrings. Attempt to keep hips as straight as possible throughout movement. Dorsal flexion of ankle reduces active insufficiency of Gastrocnemius allowing it to assist in knee flexion. Also see Inverse Leg Curl comments and Arm Position During Exercises. Easier GluteHam Raise Harder Inverse Leg Curl",
"antagonist stabilizers": "tibialisanterior, quadriceps, rectusabdominis, obliques",
"stabilizers": "erectorspinae, gluteusmaximus, adductors",
"synergists": "popliteus, gracilis, pectoralisclavicular, wristflexors, pectoralissternal, bicepsbrachii, sartorius, brachialis, deltoidanterior, gastrocnemius",
"target": "hamstrings"}}