{"HipsWtDeclineSitup":{"id": "0",
"exerciseid": "WtDeclineSitup",
"musclegroup": "Hips",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Weighted Decline Sit-up",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on apparatus with lower leg secured under padded bar. Hold weight in front of chest (as shown) or behind neck or use no weight.",
"execution": "Lower body back until hips are almost extended. Raise body by flexing hips until torso is upright. Repeat.",
"comments": "Exercise can be performed without added weight until more resistance is needed. Lower decline to increase resistance. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. See Arm Position During Waist Exercises and Spot Reduction Myth and Lower Ab Myth. Also see Dangerous Exercise Essay.",
"stabilizers": "rectusabdominis, obliques",
"synergists": "sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps",
"target": "iliopsoas"},"HipsWtHangLegRaise":{"id": "1",
"exerciseid": "WtHangLegRaise",
"musclegroup": "Hips",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Weighted Hanging Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Place weight between ankles or use no weight. Grasp and hang from high bar.",
"execution": "Raise legs by flexing hips and knees until hips are completely flexed or knees are well above hips. Return until hips and knees are extended. Repeat.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. Exercise may be performed with ab straps. It may be necessary to completely flex hips before waist flexion is possible see Weighted Hanging LegHip Raise. Exercise can be performed without added weight until more resistance is needed. Knees may be kept extended throughout leg raise to increase intensity see Weighted Hanging Straight Leg Raise. Also see Spot Reduction Myth and Lower Ab Myth.",
"dynamic stabilizers": "quadriceps",
"stabilizers": "rectusabdominis, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsWtHangingStraightLegRaise":{"id": "2",
"exerciseid": "WtHangingStraightLegRaise",
"musclegroup": "Hips",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Weighted Hanging Straight Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Place weight between ankles or use no weight. Grasp and hang from high bar.",
"execution": "With knees straight, raise legs by flexing hips until thighs are just past parallel to floor. Return until hips are extended downward. Repeat.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible see Weighted Hanging LegHip Raise. Exercise can be performed without added weight until more resistance is needed see Hanging Straight Leg Raise. Knees can flex along with hips to decrease intensity see Weighted Hanging Leg Raise. Also see Spot Reduction Myth and Lower Ab Myth.",
"stabilizers": "quadriceps, rectusabdominis, obliques",
"synergists": "sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps",
"target": "iliopsoas"},"HipsWtInclineLegRaise":{"id": "3",
"exerciseid": "WtInclineLegRaise",
"musclegroup": "Hips",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Weighted Incline Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on incline board. Place weight between feet or use no weight. Lie supine on incline board with torso elevated. Grasp feet hooks or sides of board for support.",
"execution": "Raise legs by flexing hips and knees until hips are completely flexed. Return until hips and knees are extended. Repeat.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible see Weighted Incline LegHip Raise. Exercise can be performed without added weight until more resistance is needed. Elevate incline to increase resistance. Knees may be kept extended throughout leg raise to increase intensity see Weighted Incline Straight Leg Raise. Also see Spot Reduction Myth and Lower Ab Myth.",
"dynamic stabilizers": "quadriceps",
"stabilizers": "latissimusdorsi, tricepsbrachii, pectoralissternal, deltoidposterior, teresmajor, obliques, rectusabdominis, quadriceps",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsWtInclineLegRaiseArmPads":{"id": "4",
"exerciseid": "WtInclineLegRaiseArmPads",
"musclegroup": "Hips",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Weighted Incline Leg Raise (arms on pads)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on bottom edge of incline board and place weight between feet. Lie back on incline board. Grasp handles and place forearms on arm pads to each side.",
"execution": "Raise legs by flexing hips and knees until hips are completely flexed. Return until hips and knees are extended. Repeat.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible see Weighted Incline LegHip Raise . Exercise can also be performed on incline board or without added weight until more resistance is needed. Also see Spot Reduction Myth and Lower Ab Myth.",
"dynamic stabilizers": "quadriceps",
"stabilizers": "latissimusdorsi, pectoralissternal, pectoralisminor, trapeziuslower, quadriceps, rectusabdominis, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsWtInclineStraightLegRaise":{"id": "5",
"exerciseid": "WtInclineStraightLegRaise",
"musclegroup": "Hips",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Weighted Incline Straight Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on incline board. Place weight between ankles. Lie supine on incline board with torso elevated. Grasp feet hooks or sides of board for support.",
"execution": "With knees straight, raise legs by flexing hips until thighs are just past perpendicular to torso. Return until hips and knees are extended. Repeat.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible see Weighted Incline LegHip Raise. Care should be taken not to have weight falling over or thrown onto sensive bodily areas. For this reason increasing incline to increase intensity may be wiser than adding additional weight. Exercise can be performed without added weight on greater incline. Knees can flex along with hips to decrease intensity see Weighted Incline Leg Raise. Also see Spot Reduction Myth and Lower Ab Myth.",
"stabilizers": "latissimusdorsi, tricepsbrachii, pectoralissternal, deltoidposterior, teresmajor, obliques, rectusabdominis, quadriceps",
"synergists": "sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps",
"target": "iliopsoas"},"HipsWtInclineStraightLegRaiseArmPads":{"id": "6",
"exerciseid": "WtInclineStraightLegRaiseArmPads",
"musclegroup": "Hips",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Weighted Incline Straight Leg Raise (arms on pads)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on bottom edge of incline board and place weight between feet. Lie back on incline board. Grasp handles and place forearms on arm pads to each side.",
"execution": "With knees straight, raise legs by flexing hips until hips are flexed. Return until hips and knees are extended. Repeat.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible see Weighted Incline LegHip Raise. Care should be taken not to have weight falling over or thrown onto sensitive bodily areas. For this reason, increasing incline to increase intensity may be wiser than adding additional weight. Exercise can be performed without added weight on greater incline. Knees can flex along with hips to decrease intensity see Weighted Incline Leg Raise. Also see Spot Reduction Myth and Lower Ab Myth.",
"stabilizers": "latissimusdorsi, pectoralissternal, rectusabdominis, trapeziuslower, quadriceps, pectoralisminor, obliques",
"synergists": "sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps",
"target": "iliopsoas"},"HipsWtLyingLegRaise":{"id": "7",
"exerciseid": "WtLyingLegRaise",
"musclegroup": "Hips",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Weighted Lying Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on end of bench. Place weight between feet. Lie supine on bench. Grasp bench on each side behind head for support.",
"execution": "Raise legs by flexing hips and knees until hips are completely flexed. Return until hips and knees are extended. Repeat.",
"comments": "Exercise can be performed without added weight until more resistance is needed (see Lying Leg Raise). Knees may be kept extended throughout leg raise to increase intensity. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible see Weighted Incline LegHip Raise. Exercise can be performed without added weight until more resistance is needed. Also see Spot Reduction Myth and Lower Ab Myth.",
"dynamic stabilizers": "quadriceps",
"stabilizers": "quadriceps, rectusabdominis, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsWtRomanChairSitup":{"id": "8",
"exerciseid": "WtRomanChairSitup",
"musclegroup": "Hips",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Weighted Roman Chair Sit-up",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on apparatus with lower leg secured under padded bar. Hold weight to front of chest or behind neck or use no weight.",
"execution": "Lower body back until hips are almost extended. Raise body by flexing hips until torso is upright. Repeat.",
"comments": "Exercise can be performed on standard bench or without added weight. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. See Arm Position During Waist Exercises and Spot Reduction Myth and Lower Ab Myth. Also see Dangerous Exercise Essay.",
"stabilizers": "rectusabdominis, obliques",
"synergists": "sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps",
"target": "iliopsoas"},"HipsWtSeatedLegRaise":{"id": "9",
"exerciseid": "WtSeatedLegRaise",
"musclegroup": "Hips",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Weighted Seated Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on edge of bench with legs extended to floor. Place weight between ankles. Grasp edge of bench. Lean torso back and balance bodyweight on edge of bench.",
"execution": "Raise legs by flexing hips and knees while pulling torso slightly forward to maintain balance. Return by extending hips and knees and lean torso back to counter balance. Repeat.",
"comments": "Heels may make contact with floor to maintain balance at bottom of movement. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible. Exercise can be performed without added weight until more resistance is needed (See Seated Leg Raise without weight). Also see Spot Reduction Myth and Lower Ab Myth.",
"dynamic stabilizers": "quadriceps",
"stabilizers": "rectusabdominis, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsWtVerticalLegRaise":{"id": "10",
"exerciseid": "WtVerticalLegRaise",
"musclegroup": "Hips",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Weighted Vertical Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Place weight between ankles or use no weight. Position forearms on padded parallel bars with hands on handles, and back on vertical pad.",
"execution": "Raise legs by flexing hips and knees until hips are completely flexed or knees are well above hips. Return until hips and knees are extended. Repeat.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible see Weighted Vertical LegHip Raise. Exercise can be performed without added weight until more resistance is needed (See Vertical Leg Raise without weight). Knees may be kept extended throughout leg raise to increase intensity see Weighted Vertical Straight Leg Raise. Also see Spot Reduction Myth and Lower Ab Myth.",
"dynamic stabilizers": "quadriceps",
"stabilizers": "latissimusdorsi, pectoralissternal, pectoralisminor, trapeziuslower, rectusabdominis, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsWtVerticalLegRaisePB":{"id": "11",
"exerciseid": "WtVerticalLegRaisePB",
"musclegroup": "Hips",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Weighted Vertical Leg Raise (on parallel bars)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Place weight between ankles. Stand between parallel bars and grip bar on each side with overhand grip. Lift body off floor and balance body upright with arms straight.",
"execution": "Raise legs by flexing hips and knees until thighs are just past parallel to floor. Return until hips and knees are extended. Repeat.",
"comments": "This exercise is alternative to Vertical Leg Raise when apparatus is not available, or Hanging Leg Raise when high bar is not available or too low to allow for adequate leg clearance. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible see Weighted Vertical LegHip Raise on parallel bars. Exercise can be performed without added weight until more resistance is needed (See Vertical Leg Raise on dip bar). Knees may be kept extended throughout leg raise to increase intensity. Also see Spot Reduction Myth and Lower Ab Myth.",
"dynamic stabilizers": "quadriceps",
"stabilizers": "latissimusdorsi, tricepsbrachii, rectusabdominis, pectoralissternal, deltoidposterior, deltoidanterior, trapeziuslower, pectoralisminor, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsWtVerticalStraightLegRaise":{"id": "12",
"exerciseid": "WtVerticalStraightLegRaise",
"musclegroup": "Hips",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Weighted Vertical Straight Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Place weight between ankles or use no weight. Position forearms on padded parallel bars with hands on handles, and back on vertical pad.",
"execution": "With knees straight, raise legs by flexing hips until thighs are just past parallel to floor. Return until hips are extended. Repeat.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible see Weighted Vertical LegHip Raise. Exercise can be performed without added weight until more resistance is needed (see Vertical Straight Leg Raise). Knees can flex along with hips to decrease intensity see Weighted Vertical Leg Raise. Also see Spot Reduction Myth and Lower Ab Myth.",
"stabilizers": "latissimusdorsi, pectoralissternal, pectoralisminor, trapeziuslower, quadriceps, rectusabdominis, obliques",
"synergists": "sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps",
"target": "iliopsoas"}}