{"ThighsSTSingleLegSquat":{"id": "0",
"exerciseid": "STSingleLegSquat",
"musclegroup": "Thighs",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Suspended Single Leg Squat",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Grasp suspension handles and momentarily step back until arms are extended forward and straight. While keeping arms straight and shoulders back, step forward so body reclines back behind suspension handles. Position body and legs straight at desired angle hanging from handles with arms straight. Balance on one leg with opposite leg extended straight forward as high as possible.",
"execution": "Squat down as far as possible while keeping leg elevated off of floor. Keep supporting knee pointed same direction as foot supporting. Raise body back, up to original position until knee and hip of supporting leg is straight. Repeat and continue with opposite leg.",
"comments": "Supporting knee should point same direction as foot throughout movement. Dismounting can be achieved by placing elevated leg down and walking backward until body is upright. Also known as Suspended Pistol Squat. This exercise can be performed on TRX style suspension trainer or adjustable length gymnastics rings. Range of motion will be improved with greater leg strength and glute flexibility. Significant spinal flexion is acceptable form in full range single leg squat. Erector Spinae becomes a stabilizer if spine is kept straight. Unlike most suspension training exercises where movement is easier in a more upright position, suspension trainer single leg squat is actually harder in most upright position. See Gravity Vectors for greater understanding of how body angle influences resistance. Weighted versions of this exercise would normally be considered auxiliary in context of other basic exercises (ie Barbell Squat, Sled Leg Press). However, in context of suspension training, this exercise can be considered basic. Easier Movement is easier in a more reclined position. Single leg split squat, with or without suspension trainer can also be considered for an easier alternative exercise. Harder Resistance is greatest when body is positioned upright with bodys center of gravity over foot. Single leg squat can also be performed without suspension trainer, requiring more balance.",
"stabilizers": "gluteusmedius, tensorfasciaelatae, iliopsoas, sartorius, trapeziusmiddle, gluteusminimus, quadratuslumborum, pectineus, quadriceps, rectusabdominis, rhomboids, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "erectorspinae, soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsSTSplitSquat":{"id": "1",
"exerciseid": "STSplitSquat",
"musclegroup": "Thighs",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Suspended Single Leg Split Squat",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Grasp one or both suspension trainer handle(s) in lower position. Step and face away from suspension trainers. Balance on one leg while raising foot from behind and slipping single foot in loop(s). Release handle with hand and position leg back so it is supported behind body by suspension trainer. Place hands on hips and maintain balance throughout exercise.",
"execution": "Squat down by flexing knee and hip of front leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward leg and repeat. Continue with opposite leg.",
"comments": "Keep torso upright during squat flexible hip flexors are important. Forward knee should point same direction as foot throughout movement. Exercise can be dismounted by lifting suspended rear foot from loop, allowing it to fall back while placing foot on floor. A training partner can assist with positioning loop around rear foot. May also be referred to as Suspended Single Leg Split Squat or Suspended Bulgarian Squat. This exercise can be performed on TRX style suspension trainer or adjustable length gymnastics rings. Weighted versions of this exercise would normally be considered auxiliary in context of other basic exercises (ie Barbell Squat, Sled Leg Press). However, in the context of suspension training only program, this exercise can be considered basic. Easier For those that lack sufficient leg strength, squat down part way as far as able. For those with inadequate balance, consider either placing foot on stationary object such as a bench or placing a hand on stationary object for support. Single Leg Split Squat (foot on bench) Harder Squatting down more deeply can make movement more difficult. Also consider Suspended Single Leg Squat as more difficult alternative exercise.",
"stabilizers": "gluteusmedius, gluteusminimus",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsSTSingleLegSplitSquatSelfAss":{"id": "2",
"exerciseid": "STSingleLegSplitSquatSelfAss",
"musclegroup": "Thighs",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Suspended Single Leg Split Squat (self-assisted)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Grasp one or both suspension trainer handle(s) in lower position hanging. Stand facing nearby fixed support and hold with one hand for balance. With other hand, secure foot in loop(s) from behind while balancing on one leg. With both hands, hold lightly on fixed support for balance and minimal assistance if needed.",
"execution": "Squat down by flexing knee and hip of front leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of supporting leg. Repeat and continue with opposite leg.",
"comments": "Keep torso upright during squat flexible hip flexors are important particularly in lower position. Forward knee should point same direction as foot throughout movement. This exercise can be performed on TRX style suspension trainer or adjustable length gymnastics rings. Weighted versions of this exercise would normally be considered auxiliary in context of other basic exercises (ie Barbell Squat, Sled Leg Press). However, in the context of body weight only program, this exercise can be considered basic. Easier Assist with upper body by slightly pulling up. It may be easier to balance by placing hands wider on fixed supports off to each side. Other squatting, split squat, or lunging movements may be easier either due to less required effort or greater stability. Single Leg Split SquatSplit SquatLunge Harder For greater challenge, add resistance with a barbell or dumbbells or perform Selfassisted Single Leg Squats BarbellDumbbellSelfassisted Single Leg Squats (bar)Selfassisted Single Leg Squats (leg wrapped)",
"stabilizers": "gluteusmedius, gluteusminimus",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"}}