{"ShouldersDBLyingRearDeltRow":{"id": "0",
"exerciseid": "DBLyingRearDeltRow",
"musclegroup": "Shoulders",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Dumbbell Lying Rear Delt Row",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Lie chest down on elevated bench. Grasp dumbbells below.",
"execution": "Keeping upper arm perpendicular to torso and dumbbells just below elbows, pull dumbbells up until elbows are just above shoulders. Return and repeat.",
"comments": "If upper arm travels closer than perpendicular to trunk, latissimus dorsi becomes involved. Elbows should be raised directly lateral to shoulders. Bench should be just high enough to prevent dumbbells from hitting floor and close to horizontal. Also see exercise performed on Lying Rear Delt Apparatus. Lying at 45 is not sufficient angle to target rear deltoids. Much lighter resistance is required as Dumbbell Lying Row.",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "infraspinatus, rhomboids, brachioradialis, brachialis, trapeziusmiddle, deltoidlateral, trapeziuslower, teresminor",
"target": "deltoidposterior"},"ShouldersDBLyingRearLateralRaise":{"id": "1",
"exerciseid": "DBLyingRearLateralRaise",
"musclegroup": "Shoulders",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Dumbbell Lying Rear Lateral Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie chest down on elevated bench. Grasp dumbbells below to each side.",
"execution": "Raise upper arms to sides until elbows are shoulder height. Maintain upper arms perpendicular to torso and fixed elbow position (10 to 30 angle) throughout exercise. Maintain height of elbows above wrists by raising pinkie side up. Lower and repeat.",
"comments": "Dumbbells are raised by shoulder transverse abduction, not external rotation, nor extension. Upper arm should travel in perpendicular path to torso to minimize latissimus dorsi involvement. Upper arm should travel in perpendicular path to torso to minimize latissimus dorsi involvement. Bench should be high enough to prevent dumbbells from hitting floor and close to horizontal. Also see exercise performed on Lying Rear Delt Apparatus. Lying at 45 is not sufficient angle to target rear deltoids. Also see Rear Lateral Raise Errors.",
"stabilizers": "wristextensors, tricepsbrachii",
"synergists": "infraspinatus, trapeziusmiddle, deltoidlateral, trapeziuslower, teresminor, rhomboids",
"target": "deltoidposterior"},"ShouldersDBOneArmRearLateralRaise":{"id": "2",
"exerciseid": "DBOneArmRearLateralRaise",
"musclegroup": "Shoulders",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Dumbbell Lying One Arm Rear Lateral Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "With dumbbell in one hand, lie chest down on elevated bench. Position palm forward (thumb up) with elbow straight or slightly bent.",
"execution": "Raise upper arm to side until elbow is shoulder height. Maintain upper arms perpendicular to torso with elbow straight throughout exercise. Maintain palm forward position. Lower and repeat.",
"comments": "Bench should be horizontal and be high enough to prevent dumbbell from touching floor. Upper arm should travel in perpendicular path to torso to minimize latissimus dorsi involvement. Bench should be high enough to prevent dumbbells from hitting floor and close to horizontal. Lying at 45 is not sufficient angle to target rear deltoids. This exercise AKA prone full can has been suggested to exercise supraspinatus muscle in rehabilitation settings (Blackburn TA, et al. 1990 Reinold MM, et al. 2007).",
"stabilizers": "wristextensors, wristflexors",
"synergists": "infraspinatus, supraspinatus, trapeziusmiddle, deltoidlateral, trapeziuslower, teresminor, rhomboids",
"target": "deltoidposterior"},"ShouldersDBRearLateralRaise":{"id": "3",
"exerciseid": "DBRearLateralRaise",
"musclegroup": "Shoulders",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Dumbbell Rear Lateral Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp dumbbells to each side. Bend knees and bend over through hips with back flat, close to horizontal. Position elbows with slight bend and palms facing together.",
"execution": "Raise upper arms to sides until elbows are shoulder height. Maintain upper arms perpendicular to torso and fixed elbow position (10 to 30 angle) throughout exercise. Maintain height of elbows above wrists by raising pinkie finger side up. Lower and repeat.",
"comments": "Dumbbells are raised by shoulder transverse abduction, not external rotation, nor extension. Upper arm should travel in perpendicular path to torso to minimize relatively powerful latissimus dorsi involvement. In other words, at top of movement, elbows (not necessarily dumbbells) should be directly lateral to shoulders since elbows are slightly bent forward. To exercise posterior deltoid and not lateral deltoid, keep torso close to horizontal. Positioning torso at 45 is not sufficient angle to target rear deltoids. Knees are bent in effort to keep low back straight (See Hamstring Inflexibility). If low back becomes rounded due to tight hamstrings, either knees should be bent more or torso may not be positioned as low. If low back is rounded due to poor form, slowly lower torso into horizontal position with knees bent and back straight. Also see Rear Lateral Raise Errors.",
"stabilizers": "wristextensors, hamstrings, erectorspinae, gluteusmaximus, tricepsbrachii, adductors, quadriceps",
"synergists": "infraspinatus, trapeziusmiddle, deltoidlateral, trapeziuslower, teresminor, rhomboids",
"target": "deltoidposterior"},"ShouldersDBRearDeltRow":{"id": "4",
"exerciseid": "DBRearDeltRow",
"musclegroup": "Shoulders",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Dumbbell Rear Delt Row",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Kneel over side of bench with arm and leg to side. Grasp dumbbell.",
"execution": "Pull dumbbell up out to side with upper arm perpendicular to trunk until upper arm is just beyond horizontal. Lower and repeat.",
"comments": "If upper arm travels closer than perpendicular to trunk, latissimus dorsi becomes involved. Elbow should be raised directly lateral to shoulder. Positioning torso at 45 is not sufficient angle to target rear deltoids. Keep torso bent over approximately horizontal. See side view of Dumbbell Rear Delt Row. Much lighter resistance is required as Dumbbell Bentover Row.",
"stabilizers": "tricepsbrachii",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "infraspinatus, rhomboids, brachioradialis, brachialis, trapeziusmiddle, deltoidlateral, trapeziuslower, teresminor",
"target": "deltoidposterior"},"ShouldersDBSeatedRearLateralRaise":{"id": "5",
"exerciseid": "DBSeatedRearLateralRaise",
"musclegroup": "Shoulders",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Dumbbell Seated Rear Lateral Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on edge of bench with feet placed beyond knees. Bend over and rest torso on thighs. Grasp dumbbells with each hand under legs. Position elbows with slight bend with palms facing together behind ankles (as shown) or just to sides of ankles.",
"execution": "Raise upper arms to sides until elbows are shoulder height. Maintain upper arms perpendicular to torso and fixed elbow position (10 to 30 angle) throughout exercise. Maintain elbows height above wrists by raising pinkie finger side up. Lower and repeat.",
"comments": "Dumbbells are raised by shoulder transverse abduction, not external rotation, nor extension. Upper arm should travel in perpendicular path to torso to minimize relatively powerful latissimus dorsi involvement. This mean at top of movement, elbows (not necessarily dumbbells) should be directly lateral to shoulders since elbows are slightly bent forward. To exercise posterior deltoid and not lateral deltoid, keep upper torso close to horizontal. Positioning upper torso at 45 is not sufficient angle to target rear deltoids. The spine can be flexed to achieve this positioning if thighs can provide sufficient support for torso. Some individuals may not be able to bend sufficiently at hip due to flexibility or girth constraints. Also see Rear Lateral Raise Errors and Low Back Alignment Exceptions.",
"stabilizers": "tricepsbrachii",
"synergists": "infraspinatus, trapeziusmiddle, deltoidlateral, trapeziuslower, teresminor, rhomboids",
"target": "deltoidposterior"},"ShouldersDBLyingRearDeltRaise":{"id": "6",
"exerciseid": "DBLyingRearDeltRaise",
"musclegroup": "Shoulders",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Dumbbell Side Lying Rear Delt Raise",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Lie on side with legs separated for support. Grasp dumbbell in front of chest, palm facing down, arm extended forward with slight bend.",
"execution": "Raise dumbbell from floor until it travels above shoulder. Return dumbbell to floor at original position. Repeat.",
"comments": "Maintain fixed elbow position straight or slightly bent and keep upper arm perpendicular to trunk throughout exercise.",
"stabilizers": "tricepsbrachii",
"synergists": "infraspinatus, trapeziusmiddle, deltoidlateral, trapeziuslower, teresminor, rhomboids",
"target": "deltoidposterior"}}