{"WaistSTHyperextension":{"id": "0",
"exerciseid": "STHyperextension",
"musclegroup": "Waist",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Suspended Hyperextension",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Grasp suspension handles and momentarily step back until arms are extended forward and straight. While keeping arms straight and shoulders back, step forward so body reclines back behind suspension handles. Fold at hips onto heels, allowing rear end to fall far back with arms and shoulders stretched forward.",
"execution": "Drive hips forward until hips are straight, while keeping arms and shoulders straight. Near top of motion, reach back with arms over head and hyperextend spine. While keeping arms over head, lower body with hips falling back down to starting position and repeat.",
"comments": "An alternative mount involves stepping back with suspension handles in hands until arms are pulled forward about 45 (give or take) from resting position. At this point, recline body back, then fold at hips, allowing rear end to fall far back with arms and shoulders stretched forward. Dismounting can be achieved by walking backward until body is upright. This exercise can be performed on TRX style suspension trainer or adjustable length gymnastics rings. Easier Resistance is least when body is positioned upright at top of exercise. Movement can be made easier with staggered foot position by placing one foot slightly back. Harder This movement can be made more challenging by placing feet more forward, thereby angling body back at initiation of movement. See Gravity Vectors for greater understanding of how body angle influences resistance.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "supraspinatus, trapeziusmiddle, deltoidlateral, tricepsbrachii, trapeziuslower, serratusanterior, deltoidanterior",
"synergists": "hamstrings, gluteusmaximus, adductors",
"target": "erectorspinae"},"WaistSTPullThrough":{"id": "1",
"exerciseid": "STPullThrough",
"musclegroup": "Waist",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Suspended Pull Through",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Sit on floor with feet under suspension trainer loops in low position. Reach and grasp bottom of loops and lay back supine. Raise legs and place heels in loops with soles contacting handles (or ankles through loops as shown). Extend legs out straight. Sit up and place hands on floor to sides at desired distance from suspension trainer. Raise hips from floor, supporting upper body with arms.",
"execution": "Pull hips back while flexing spine in C shape. Raise hips up high by straightening spine and hips until straight.",
"comments": "This exercise can be performed on TRX style suspension trainer. See Suspend ed Supine Feet MountDismount. Erector Spinae is exercised during spinal extension, whereas, Abdominals are exercised during spinal flexion. See Suspended Pull Through for Rectus Abdominis. Easier Movement can be made easier for Erector Spinae, yet harder for Abdominals by positioning body further back, away horizontally from anchor of suspension trainer. Harder Movement can be made harder for Erector Spinae, yet easier for Abdominals by positioning body closer under anchor of suspension trainer.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, tricepsbrachii, levatorscapulae, pectoralissternal, trapeziusmiddle, deltoidanterior, trapeziuslower, pectoralisminor, rhomboids",
"synergists": "iliopsoas, hamstrings, sartorius, gluteusmaximus, tensorfasciaelatae, rectusabdominis, obliques",
"target": "erectorspinae"}}