{"HipsSL45LegPress":{"id": "0",
"exerciseid": "SL45LegPress",
"musclegroup": "Hips",
"equipment": "sled",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Sled 45° Leg Press",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on machine with back on padded support. Place feet slightly high on platform. Extend hips and knees. Release dock lever and grasp handles to sides.",
"execution": "Lower sled by flexing hips and knees until knees are just short of complete flexion or until hips are completely flexed. Return by extending knees and hips. Repeat.",
"comments": "Adjust safety brace and back support to accommodate near full range of motion without forcing hips to bend at waist. A wide stance may allow for deeper range of motion as shown. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot. Placing feet slightly high on platform emphasize Gluteus Maximus. Placing feet slightly lower on platform emphasize Quadriceps. See exercise performed on Bilateral Leg Press. Also see Locking Out Knees on Leg Press.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSLAlternating45LegPress":{"id": "1",
"exerciseid": "SLAlternating45LegPress",
"musclegroup": "Hips",
"equipment": "sled",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Sled Alternating 45° Leg Press",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on machine with back on padded support. Place feet slightly high on individual platforms. Grasp handles to sides. Push both platforms away by extending knees and hips so knees are straight. Release dock lever and grasp handles to sides.",
"execution": "Lower one platform toward body by bending knee and hip until knees are just short of complete flexion or until hips are completely flexed. Push platform away by extending knee and hip. Repeat with opposite leg. Continue by alternating between sides.",
"comments": "Adjust safety brace and back support to accommodate near full range of motion without forcing hips to bend at waist. Wide stance may allow for deeper range of motion. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot. Placing feet slightly high on platform emphasize Gluteus Maximus. Placing feet slightly lower on platform emphasize Quadriceps. See exercise performed Bilaterally.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSLSingleLeg45LegPress":{"id": "2",
"exerciseid": "SLSingleLeg45LegPress",
"musclegroup": "Hips",
"equipment": "sled",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Sled Single Leg 45° Leg Press",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on machine with back on padded support. Place one foot high up on platform and other foot on floor below platform. Extend hip and knee. Release dock lever and grasp handles to sides.",
"execution": "Lower sled by bending leg until knee is just short of complete flexion. Return by extending knee and hip. Repeat. Continue with opposite leg.",
"comments": "Adjust safety brace and back support to accommodate near full range of motion without forcing pelvis to bend at waist. Keep knee pointed same direction as foot. Do not allow heel to raise off of platform, pushing with both heel and forefoot.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSLHackPress":{"id": "3",
"exerciseid": "SLHackPress",
"musclegroup": "Hips",
"equipment": "sled",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Sled Hack Press",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on sled with back of hips against back pad. Place feet on platform shoulder width or slightly wider. Extend hips and knees. Release dock lever(s).",
"execution": "Lower sled by flexing hips and knees until either is near complete flexion. Raise sled by extending knees and hips. Repeat.",
"comments": "If available, reengage support lever in extended position before dismounting. If insufficient hip flexibility forces pelvis to pull away from back pad at lower portions of movement, only lower sled just short of spinal articulation. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot. Placing feet slightly high on platform emphasize Gluteus Maximus. Placing feet slightly lower on platform emphasize Quadriceps.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSLLyingLegPress":{"id": "4",
"exerciseid": "SLLyingLegPress",
"musclegroup": "Hips",
"equipment": "sled",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Sled Lying Leg Press",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie supine on platform with shoulders against pad. Place feet slightly high on platform.",
"execution": "Extend hips and knees. Return until hips are completely flexed. Repeat.",
"comments": "Adjust machine to accommodate near full range of motion without forcing hips to rise at waist. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSLLyingLegPressPL":{"id": "5",
"exerciseid": "SLLyingLegPressPL",
"musclegroup": "Hips",
"equipment": "sled",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Sled Lying Leg Press (plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie supine on platform with shoulders against pad. Place feet slightly high on platform. Extend hips and knees. Release dock lever and grasp handles to sides.",
"execution": "Bring sled toward platform by flexing hips and knees until knees are just short of complete flexion or until hips are completely flexed. Return by extending knees and hips. Repeat.",
"comments": "If available, reengage support lever in extended position before dismounting. Allow for full range of motion without forcing hips to rise at waist. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot. Placing feet slightly high on platform emphasize Gluteus Maximus. Placing feet slightly lower on platform emphasize Quadriceps.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSLSingleLegLyingLegPressPL":{"id": "6",
"exerciseid": "SLSingleLegLyingLegPressPL",
"musclegroup": "Hips",
"equipment": "sled",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Sled Single Leg Lying Leg Press (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie supine on platform with shoulders against pad. Place feet slightly high on platform. Prop one leg up, on support if available. Extend hip and knee of leg positioned on platform. Release dock lever and grasp handles to sides if available.",
"execution": "Bring sled toward platform by flexing hip and knee of supporting leg until knee is just short of complete flexion or until hip is completely flexed. Return by extending knee and hip. Repeat. Continue with opposite leg.",
"comments": "If available, reengage support lever in extended position before dismounting. Allow for full range of motion without forcing hips to rise at waist. Keep knee pointed same directions as foot. Do not allow heel to raise off of platform, pushing with both heel and forefoot. Placing foot slightly high on platform emphasizes Gluteus Maximus. Placing foot slightly lower on platform emphasizes Quadriceps.",
"stabilizers": "gluteusmedius, gluteusminimus, quadratuslumborum, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSLSingleLegLyingLegPress":{"id": "7",
"exerciseid": "SLSingleLegLyingLegPress",
"musclegroup": "Hips",
"equipment": "sled",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Sled Single Leg Lying Leg Press",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie supine on platform with shoulders against pad. Place foot slightly high on platform. Position other leg with lower leg parallel to platform.",
"execution": "Push platform by extending knee and hip until knee is straight. Return by bending hip and knee of supporting leg until knee is just short of complete flexion or until hip is completely flexed. Repeat. Continue with opposite leg.",
"comments": "Allow for full range of motion without forcing hips to bend at waist. Keep knee pointed same directions as foot. Do not allow heel to raise off of platform, pushing with both heel and forefoot. Placing foot slightly high on platform emphasizes Gluteus Maximus. Placing foot slightly lower on platform emphasizes Quadriceps.",
"stabilizers": "gluteusmedius, gluteusminimus, quadratuslumborum, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSLSeatedLegPress":{"id": "8",
"exerciseid": "SLSeatedLegPress",
"musclegroup": "Hips",
"equipment": "sled",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Sled Seated Leg Press",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on machine with back on padded support. Place feet slightly high on platform. Grasp handles to sides.",
"execution": "Extend knees and hips until knees are fully extended. Return until hips are completely flexed. Repeat.",
"comments": "Adjust seat and back support to accommodate near full range of motion without forcing hips to bend at waist. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot. Placing feet slightly high on platform emphasize Gluteus Maximus. Placing feet slightly lower on platform emphasize Quadriceps.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSLVerticalLegPress":{"id": "9",
"exerciseid": "SLVerticalLegPress",
"musclegroup": "Hips",
"equipment": "sled",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Sled Vertical Leg Press",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie on declined back pad with hips under weighted sled. Place feet on platform. Raise weight by extending hips and knees. Release dock levers and grasp handles to sides.",
"execution": "Lower sled by flexing hips and knees until knees are just short of complete flexion or just before hips raise up from pad. Return by extending knees and hips. Repeat.",
"comments": "Flexible hip flexion is required for fuller range of motion through knee. Lower weight just short of hips, leaving back support. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot, or center of feet if platform is shorter than length of feet.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSLSingleLegVerticalLegPress":{"id": "10",
"exerciseid": "SLSingleLegVerticalLegPress",
"musclegroup": "Hips",
"equipment": "sled",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Sled Single Leg Vertical Leg Press",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie on declined back pad with hips under weighted sled. Place both feet on platform. Raise weight by extending hips and knees. Place foot down off of foot platform. Release dock levers and grasp handles to sides.",
"execution": "Lower sled by flexing leg until knees are just short of complete flexion or just before hips raise up from pad. Push weight up by extending knee and hip. Repeat and continue with opposite leg.",
"comments": "Reengage support lever in extended position before dismounting. Flexible hip flexion is required for fuller range of motion through knee. Lower weight just short of hips, leaving back support. Keep knees pointed same directions as feet. Do not allow heel to raise off of platform, pushing with both heel and forefoot, or center of foot if platform is shorter than length of feet.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSLKneelingHipExtension":{"id": "11",
"exerciseid": "SLKneelingHipExtension",
"musclegroup": "Hips",
"equipment": "sled",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Sled Kneeling Glute Kickback",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Kneel on machine by placing knees on lower pad and feet against bars to rear, if available. Place forearms on padded arm rest, and grip handles. Position one foot up so middle of sole is positioned under foot bar.",
"execution": "Push foot bar up by extending leg back as far as possible. Return leg to original position and repeat. Continue with opposite leg.",
"comments": "None",
"antagonist stabilizers": "hamstrings, rectusabdominis",
"stabilizers": "gluteusmedius, obliques, gluteusminimus, erectorspinae",
"synergists": "adductors",
"target": "gluteusmaximus"},"HipsSLStandingHipExtension":{"id": "12",
"exerciseid": "SLStandingHipExtension",
"musclegroup": "Hips",
"equipment": "sled",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Sled Standing Glute Kickback",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Straddle sled and place foot on pedal. Place chest on pad and grasp handles.",
"execution": "Push platform back by extending leg back until straight. Return leg to original position. Repeat. Continue with opposite leg.",
"comments": "None",
"antagonist stabilizers": "hamstrings, rectusabdominis",
"stabilizers": "gluteusmedius, obliques, gluteusminimus, erectorspinae",
"synergists": "adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSLRearLunge":{"id": "13",
"exerciseid": "SLRearLunge",
"musclegroup": "Hips",
"equipment": "sled",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Sled Rear Lunge",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Position shoulders under padded bars handles. Place feet under bar or just slightly forward. Straighten legs so weight is lifted. Disengage dock lever(s) if available. Place feet slightly forward.",
"execution": "Step back with one leg while bending supporting leg. Plant forefoot far back on floor. Lower body by flexing knee and hip of supporting leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward supporting leg and return rear leg next to supporting leg. Repeat movement with opposite legs, alternating between sides.",
"comments": "If available, reengage dock lever(s) in extended position before dismounting. Keep torso upright during lunge flexible hip flexors are important. Forward knee should point same direction as foot throughout lunge. A long lunge with feet slightly forward emphasizes Gluteus Maximus short lunge with feet under the bar emphasizes Quadriceps.",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSLSquat":{"id": "14",
"exerciseid": "SLSquat",
"musclegroup": "Hips",
"equipment": "sled",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Sled Squat",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Squat down to place shoulders under padded bars. Lean back against back pad if available. Place feet shoulder width apart, slightly in front of shoulders.",
"execution": "If hand or lever lock is available, disengage weight, squat to lowest position and reengage lock. Lift sled by extending knees and hips until legs are straight. Lower sled by bending knees forward slightly while allowing hips to bend back behind, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Return and repeat.",
"comments": "On apparatuses with hand or lever lock, return sled to very bottom, disengage weight, return sled to midupper position, and reengage weight before stepping out. Some Sled Squat apparatuses have back pads like the one shown, whereas, Sled Squat apparatuses have no back pad requiring additional recruitment of stabilizer muscles. Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSLHackSquat":{"id": "15",
"exerciseid": "SLHackSquat",
"musclegroup": "Hips",
"equipment": "sled",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Sled Hack Squat",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie supine on platform with shoulders against pad. Place feet high up on platform. Extend hips and knees. Release dock levers.",
"execution": "Lower sled by flexing hips and knees until hips are completely flexed. Raise sled by extending knees and hips. Repeat.",
"comments": "If available, reengage support lever in extended position before dismounting. If insufficient hip flexibility forces pelvis to pull away from back pad at lower portions of movement, only lower sled just short of spinal articulation. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot. Placing feet slightly high on platform emphasize Gluteus Maximus. Placing feet slightly lower on platform emphasize Quadriceps.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSLSingleLegHackSquat":{"id": "16",
"exerciseid": "SLSingleLegHackSquat",
"musclegroup": "Hips",
"equipment": "sled",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Sled Single Leg Hack Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie supine on platform with shoulders against pad. Place feet high up on platform. Extend hips and knees. Cross lower leg above knee of supporting leg. Release dock lever(s).",
"execution": "Lower sled by flexing hips and knee of supporting leg until knees are just short of complete flexion. Raise sled by extending knee and hips. Repeat. Continue with opposite leg.",
"comments": "If available, reengage dock lever(s) in extended position before dismounting. Adjust machine to accommodate near full range of motion without forcing pelvis to rise at waist. Keep knee pointed same direction as feet. Do not allow heel to raise off of platform, pushing with both heel and forefoot.",
"stabilizers": "gluteusmedius, gluteusminimus, quadratuslumborum, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"}}