{"ThighsASSingleLegSquatSelf":{"id": "0",
"exerciseid": "ASSingleLegSquatSelf",
"musclegroup": "Thighs",
"equipment": "self-assisted",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Self-assisted Single Leg Squat (bar)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand behind horizontal bar, lower chest to waist height. Place finger tips or inside base of thumbs on bar, hold with just enough contact for balance and selfassistance. Balance on one leg with opposite leg extended straight leg forward as high as possible.",
"execution": "Squat down as far as possible while keeping leg elevated off of floor. Keep back straight and supporting knee pointed same direction as supporting foot. Raise body back up to original position until knee and hip of supporting leg is straight. Repeat and continue with opposite leg.",
"comments": "Supporting knee should point same direction as foot throughout movement. Range of motion will be improved with greater leg strength and glute flexibility. Significant spinal flexion is acceptable form in full range single leg squat. Erector Spinae becomes stabilizer if spine is kept straight. Also known as Selfassisted Pistol Squats. Weighted versions of this exercise would normally be considered auxiliary in context of other basic exercises (ie Barbell Squat, Sled Leg Press). However, in the context of body weight only program, this exercise can be considered basic. The degree of selfassistance required affects the significance of upper body muscles utilized. The style of self assistance (hand positioning, bar height, etc.) used affects which and how the muscle are used. See Pistol Squat with one arm assisting. Easier Grasp bar with firm underhand grip and pull body up with just enough assistance to complete rep. Other slightly easier single leg squats can can also be performed. Leg Raised BackSelfassisted Reclining Single Leg Squats Harder For greater challenge, perform with only one hand for balance or use no assistance. Single Leg Squat with one arm assistingSingle Leg Squat",
"stabilizers": "gluteusmedius, tensorfasciaelatae, iliopsoas, sartorius, gluteusminimus, quadratuslumborum, pectineus, quadriceps, rectusabdominis, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "erectorspinae, soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsASSingleLegSquatSelfPole":{"id": "1",
"exerciseid": "ASSingleLegSquatSelfPole",
"musclegroup": "Thighs",
"equipment": "self-assisted",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Self-assisted Single Leg Reclining Squat (pole)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand with feet behind vertical pole. Grasp pole with both hands, waist to hip height. Balance on one leg with opposite leg raised up off of floor to side of pole.",
"execution": "Squat down while keeping leg elevated off of floor. With arms slightly flexed, lean back slightly while only allowing knee to travel forward slightly. Keep back straight and supporting knee pointed same direction as supporting foot. Descend to lowest position. Raise body back up to original position while keeping knee behind bar and arms slightly flexed until knee and hip of supporting leg is straight. Repeat and continue with opposite leg.",
"comments": "Supporting knee should point same direction as foot throughout movement, yet only extend forward slightly. Range of motion will be improved with greater leg strength and glute flexibility. Spinal flexion near bottom of motion is acceptable form in full range single leg squat. Erector Spinae becomes stabilizer if spine is kept straight. See Side Rear View. Weighted versions of this exercise would normally be considered auxiliary in context of other basic exercises (ie Barbell Squat, Sled Leg Press). However, in the context of body weight only program, this exercise can be considered basic. Also known as Selfassisted Reclining Pistol Squats or Selfassisted Reclining Single Leg Squats. The degree of selfassistance required affects the significance of upper body muscles utilized. Also see Single Leg Reclining Squats (bar). Easier Greater assistance from upper body can make movement easier. Alternatively, other slightly easier exercises can also be performed. Single Leg Split SquatStep DownSelfassisted Single Leg Squat with leg wrapped Harder For slightly greater challenge, perform movement in more upright posture without leaning back. Selfassisted Single Leg Squat (behind horizontal bar)",
"stabilizers": "gluteusmedius, tensorfasciaelatae, iliopsoas, sartorius, gluteusminimus, quadratuslumborum, pectineus, quadriceps, rectusabdominis, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "erectorspinae, soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsASSingleLegSquatSelfLeg":{"id": "2",
"exerciseid": "ASSingleLegSquatSelfLeg",
"musclegroup": "Thighs",
"equipment": "self-assisted",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Self-assisted Single Leg Squat (leg wrapped)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Place hand on waist high prop or other tall, sturdy structure for support. Stand on one leg by wrapping leg around back of supporting leg so top of lifted foot is on outside of supporting legs ankle.",
"execution": "Squat down by bending knee forward and hip back behind. Keep back straight and supporting knee pointed same direction as foot supporting. Descend until thigh is just past parallel to floor. Return to standing position with minimal assistance from wrapped leg. Stand to original position until knee and hip of supporting leg are straight. Return and repeat. Continue with opposite leg.",
"comments": "Supporting knee should point same direction as foot throughout movement. Easier The movement can be made easier by assisting more with wrapped leg. Alternatively, Squats with both legs, Stepups, Lunges, Single Leg Split Squats are other easier movements. Single Leg Split SquatStepupsLunges Harder For greater challenge, do not assist with wrapped leg, raise lower leg up to rear. Single Leg Squat (with leg back)Single Leg Squat (pistol)",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, rectusabdominis, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsASStepDownSelf":{"id": "3",
"exerciseid": "ASStepDownSelf",
"musclegroup": "Thighs",
"equipment": "self-assisted",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Self-assisted Step-down",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand with one foot on bench or elevated surface. Position foot on elevated surface to side slightly forward of straight knee.",
"execution": "Stand on bench by straightening leg and pushing body upward. Step down returning foot off of bench to floor and repeat. Continue with opposite position.",
"comments": "Keep torso upright during exercise. Knee of exercised leg should point same direction as foot. Exercise can also be performed by placing traveling foot onto and off of bench next to foot of exercised leg (See demo). Park bench, picnic table and other elevated surfaces can also be used instead of a bench. Weighted versions of this exercise would normally be considered auxiliary in context of other basic exercises (ie Barbell Squat, Sled Leg Press). However, in the context of body weight only program, this exercise can be considered basic. Easier Besides assisting more with arm, shorter bench or step will make this movement easier. Harder For greater challenge, use taller bench or box, or do not utilize assistance from arm. No Assistance",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gastrocnemius, gluteusmaximus, adductors",
"target": "quadriceps"}}