{"HipsBWLunge":{"id": "0",
"exerciseid": "BWLunge",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lunge",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand with hands on hips or clasped behind neck.",
"execution": "Lunge forward with first leg. Land on heel, then forefoot. Lower body by flexing knee and hip of front leg until knee of rear leg is almost in contact with floor. Return to original standing position by forcibly extending hip and knee of forward leg. Repeat by alternating lunge with opposite leg.",
"comments": "Keep torso upright during lunge flexible hip flexors are important. Lead knee should point same direction as foot throughout lunge. A long lunge emphasizes Gluteus Maximus short lunge emphasizes Quadriceps. Easier For less intensity, perform Split Squat. Harder Exercise can be made more challenging with additional weight. Also consider Stepups. Dumbbell LungeBarbell LungeStepup",
"stabilizers": "gluteusminimus, quadratuslumborum, tibialisanterior, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBWReverseHyperextension":{"id": "1",
"exerciseid": "BWReverseHyperextension",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Reverse Hyper-extension",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Lay torso and waist on bench and grasp handles. Feet should be above floor with legs straight.",
"execution": "Raise legs by extending hips as high as possible until legs are nearly straight. Lower legs to original position. Repeat.",
"comments": "Also see Reverse Hyperextension performed with exercise ball on bench. Easier If knees are bent significantly, hamstrings are not involved. Consider regular hyperextensions or other bodyweight glute exercises. Harder Exercise can be made more challenging with additional weight. Some individuals may be able to articulate both through the hips and through the lower back (i.e. lumbar spine), in which case, Erector Spinae also becomes synergist. Weighted Reverse HyperextensionLever Reverse Hyperextension",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"synergists": "hamstrings",
"target": "gluteusmaximus"},"HipsBWReverseHyperextensionBall":{"id": "2",
"exerciseid": "BWReverseHyperextensionBall",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Reverse Hyper-extension (on stability ball)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Lay prone with waist on stability ball. Grasp secure anchor or bar near floor. Feet should be above floor with legs straight.",
"execution": "Holding firmly on anchor, extend legs upward by lifting and straightening leg as high as possible. Lower legs to original position with thighs close to stability ball. Repeat.",
"comments": "Since knee is initially bent significantly, hamstrings are not significantly involved. Also see Reverse Hyperextension performed with exercise ball on bench. Easier Keep knees bent to make exercise easier. Also consider regular hyperextensions or other bodyweight glute exercises. Hyperextension on BallHyperextension on apparatus Harder Exercise can be made more challenging with additional weight. Some individuals may be able to articulate both through the hips and through the lower back (i.e. lumbar spine), in which case Erector Spinae also becomes synergist. Weighted Reverse HyperextensionLever Reverse Hyperextension",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"target": "gluteusmaximus"},"HipsBWLyingHipExtension":{"id": "3",
"exerciseid": "BWLyingHipExtension",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Single Leg Hip Bridge",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Lie on floor or mat. Place one leg straight and bend the other leg with foot flat on floor or mat. Place arms down on mat to each side of hips.",
"execution": "Raise body by extending hip of bent leg, keeping extended leg and hip straight. Return to original position by lowering body with extended leg and hip straight. Repeat and continue with opposite sides.",
"comments": "Hamstring remains in active insufficiency throughout movement since knee is significantly flexed and hip does not flex beyond 90 degrees. Adductor Magnus does not assist since hip extension does not occur in fully flexed position.",
"stabilizers": "erectorspinae, tensorfasciaelatae, iliopsoas, sartorius, adductors, pectineus, quadriceps, rectusabdominis, obliques",
"target": "gluteusmaximus"},"HipsBWSingleLegSquat":{"id": "4",
"exerciseid": "BWSingleLegSquat",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Single Leg Squat (pistol)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand with arms extended out in front. Balance on one leg with opposite leg extended straight leg forward as high as possible.",
"execution": "Squat down as far as possible while keeping leg elevated off of floor. Keep back as straight as possible and supporting knee pointed same direction as foot supporting. Raise body back up to original position until knee and hip of supporting leg is straight. Repeat and continue with opposite leg.",
"comments": "Supporting knee should point same direction as foot throughout movement. Range of motion will be improved with greater leg strength and glute flexibility. Also known as Pistol Squat. Significant spinal flexion occurs at bottom of deep single leg squat to maintain center of gravity over foot. In which case, Erector Spinae would act as a synergist instead of a stabilizer. Weighted versions of this exercise would normally be considered auxiliary in context of other basic exercises (ie Barbell Squat, Sled Leg Press). However, in the context of body weight only program, this exercise can be considered basic. Easier This exercise is one of the most difficult exercises, even for advanced exercisers. Easier versions of this movement include partial reps or self assistance on horizontal bar, from raised rear leg, or with one leg wrapped behind supporting leg. Alternatively, other less challenging squatting or split squat movements can be performed. Selfassisted Single Leg Squat (bar)Selfassisted Single Leg Squat (leg wrapped)Leg Raised BackSingle Leg Split SquatSingle Leg Box Squat Harder For greater challenge, add resistance withweighted bar or medicine ball, weight plate, dumbbells or squat down into a full single squat position. Barbell Single Leg SquatDumbbell Single Leg SquatWeighted Single Leg Squat",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "gluteusmedius, tensorfasciaelatae, iliopsoas, sartorius, gluteusminimus, quadratuslumborum, erectorspinae, pectineus, quadriceps, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBWSingleLegBoxSquat":{"id": "5",
"exerciseid": "BWSingleLegBoxSquat",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Single Leg Box Squat",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand in front of adjustable height bench or box. Extend arms out in front of body. Balance on one leg with opposite leg extended straight leg forward as high as possible.",
"execution": "Squat down while keeping leg elevated off of floor. Keep back straight and supporting knee pointed same direction as foot supporting. Once bottocks makes contact with bench or box, raise body back up to original position until knee and hip of supporting leg is straight. Repeat and continue with opposite leg.",
"comments": "Allow torso to angle forward more than shown, particularly as greater depth is achieved with lower bench or box. Range of motion will be improved with greater leg strength. Supporting knee should point same direction as foot throughout movement. Weighted versions of this exercise would normally be considered auxiliary in context of other basic exercises (ie Barbell Squat, Sled Leg Press). However, in the context of body weight only program, this exercise can be considered basic. Also known as Bench Pistol Squat or Single Leg Bench Squat. Easier Begin with shorter range of motion using higher bench or box. Alternatively, consider performing easier versions of this movement Single Leg Reclining Squat (bar)Selfassisted Single Leg Squat (bar)Selfassisted Single Leg Squat (leg wrapped)Leg Raised BackSingle Leg Split Squat Harder For greater challenge, use progressively lower bench or box height. As time passes, use no box or bench. Single Leg Squat",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "gluteusmedius, tensorfasciaelatae, iliopsoas, sartorius, gluteusminimus, quadratuslumborum, erectorspinae, pectineus, quadriceps, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBWSingleLegSquatLegBack":{"id": "6",
"exerciseid": "BWSingleLegSquatLegBack",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Single Leg Squat (with leg back)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand with arms extended out in front.",
"execution": "Squat down as far as possible while keeping raised leg from contacting floor as far down as possible. Keep back straight and supporting knee pointed same direction as foot supporting. In lowest position, gently place elevated lower leg on floor. Raise body back up with minimal assistance from raised leg on floor. Stand to original position until knee and hip of supporting leg are straight. Return and repeat. Continue with opposite leg.",
"comments": "Supporting knee should point same direction as foot throughout movement. Range of motion will be improved with greater leg strength and glute flexibility. Quadriceps on raised leg becomes and Synergist if self assistance is provided at bottom of movement. Weighted versions of this exercise would normally be considered auxiliary in context of other basic exercises (ie Barbell Squat, Sled Leg Press). However, in the context of body weight only program, this exercise can be considered basic. Easier This exercise is difficult even for advanced exercisers. The movement can be made easier by assisting slightly with raised lower leg at bottom of movement or selfassisted from horizontal bar or with one leg wrapped behind support leg. Partial Reps could also be utilized. Alternatively, other squatting or split squat movements can can also be performed. Selfassisted Single Leg Squats (bar)Selfassisted Single Leg Squats (leg wrapped)Single Leg Split Squat Harder For greater challenge, do not assist with elevated lower leg or position elevated leg up high in front and attempt to squat deeper. Pistol Squat",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBWSingleLegRecliningSquat":{"id": "7",
"exerciseid": "BWSingleLegRecliningSquat",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Single Leg Reclining Squat (bar)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand behind horizontal bar, lower chest to upper waist height. Grasp bar with both hands. Place feet slightly forward and lean back with arms straight. Balance on one leg with opposite leg extended straight leg forward as high as possible.",
"execution": "While reclining back, squat down as far as possible while keeping leg elevated off of floor. Keep back straight and supporting knee pointed same direction as suppor ting foot. Raise body back up to original position until knee and hip of supporting leg is straight. Repeat and continue with opposite leg.",
"comments": "Supporting knee should point same direction as foot throughout movement. Range of motion will be improved with greater leg strength and glute flexibility. Spine can be kept straighter than standard full range single leg squat. Also known as Reclining Pistol Squats. This exercise would normally be considered auxiliary in context of other basic exercises (ie Barbell Squat, Sled Leg Press). However, in the context of body weight only program, this exercise can be considered basic. Also see Selfassisted Reclining Single Leg Squats (pole) Easier Place feet slightly more forward. Other body weight squat and lunging exercises are generally easier. Single Leg Split SquatStepdownStepupSquat Harder For greater challenge, perform with foot further back. Once more upright try assisted or normal pistol squats. Self Assisted Single Leg SquatSingle Leg Squat",
"stabilizers": "gluteusmedius, tensorfasciaelatae, iliopsoas, sartorius, trapeziusmiddle, gluteusminimus, quadratuslumborum, erectorspinae, pectineus, trapeziuslower, quadriceps, rectusabdominis, rhomboids, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "latissimusdorsi, deltoidposterior, soleus, teresmajor, gluteusmaximus, adductors, pectoralissternal",
"target": "quadriceps"},"HipsBWSplitSquat":{"id": "8",
"exerciseid": "BWSplitSquat",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Split Squat",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand with hands on hips. Position feet far apart one foot forward and other foot behind.",
"execution": "Squat down by flexing knee and hip of front leg. Allow heel of rear foot to rise up while knee of rear leg bends slightly until it almost makes contact with floor. Return to original standing position by extending hip and knee of forward leg. Repeat. Continue with opposite leg.",
"comments": "Knees should point same direction as feet throughout movement. Heel of rear foot can be kept elevated off floor throughout movement as shown. Keep torso upright during squat flexible hip flexors are important. With feet further apart Gluteus Maximus is emphasized, Quadriceps are less emphasized. Weighted versions of this exercise would normally be considered auxiliary in context of other basic exercises (ie Barbell Squat, Sled Leg Press). However, in the context of body weight only program, this exercise can be considered basic. Easier Movement can be made easier by holding onto rails or back of chairs to each side. Harder For greater intensity, perform Lunges or Split Squat. Exercise can also be made more challenging with additional weight. LungesSingle Leg Split SquatDumbbell Split SquatBarbell Split Squat",
"stabilizers": "gluteusmedius, gluteusminimus",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBWSingleLegSplitSquat":{"id": "9",
"exerciseid": "BWSingleLegSplitSquat",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Single Leg Split Squat",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand facing away from bench. Extend leg back and place top of foot on bench.",
"execution": "Squat down by flexing knee and hip of front leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward leg and repeat. Continue with opposite leg.",
"comments": "Keep torso upright during squat flexible hip flexors are important. Forward knee should point same direction as foot throughout movement. May also be referred to as Bodyweight Bulgarian Squat. Weighted versions of this exercise would normally be considered auxiliary in context of other basic exercises (ie Barbell Squat, Sled Leg Press). However, in the context of body weight only program, this exercise can be considered basic. Easier Placing hand on stationary object can assist with balance. Other squatting, split squat, or lunging movements may be easier to perform. Split SquatLunge Harder For greater challenge, add resistance with a barbell or dumbbells or perform Selfassisted Single Leg Squats. BarbellDumbbellSelfassisted Single Leg Squats (bar)Selfassisted Single Leg Squats (leg wrapped)",
"stabilizers": "gluteusmedius, gluteusminimus",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBWSingleLegStiffLegDeadlift":{"id": "10",
"exerciseid": "BWSingleLegStiffLegDeadlift",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Single Leg Stiff-leg Deadlift",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand with feet together and hands just in front of thighs. Lift leg slightly so foot is just off floor.",
"execution": "Lower torso forward and downward while raising lifted leg back behind. Keep back straight and knee of supporting leg slightly bend. Keep hip and knee of lifted leg extended throughout movement. Once stretch is felt or hands contact floor, return to original position by raising torso while lowering lifted leg. Straighten knee of supporting leg as torso becomes upright. Repeat.",
"comments": "Throughout lift, keep arms and back straight. Do not lower weight beyond mild stretch throughout hamstrings. Full range of motion will vary from person to person. Those with less flexibility may need to bend knee of supporting leg more so hands can come closer to floor. At top of movement, lifted foot can make contact with floor to maintain balance between repetitions. Easier Use both legs with light resistance. Barbell Straight Back Stiff Leg Deadlift Harder Use additional resistance. Barbell Single Leg Stiff Leg DeadliftDumbbell Single Leg Stiff Leg Deadlift",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmaximus, gluteusmedius, quadriceps, obliques",
"synergists": "hamstrings, adductors",
"target": "gluteusmaximus"},"HipsBWSquat":{"id": "11",
"exerciseid": "BWSquat",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Squat",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand with arms extended forward.",
"execution": "Squat down by bending hips back while allowing knees to bend forward slightly, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Squat up by extending knees and hips until legs are straight. Return and repeat.",
"comments": "Keep head facing forward, back straight, chest high, and feet flat on surface equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. Arms positioned forward allows torso to be positioned more upright. See Squat Analysis. Easier Movement can be made easier by holding onto rails or back of chairs to each side. Alternatively, exercise can be performed by squatting down only part way. As strength increases, range of motion can be progressively increased. Harder For greater intensity exercise, light weight can be introduced. Alternately slightly more challenging body weight exercises can be performed. Split SquatSingle Leg Split SquatKettlebell Goblet SquatWeighted Front SquatDumbbell SquatBarbell Squat",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBWStepUp":{"id": "13",
"exerciseid": "BWStepUp",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Step-up",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand facing side of bench, step or platform.",
"execution": "Place foot of first leg on bench. Stand on bench by extending hip and knee of first leg and place foot of second leg on bench. Step down with second leg by flexing hip and knee of first leg. Return to original standing position by placing foot of first leg to floor. Repeat first step with opposite leg, alternating first steps between legs.",
"comments": "Keep torso upright during exercise. Lead knee should point same direction as foot throughout movement. Stepping distance from bench emphasizes Gluteus Maximus stepping close to bench emphasizes Quadriceps. Easier Using shorter bench or step will make this movement easier. Step height shown in demonstration clip is quite low and may be appropriate for deconditioned individuals. Harder For greater challenge, use taller bench or box. Barbells and Dumbbells can also provide additional resistance. Barbell StepupDumbbell Stepup",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, levatorscapulae, gluteusmedius, trapeziusmiddle, gluteusminimus, quadratuslumborum, erectorspinae, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gastrocnemius, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBWLateralStepUp":{"id": "14",
"exerciseid": "BWLateralStepUp",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lateral Step-up",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between two benches, one to each side.",
"execution": "Lift leg and place foot on bench to side and forward of straight knee. Stand on bench by straightening leg and pushing body upward. Step down returning feet to original position. Repeat with opposite leg, alternating between legs.",
"comments": "Keep torso upright during exercise. Stepping knee should point same direction as foot. A modest degree of knee rotation occurs during this movement. See Controversial Exercises and Rotary Force in Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gastrocnemius, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBWStepDown":{"id": "15",
"exerciseid": "BWStepDown",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Step-down",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand with one foot on bench or elevated surface. Position foot on elevated surface to side, forward of straight knee.",
"execution": "Stand on bench by straightening leg and pushing body upward. Step down returning foot off of bench to floor and repeat. Continue with opposite position.",
"comments": "Keep torso upright during exercise. Knee of exercised leg should point same direction as foot. See front view. Exercise can also be performed by placing travelling foot onto and off of bench next to foot of exercised leg (See demo). Park bench, picnic table and other elevated surfaces can also be used instead of exercise bench. Weighted versions of this exercise would normally be considered auxiliary in context of other basic exercises (ie Barbell Squat, Sled Leg Press). However, in the context of body weight only program, this exercise can be considered basic. Easier Using shorter bench or step will make this movement easier. Arm can also assist. Selfassisted Stepdown Harder For greater challenge, use taller bench or box. Barbells and Dumbbells can also provide additional resistance. Deep StepdownDumbbell Stepdown",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gastrocnemius, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBWAlternatingStepDown":{"id": "16",
"exerciseid": "BWAlternatingStepDown",
"musclegroup": "Hips",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Alternating Step-down",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand on bench or narrow platform, with feet side by side.",
"execution": "Step down with first foot to side of elevated surface onto floor. Stand back up on elevated surface by straightening upper leg and pushing body upward. Place foot to original position next to opposite foot. Step down and back up with opposite leg in same manner. Repeat by alternating between sides.",
"comments": "Keep torso upright during exercise. Stepping knee should point same direction as foot. A modest degree of knee rotation occurs during this movement. See Controversial Exercises and Rotary Force in Squat Analysis. Easier Using shorter bench or step will make this movement easier. Harder For greater challenge, use taller bench or box. Barbells and Dumbbells can also provide additional resistance in same alternating pattern or one leg at a time. Dumbbell Step Down",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gastrocnemius, adductors, quadriceps",
"target": "gluteusmaximus"}}