{"ThighsKneeling":{"id": "0",
"exerciseid": "Kneeling",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Quadriceps",
"name": "Kneeling Quadriceps Stretch",
"preparation": "Kneel with knee on padded mat and other foot positioned forward. Place hands on knee. Grasp other hand under top of foot.",
"execution": "Drive hip forward and pull foot toward rear end. Hold stretch. Repeat with opposite side.",
"comments": "None.",
"other": "quadriceps",
"target": "quadriceps"},"ThighsPCQuad":{"id": "1",
"exerciseid": "PCQuad",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Quadriceps",
"name": "Lever Quadriceps Stretch",
"preparation": "Flip seat all way back. Stand facing bar with supporting foot slightly forward under, or near apparatus. Grasp handle bars for support. Place top of other foot back on top edge of shin pad.",
"execution": "Squat down with back straight and chest up while positioning hip straight close to back of heel. Hold stretch. Repeat with opposite side.",
"comments": "Rear knee should be completely flexed to keep emphasis on Quadriceps, particularly Rectus Femoris. See Lever Hip Flexor Stretch for similar movement. ",
"other": "quadriceps",
"target": "quadriceps"},"ThighsProneLying":{"id": "2",
"exerciseid": "ProneLying",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Quadriceps",
"name": "Lying (prone) Quadriceps Stretch",
"preparation": "Lie prone on mat or floor. Grasp top ankle or forefoot behind.",
"execution": "Pull ankle or forefoot to rear end. Hold stretch. Repeat with opposite side.",
"comments": "A thickly folded towel can be placed under upper hip if lumbar spine hyperextension would otherwise be uncomfortable. A thickly folded towel can be placed under knee to further stretch Rectus Femoris. Tibialis Anterior can be stretched if ankle is completely Plantar flexed.",
"other": "quadriceps",
"target": "quadriceps"},"ThighsPNFProneLying":{"id": "3",
"exerciseid": "PNFProneLying",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Quadriceps",
"name": "PNF Lying (prone) Quadriceps Stretch",
"preparation": "Instruct participant to lie prone on mat or floor. Straddle participant facing toward feet. Knee beside participant with leg extended over or just above participants hips. Bend participants near knee and place hand under participants upper leg and opposite hand on ankle.",
"execution": "Lift knee and push ankle down toward hip. Hold stretch. Repeat with opposite side.",
"comments": "The opposite leg or thick towel can be placed under participants near knee (and above participants far knee) to further stretch Rectus Femoris. Tibialis Anterior can be stretched if ankle is completely plantar flexed. See PNF stretch techniques. Also see Prone Quadriceps Stretch for similar static stretch.",
"other": "quadriceps",
"target": "quadriceps"},"ThighsSideLying":{"id": "4",
"exerciseid": "SideLying",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Quadriceps",
"name": "Lying (side) Quadriceps Stretch",
"preparation": "Lie on one side. Grasp top ankle or forefoot behind. Pull ankle or forefoot to rear end.",
"execution": "Straighten hip by moving knee backward. Hold stretch. Repeat with opposite side.",
"comments": "During stretch, do not allow knee to flare upward away from floor. If knee is not completely flexed, Iliopsoas wil be stretched more than Quadriceps. Bottom hip and knee can be bent 90 thereby decreasing anterior pelvic tilt so upper leg will not need to be pulled back as far during hip extension. See Lying Tibialis Anterior Stretch for similar exercise which can be combined with this stretch and performed simultaneously.",
"other": "quadriceps",
"target": "quadriceps"},"ThighsStanding":{"id": "5",
"exerciseid": "Standing",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Quadriceps",
"name": "Standing Quadriceps Stretch",
"preparation": "Stand and touch wall or stationary object for balance. Grasp top ankle or forefoot behind. Pull ankle or forefoot to rear end.",
"execution": "Straighten hip by moving knee backward. Hold stretch. Repeat with opposite side.",
"comments": "Alternatively, hip may be initially extended, then ankle can be slowly pulled towards rear end. With either technique, do not allow knee to flare outward to side. If low back is sensitive to hyperextension, hip should be postured in more neutral position than demonstrated. If knee is not completely flexed, Iliopsoas may be stretched Quadriceps will not be stretched significantly. See Standing Tibialis Anterior Stretch for similar exercise which can be combined with this stretch and performed simultaneously. If range of motion prohibits grasping of ankle or foot try Standing Quadriceps Stretch with towel.",
"other": "quadriceps",
"target": "quadriceps"},"ThighsStandingTowel":{"id": "6",
"exerciseid": "StandingTowel",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Quadriceps",
"name": "Standing Quadriceps Stretch (towel)",
"preparation": "With foot on bench or floor place towel around ankle. Grasp both ends of towel behind ankle with closest hand. Stand on opposite leg and touch wall or stationary object with other arm for balance. Pull foot to rear end with towel.",
"execution": "Straighten hip by moving knee backward. Hold stretch. Repeat with opposite side.",
"comments": "Alternatively, hip may be initially extended, then ankle can be slowly pulled towards rear end. With either technique, do not allow knee to flare outward to side. If low back is sensitive to hyperextension, hip should be postured in more neutral position than demonstrated. If knee is not completely flexed Iliopsoas may be stretched Quadriceps will not be stretched significantly. If range of motion permits try Standing Quadriceps Stretch with out towel.",
"other": "quadriceps",
"target": "quadriceps"},"ThighsStandingGroinApparatus":{"id": "7",
"exerciseid": "StandingGroinApparatus",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Quadriceps",
"name": "Standing Quadriceps Stretch (on apparatus)",
"preparation": "Stand facing away from adjustable shelf, hip to upper thigh height. Grasp support for balance. With assistance from other hand, bend over slightly and place foot on shelf behind hip. Grasp supports with both hands and stand upright.",
"execution": "Bend supporting knee slightly while driving hip back closer to heel. Hold stretch. Repeat with opposite side.",
"comments": "Do not allow knee to flare outward to side. If low back is sensitive to hyperextension, hip should be postured in more neutral position than demonstrated by positioning shelf lower and bending supporting knee more. If knee is not completely flexed, Iliopsoas may be stretched Quadriceps will not be stretched significantly. Tibialis Anterior may also be stretched if only top of forefoot is on shelf, as opposed to top of entire foot.",
"other": "quadriceps",
"target": "quadriceps"}}