{"ChestBWChestDip":{"id": "0",
"exerciseid": "BWChestDip",
"musclegroup": "Chest",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Chest Dip",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Mount wide dip bar with oblique grip (bar diagonal under palm), arms straight with shoulders above hands. Bend knees and hips slightly.",
"execution": "Lower body by bending arms, allowing elbows to flare out to sides. When slight stretch is felt in chest or shoulders, push body up until arms are straight. Repeat.",
"comments": "Also see Triceps Dip. Easier To decrease difficulty, get assistance from machine or training partner. Also try performing movement between two benches or self assisted by placing feet on bench or elevation. Between benchesSelfassistedBandassistedMachine assisted Harder Added weight can be placed on dip belt or dumbbell can be placed between ankles to increase intensity. Weighted",
"stabilizers": "trapeziuslower",
"synergists": "latissimusdorsi, pectoralisclavicular, tricepsbrachii, levatorscapulae, teresmajor, deltoidanterior, pectoralisminor, rhomboids",
"target": "pectoralissternal"},"ChestBWPushupKnee":{"id": "1",
"exerciseid": "BWPushupKnee",
"musclegroup": "Chest",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Push-up (on knees)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie prone on floor with hands slightly wider than shoulder width. Bend knees and raise body up off floor by extending arms with body straight.",
"execution": "Keeping body straight and knees bent, lower body to floor by bending arms. Push body up until arms are extended. Repeat.",
"comments": "Both upper and lower body must be kept straight throughout movement. Forefeet can remain on floor as long as body is pivoting on knees.  See close grip pushup. Also see pushup test calculator. Easier Resistance can be reduced by placing hands on horizontal bar or edge of elevated surface (knee to chest high). Incline Pushups Harder For greater challenge, perform standard Pushups. Pushups",
"antagonist stabilizers": "erectorspinae",
"stabilizers": "rectusabdominis, obliques",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "tricepsbrachii, pectoralisclavicular, deltoidanterior",
"target": "pectoralissternal"},"ChestBWInclinePushup":{"id": "2",
"exerciseid": "BWInclinePushup",
"musclegroup": "Chest",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Incline Push-up",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand facing bench or sturdy elevated platform. Place hands on edge of bench or platform, slightly wider than shoulder width. Position forefoot back from bench or platform with arms and body straight. Arms should be perpendicular to body.",
"execution": "Keeping body straight, lower chest to edge of box or platform by bending arms. Push body up until arms are extended. Repeat.",
"comments": "Both upper and lower body must be kept straight throughout movement. Height of bench or platform affects difficulty of movement.  See Gravity Vectors for greater understanding how of body angle influences resistance. Also see movement performed on horizontal bar and close grip pushup. EasierResistance can be reduced by performing exercise on higher bench or elevated platform or between narrow doorway.  Harder Resistance can be increased by performing movement on lower bench or platform or performing standard pushups. Pushups",
"antagonist stabilizers": "erectorspinae",
"stabilizers": "pectoralisminor, soleus, gastrocnemius, quadriceps, serratusanterior, rectusabdominis, obliques",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "tricepsbrachii, pectoralisclavicular, deltoidanterior",
"target": "pectoralissternal"},"ChestBWPushup":{"id": "3",
"exerciseid": "BWPushup",
"musclegroup": "Chest",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Push-up",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie prone on floor with hands slightly wider than shoulder width. Raise body up off floor by extending arms with body straight.",
"execution": "Keeping body straight, lower body to floor by bending arms. Push body up until arms are extended. Repeat.",
"comments": "Both upper and lower body must be kept straight throughout movement. See close grip pushup. Also see pushup test calculator. Easier Resistance can be reduced by performing pushups with knees bent on floor or placing hands on elevated horizontal bar, in between narrow doorway, or edge of elevated surface. Bent kneeElevated Horizontal BarEdge of Box or Bench Harder For greater challenge, push shoulders forward at top of movement, elevate feet, have partner hold weight on back, perform Chest Dips on parallel bars, or plyometric variations for more power. Pushup PlusElevated feetWeighted PushupShoulder Tap PushupAlternating Plyo Pushup (on knees and Bosu)Chest Dip",
"antagonist stabilizers": "erectorspinae",
"stabilizers": "quadriceps, rectusabdominis, obliques",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "tricepsbrachii, pectoralisclavicular, deltoidanterior",
"target": "pectoralissternal"},"ChestBWChestDipBenchesBentKnee":{"id": "4",
"exerciseid": "BWChestDipBenchesBentKnee",
"musclegroup": "Chest",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Chest Dip (bent knees between benches)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between ends of two benches. Place hands on ends of benches with fingers off ends of benches. Position feet out in front with legs bent and torso upright.",
"execution": "Lower body by bending arms, allowing elbows to flare out to sides. When slight stretch is felt in chest or shoulders, push body up until arms are straight. Repeat.",
"comments": "In above clip, hands are positioned at ends of main segments of benches with fingers between gaps. On standard benches, hands should be placed near ends of benches. Perform on higher benches if slight stretch is not felt. Also see Triceps Dip (between benches). Easier Bend knees more to decrease difficulty. Harder Straightening knees will make the exercise more challenging. Straight legs",
"stabilizers": "trapeziuslower",
"synergists": "latissimusdorsi, pectoralisclavicular, tricepsbrachii, levatorscapulae, teresmajor, deltoidanterior, pectoralisminor, rhomboids",
"target": "pectoralissternal"},"ChestBWInclinePushupBar":{"id": "5",
"exerciseid": "BWInclinePushupBar",
"musclegroup": "Chest",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Incline Push-up (on bar)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Grasp horizontal bar (lower than chest height) with hands slightly wider than shoulder width. Position forefeet back from bar with arms and body straight. Arms should be perpendicular to body.",
"execution": "Keeping body straight, lower chest to bar by bending arms. Push body up until arms are extended. Repeat.",
"comments": "Both upper and lower body must be kept straight throughout movement. Height of bar affects difficulty of movement. See Gravity Vectors for greater understanding of how body angle influences resistance.  Also see movement performed on edge of box or bench and close grip pushup. Easier Resistance can be reduced by performing exercise on higher bar or between narrow doorway. Harder Resistance can be increased by lowering bar or eventually performing standard pushups. Pushups",
"antagonist stabilizers": "erectorspinae",
"stabilizers": "pectoralisminor, soleus, gastrocnemius, quadriceps, serratusanterior, rectusabdominis, obliques",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "tricepsbrachii, pectoralisclavicular, deltoidanterior",
"target": "pectoralissternal"},"ChestBWChestDipBenches":{"id": "6",
"exerciseid": "BWChestDipBenches",
"musclegroup": "Chest",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Chest Dip (between benches)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between ends of two benches. Place hands on ends of benches with fingers off ends of benches. Grip should be somewhat wide. Position feet out in front with legs straight, heels on floor, and torso upright.",
"execution": "Lower body by bending arms, allowing elbows to flare out to sides. When slight stretch is felt in chest or shoulders, push body up until arms are straight. Repeat.",
"comments": "In above clip, hands are positioned at ends of main segments of benches with fingers between gaps.  On standard benches, hands should be placed near ends of benches. Perform on higher benches if slight stretch is not felt. Also see Triceps Dip (between benches). Easier Bend knees to decrease difficulty. Bent knees Harder Intensity can be added by placing weight lap or performing Chest Dips on parallel or dip bars. Weighted",
"stabilizers": "trapeziuslower",
"synergists": "latissimusdorsi, pectoralisclavicular, tricepsbrachii, levatorscapulae, teresmajor, deltoidanterior, pectoralisminor, rhomboids",
"target": "pectoralissternal"}}