{"WaistBWSidePlank":{"id": "0",
"exerciseid": "BWSidePlank",
"musclegroup": "Waist",
"equipment": "isometric",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Side Plank",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Lie on side on mat. Place forearm on mat under shoulder perpendicular to body. Place upper leg directly on top of lower leg and straighten knees and hips.",
"execution": "Raise body upward by straightening waist so body is ridged. Hold position. Repeat with opposite side.",
"comments": "Muscles are exercised isometrically. Movement can also be performed dynamically, moving hip up and down, see Side Bridge. Exercise can also be performed with straight supporting arm. Also see Spot Reduction Myth. Easier Exercise can be performed with bent knees. Movement can also be made easier angling body up against wall, horizontal bar or platform. Bent Knee Side Plank Harder Exercise could be made more challenging with added weight on hip, although it is rarely performed in that manner.",
"antagonist stabilizers": "erectorspinae, obliques",
"stabilizers": "latissimusdorsi, gracilis, levatorscapulae, gluteusmedius, tensorfasciaelatae, pectoralissternal, iliopsoas, gluteusminimus, quadratuslumborum, erectorspinae, pectineus, gluteusmaximus, pectoralisminor, adductors",
"target": "obliques"},"WaistBWBentKneeSidePlank":{"id": "1",
"exerciseid": "BWBentKneeSidePlank",
"musclegroup": "Waist",
"equipment": "isometric",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Bent Knee Side Plank",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Lie on side on mat. Place forearm on mat under shoulder perpendicular to body. Bend knees at a right angle. Place upper leg directly on top of lower leg and straighten hips.",
"execution": "Raise body upward by straightening waist so hips and waist are ridged. Hold position. Repeat with opposite side.",
"comments": "Muscles are exercised isometrically. Movement can also be performed dynamically, moving hip up and down, see Bent Knee Side Bridge. Gracilis of upper leg is in active insufficiency with hip extended and knee flexed. Also see Spot Reduction Myth. Easier Movement can be made easier angling body up against wall with legs straight. Harder Exercise can be made more challenging with knees straight. Side Plank",
"antagonist stabilizers": "erectorspinae, obliques",
"stabilizers": "latissimusdorsi, levatorscapulae, gluteusmedius, tensorfasciaelatae, pectoralissternal, iliopsoas, gluteusminimus, quadratuslumborum, erectorspinae, pectineus, gluteusmaximus, pectoralisminor, adductors",
"target": "obliques"}}