{"ThighsLVLegExtension":{"id": "0",
"exerciseid": "LVLegExtension",
"musclegroup": "Thighs",
"equipment": "lever(selectorized)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Leg Extension",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Sit on apparatus with back against padded back support. Place front of lower legs under padded lever. Position knee articulation at same axis as lever fulcrum. Grasp handles to sides for support.",
"execution": "Move lever forward and upward by extending knees until legs are straight. Return lever to original position by bending knees. Repeat.",
"comments": "Stabilizers may be used during heavy resistances to prevent body rising off of seat.",
"stabilizers": "brachialis, trapeziusupper, trapeziusmiddle, levatorscapulae, brachioradialis, bicepsbrachii",
"synergists": "None",
"target": "quadriceps"},"ThighsLVAlternatingLegExtension":{"id": "1",
"exerciseid": "LVAlternatingLegExtension",
"musclegroup": "Thighs",
"equipment": "lever(selectorized)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Alternating Leg Extension",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Sit on apparatus with back against padded back support. Place front of lower legs under padded lever. Position knee articulation at same axis as lever fulcrum. Grasp handles to sides for support.",
"execution": "Move lever forward and upward by extending one knee until leg is straight. Lower to original position. Repeat with opposite leg. Continue to alternate between sides.",
"comments": "Stabilizers may be used during heavy resistances to prevent body rising off of seat.",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle",
"synergists": "None",
"target": "quadriceps"},"ThighsLVAlternatingLegExtensionUnilateral":{"id": "2",
"exerciseid": "LVAlternatingLegExtensionUnilateral",
"musclegroup": "Thighs",
"equipment": "lever(selectorized)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Alternating Leg Extension (unilateral machine)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Sit on apparatus with back against padded back support. Place front of lower legs under padded levers. Position knee articulation at same axis as lever fulcrum. Grasp handles to sides for support.",
"execution": "Move one lever forward and upward by extending one knee until leg is straight. Lower to original position. Repeat with opposite side. Continue to alternate between sides.",
"comments": "Stabilizers may be used during heavy resistances to prevent body from rising off of seat. Also see exercises performed on bilateral machine.",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle",
"synergists": "None",
"target": "quadriceps"},"ThighsLVAlternatingLyingLegPress":{"id": "3",
"exerciseid": "LVAlternatingLyingLegPress",
"musclegroup": "Thighs",
"equipment": "lever(selectorized)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Alternating Lying Leg Press",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie on machine with shoulder under pads. Place feet on individual lever platforms. Grasp handles to sides. Push both lever platforms away by extending knees and hips so knees are straight.",
"execution": "Lower one lever platform toward body by bending knee and hip until weight taps or nearly taps unused portion of weight stack. Push lever platform away by extending knee and hip. Repeat with opposite leg. Continue by alternating between sides.",
"comments": "Adjust bench to accommodate near full range of motion without forcing hips to bend at waist. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot. This exercise may be performed by alternating (as described), simultaneous, or in simultaneousalternating fashion.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVSeatedLegPress":{"id": "4",
"exerciseid": "LVSeatedLegPress",
"musclegroup": "Thighs",
"equipment": "lever(selectorized)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Seated Leg Press",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on machine with back on padded support. Place feet on platform. Grasp handles to sides.",
"execution": "Push platform away by extending knees and hips. Return and repeat.",
"comments": "Adjust seat and back support to accommodate near full range of motion without forcing hips to bend at waist. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot. Placing feet slightly high on platform emphasizes Gluteus Maximus. Placing feet slightly lower on platform emphasizes Quadriceps.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVSingleLegLegPress":{"id": "5",
"exerciseid": "LVSingleLegLegPress",
"musclegroup": "Thighs",
"equipment": "lever(selectorized)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Single Leg Seated Leg Press",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on machine with back on padded support. Place one foot slightly low on platform and other foot on floor below platform.",
"execution": "Push platform away by extending hip and knee. Return by bending leg until knee or hip is just short of complete flexion. Repeat. Continue with opposite leg.",
"comments": "Adjust back support back to accommodate near full range of motion without forcing pelvis to bend at waist. Keep knee pointed same direction as foot. Push with both heel and forefoot and do not allow heel to raise off of platform.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVSquat":{"id": "6",
"exerciseid": "LVSquat",
"musclegroup": "Thighs",
"equipment": "lever(selectorized)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Squat",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Squat down to place shoulders under padded lever. Place feet shoulder width apart directly under shoulders.",
"execution": "Lift lever up by extending knees and hips until legs are straight. Lower lever by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Return and repeat.",
"comments": "Lever height should be adjusted to accommodate full range, allowing hips to descend same height or slightly lower than knees. Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVVSquat":{"id": "7",
"exerciseid": "LVVSquat",
"musclegroup": "Thighs",
"equipment": "lever(selectorized)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever V-Squat",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Position shoulders under shoulder pads with back against back pad. Place feet on platform, shoulder or hip width apart. Squeeze hand lever. Keeping hand lever squeezed, squat down by bending hips and knees until knees or hips are just short of complete flexion. Release hand lever and raise up on sled just slightly until weight stack is engaged (click is heard).",
"execution": "Raise sled by extending knees and hips until legs are straight. Squat down with knees pointed same direction as feet. Descend until knees or hips are near complete flexion. Repeat.",
"comments": "Squeeze hand lever at bottom of movement to disengage weight stack. Keep hand lever squeezed until sled is raised and legs are straight. If insufficient, hip flexibility forces pelvis to pull away from back pad at lower portions of movement, only lower sled just short of spinal articulation. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot. Placing feet slightly forward on platform emphasizes Gluteus Maximus. Placing feet slightly back on platform emphasizes Quadriceps.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVSingleLegVSquat":{"id": "8",
"exerciseid": "LVSingleLegVSquat",
"musclegroup": "Thighs",
"equipment": "lever(selectorized)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Split V-Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Position shoulders under shoulder pads with back against back pad. Place feet on platform, shoulder or hip width apart, slightly back. Squeeze hand lever. Keeping hand lever squeezed, squat down by bending hips and knees until knees or hips are just short of complete flexion. Release hand lever and raise up on sled just slightly until weight stack is engaged (click is heard). Raise sled by extending knees and hips until legs are straight. Place one leg back behind platform with toes pointed downward over floor.",
"execution": "Squat down with knee pointed same direction as foot. Allow leg to bend behind with forefoot on floor. Descend until forward hip is near complete flexion. Raise sled by extending knee and hip until leg is straight. Repeat. Continue with opposite leg.",
"comments": "Squeeze hand lever at bottom of movement to disengage weight stack. Keep hand lever squeezed until sled is raised and leg is straight. If insufficient hip flexibility forces pelvis to pull away from back pad at lower portions of movement, only lower sled just short of spinal articulation. Keep knee pointed same directions as foot. Do not allow heel to raise off of platform, pushing with both heel and forefoot. Placing feet slightly forward on platform emphasizes Gluteus Maximus. Placing feet slightly back on platform emphasizes Quadriceps. See manufacturers suggested foot placement for Lever Split VSquat.",
"stabilizers": "gluteusmedius, gluteusminimus, quadratuslumborum, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVSingleLegSplitVSquat":{"id": "9",
"exerciseid": "LVSingleLegSplitVSquat",
"musclegroup": "Thighs",
"equipment": "lever(selectorized)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Single Leg Split V-Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Position shoulders under shoulder pads with back against back pad. Place one foot slightly forward on platform. Place other foot against rear vertical platform. Squeeze hand lever. Keeping hand lever squeezed, squat down by bending hips and knees until hip or knee is short of complete flexion. Release hand lever and raise up on sled, just slightly until weight stack is engaged (click is heard).",
"execution": "Raise lever by extending knees and hips. Lower lever by flexing hips and knees until knee of rear leg is almost in contact with floor. Repeat. Continue with opposite leg positions.",
"comments": "Squeeze hand lever at bottom of movement to disengage weight stack. Keep hand lever squeezed until sled is raised and legs are straight. Keep knees pointed same directions as feet. Do not allow forward heel to raise off of platform, pushing with both heel and forefoot.",
"stabilizers": "gluteusmedius, gluteusminimus, quadratuslumborum, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVAlternatingSingleLegSplitVSquat":{"id": "10",
"exerciseid": "LVAlternatingSingleLegSplitVSquat",
"musclegroup": "Thighs",
"equipment": "lever(selectorized)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Alternating Single Leg Split V-Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Position shoulders under shoulder pads with back against back pad. Place feet slightly forward on platform. Squeeze hand lever. Keeping hand lever squeezed, squat down by bending hips and knees until hip or knee is short of complete flexion. Release hand lever and raise up on sled just slightly until weight stack is engaged (click is heard). Raise lever by extending knees and hips.",
"execution": "Transfer right foot back to inside of rear vertical platform. Lower lever by flexing hips and knees until knee of rear leg is almost in contact with floor. Raise lever by extending knees and hips until knee is straight. Return right foot to original position by other foot. Repeat with opposite leg movement and continue alternating between sides.",
"comments": "When finished, keep both feet forward and descend lever downward. Squeeze hand lever at bottom of movement to disengage weight stack. Keep hand lever squeezed until sled is raised and legs are straight. Keep knees pointed same directions as feet. Push with both heel and forefoot. Do not allow forward heel to raise off of platform.",
"stabilizers": "gluteusmedius, gluteusminimus, quadratuslumborum, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"}}