{"BackSTInvertedRow":{"id": "0",
"exerciseid": "STInvertedRow",
"musclegroup": "Back",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "BackGeneral",
"name": "Suspended Inverted Row",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Position suspension handles higher than arms length above floor. Sit on floor and grasp handles. Position body supine hanging from handles with arms straight, shoulders under handles, body straight, and back of heels on floor.",
"execution": "Pull body up so sides of chest make contact with handles while keeping body straight. Return until arms are extended straight and shoulders are stretched forward. Repeat.",
"comments": "Fixed bar should be just high enough to allow arm to fully extend. See Gravity Vectors for greater understanding of body angle influences resistance. This exercise can be performed on TRX style suspension trainer or adjustable length gymnastics rings. Also known as Body Row or Supine Row. Easier Resistance can be reduced by raising handles, sitting and bending at hips, or bending at knee with feet flat on floor. Suspended RowSuspended Bentknee Inverted Row Harder This movement can be made more challenging by positioning body in more horizontal position at height of movements. This can be achieved by placing back of heels on elevated surface. This exercise is typically performed without added resistance, although additional weight can be placed on belly or pelvis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "hamstrings, gluteusmaximus, erectorspinae",
"dynamic stabilizers": "bicepsbrachii, tricepsbrachii",
"synergists": "latissimusdorsi, infraspinatus, brachioradialis, pectoralissternal, deltoidposterior, brachialis, trapeziusmiddle, teresmajor, trapeziuslower, teresminor, rhomboids",
"target": "Back, General"},"BackSTBentKneeInvertedRow":{"id": "1",
"exerciseid": "STBentKneeInvertedRow",
"musclegroup": "Back",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "BackGeneral",
"name": "Suspended Bent-knee Inverted Row",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Position suspension handles higher than arms length above floor. Sit on floor and grasp handles. Hang shoulders under handles with arms straight, back and hips straight, with knees bent and feet flat on floor.",
"execution": "Pull body up so sides of chest make contact with handles while keeping body straight. Return until arms are extended straight and shoulders are stretched forward. Repeat.",
"comments": "Handles should be positioned to allow for full arm extension, no lower. Instead of mounting from a seated or lying position, position can be assumed by stepping back with handles grasped in each hand until arms are straight forward. While keeping arms straight and shoulders back, step forward so body reclines back and under suspension handles. Dismounting can be achieved by walking backward until body is upright, minimizing contact with ground. See Gravity Vector for greater understanding of how body angle influences resistance. This exercise can be performed on TRX style suspension trainer or adjustable length gymnastics rings. Also known as Suspended Bentknee Supine Row. Easier Resistance can be reduced by raising handles or sitting on floor and bending at hips. Also consider Suspended Row in most upright position. Harder This movement can be made more challenging by extending legs and pivoting on heels. Inverted Row with legs straight",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "gluteusmaximus, erectorspinae",
"dynamic stabilizers": "bicepsbrachii, tricepsbrachii",
"synergists": "latissimusdorsi, infraspinatus, brachioradialis, pectoralissternal, deltoidposterior, brachialis, trapeziusmiddle, teresmajor, trapeziuslower, teresminor, rhomboids",
"target": "Back, General"},"BackSTPowerPull":{"id": "2",
"exerciseid": "STPowerPull",
"musclegroup": "Back",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "BackGeneral",
"name": "Suspended Power Pull",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Grasp suspension handle(s) with one hand. Step back until handle is chest height when held to side of chest. Facing suspension apparatus with feet shoulder width apart, point other arm and its shoulder forward, parallel with angle of strap.",
"execution": "Rotate body and extended arm, reaching outward while lowering body downward by extending arm holding onto handle. Extend arms and shoulders inline with suspension strap so body is angled back to one side. Return by raising body back upward in opposite motion, reaching outward and toward suspension strap while pulling handle back to side of chest until body is upright and arm parallel with angle of strap. Repeat and continue with opposite side.",
"comments": "This exercise can be performed on TRX style suspension trainer or adjustable length gymnastics rings. Some suspension trainer brands allow independent use of only one handle, whereas, more popular brands require either anchoring unused handle within stirrup of gripped handle or grasping both handles with one hand. External hip rotation is seen in lower swinging hip, whereas, internal hip rotation is observed in upper anchored hip. Muscles rotating hips may arguably be involved in movement, although relative intensity appears to be negligible, particularly since forefeet are not planted firmly on surface in lower position where hips are more rotated, preventing significant torque to be achieved, which suggests hip rotation is largely passive. In contrast, a wide base of support with heels apart allows allows for adequate torque for spinal rotation. However, if hips rotate more than spine, as typically performed and as shown, range of motion through waist quite is limited. An alternative form is to place feet inline, perpendicular to suspension straps with lower foot forward. This turns pelvis 90, stabilizing hip movement so waist can articulate through greater range of motion. Check back for future updates for its possible inclusion into ExRx.net Exercise Directory. Some manuals demonstrate Power Pull with high elbow position on pulling arm. An elbow positioned at height of shoulder would remove lat involvement requiring smaller muscles of upper back (ie rear delt) to be emphasized. Easier Resistance is least when body is positioned upright at top of exercise. Movement can be made easier with staggered foot position by placing foot opposite of gripping hand slightly back. Harder This movement can be made more challenging by placing feet more forward, thereby, angling body back at initiation of movement. In which case, stance can be on heels with forefeet pointing upward. See Gravity Vectors for greater understanding of how body angle influences resistance.",
"antagonist stabilizers": "rectusabdominis",
"stabilizers": "hamstrings, gluteusmaximus, erectorspinae",
"dynamic stabilizers": "bicepsbrachii, tricepsbrachii",
"synergists": "infraspinatus, brachioradialis, pectoralissternal, brachialis, trapeziusmiddle, trapeziuslower, latissimusdorsi, pectoralisclavicular, rhomboids, deltoidposterior, iliopsoas, teresmajor, quadratuslumborum, erectorspinae, teresminor, obliques",
"target": "Back, General"},"BackSTRow":{"id": "3",
"exerciseid": "STRow",
"musclegroup": "Back",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "BackGeneral",
"name": "Suspended Row",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Grasp suspension handles and momentarily step back until arms are extended forward and straight. While keeping arms straight and shoulders back, step forward so body reclines back behind suspension handles. Position body and legs straight at desired angle, hanging from handles with arms straight.",
"execution": "Pull body up so sides of chest make contact with handles while keeping body and legs straight. Return until arms are extended straight and shoulders are stretched forward. Repeat.",
"comments": "At higher angles, feet can be placed flat on floor. When angled further back, only heels may contact floor with forefeet raising upward. Dismounting can be achieved by walking backward until body is upright. This exercise can be performed on TRX style suspension trainer or adjustable length gymnastics rings. Also known as Suspended Body Row. Easier Resistance is least when body is positioned upright at top of exercise. Movement can be made easier with staggered foot position by placing one foot slightly back. Harder This movement can be made more challenging by placing feet more forward, thereby angling body back at initiation of movement. In which case, stance can be on heels with forefeet pointing upward. See Gravity Vectors for greater understanding of how body angle influences resistance. Suspended Inverted Row",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "hamstrings, gluteusmaximus, erectorspinae",
"dynamic stabilizers": "bicepsbrachii, tricepsbrachii",
"synergists": "latissimusdorsi, infraspinatus, brachioradialis, pectoralissternal, deltoidposterior, brachialis, trapeziusmiddle, teresmajor, trapeziuslower, teresminor, rhomboids",
"target": "Back, General"}}