{"UpperArmsBBCurl":{"id": "0",
"exerciseid": "BBCurl",
"musclegroup": "UpperArms",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Biceps",
"name": "Barbell Curl",
"utility": "Basic",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp bar with shoulder width underhand grip.",
"execution": "With elbows to side, raise bar until forearms are vertical. Lower until arms are fully extended. Repeat.",
"comments": "When elbows are fully flexed, they can travel forward slightly allowing forearms to be no more than vertical. This additional movement allows for relative release of tension in muscles between repetitions. Exercise can also be performed with straight barbell. Movement with cambered bar as shown above is also known as EZ Barbell Curl or EZ Bar Curl. Also see mechanical analysis of arm curl and question regarding elbow position.",
"stabilizers": "trapeziusupper, trapeziusmiddle, deltoidanterior, levatorscapulae, wristflexors",
"synergists": "brachialis, brachioradialis",
"target": "bicepsbrachii"},"UpperArmsBBDragCurl":{"id": "1",
"exerciseid": "BBDragCurl",
"musclegroup": "UpperArms",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Biceps",
"name": "Barbell Drag Curl",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp bar with shoulder width underhand grip.",
"execution": "Raise barbell straight up so elbows travel back as elbows flex. Follow contour of hips and waist. As elbows continues to flex, begin bringing elbows forward when forearms rises past horizontal position. Continue upward over chest until forearms are perpendicular. Lower until arms are fully extended. Repeat.",
"comments": "Bringing elbows back forward, allowing forearms to be no more than vertical, permits a relative release of tension in muscles between repetitions. Exercise can also be performed with EZ barbell, in which case, making it also known as EZ Barbell or EZ Bar Drag Curl. Also see standard Barbell Curl.",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, wristflexors",
"synergists": "brachialis, brachioradialis, deltoidposterior, deltoidanterior",
"target": "bicepsbrachii"}}