{"HipsCBLyingHipExternalRotation":{"id": "0",
"exerciseid": "CBLyingHipExternalRotation",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "HipExternalRotator",
"name": "Cable Lying Hip External Rotation",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Attach cable ankle cuff to ankle, nearest low pulley. Lie prone with legs slightly apart and knee of attached leg bent 90. Adjust position of legs slightly away from cable pulley so slight stretch is felt in hip.",
"execution": "Keeping knee of attached leg bent approximately 90, pull cable attachment toward opposite knee by rotating hip. Return until slight stretch is felt in hip, then repeat. Place ankle cuff on opposite leg and continue lying opposite direction.",
"comments": "Exercise name is somewhat counterintuitive since direction of rotation is relative to movement of hip, or thigh, not bent leg. For example, in this exercises, external rotation of hip causes front of thigh to turn outward despite bent leg moving inward. Incidentally if knee were straight during external rotation of thigh, foot would move outward.",
"stabilizers": "adductors, obliques",
"synergists": "hipexernalrotators",
"target": "Hip External Rotators (listed below)"},"HipsCBSeatedHipExternalRotation":{"id": "1",
"exerciseid": "CBSeatedHipExternalRotation",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "HipExternalRotator",
"name": "Cable Seated Hip External Rotation",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on bench or chair with low pulley to side. Attach cable ankle cuff to ankle, nearest pulley. Place far stationary foot slightly forward. Grasp lower thigh of leg with attached cuff, position it along side thigh of stationary leg while keeping foot slightly above floo r.",
"execution": "Keeping knee of attached leg bent approximately 90, pull cable attachment under thigh of stationary leg by rotating hip. Return until slight stretch is felt in hip, then repeat. Place ankle cuff on opposite leg and continue facing opposite direction.",
"comments": "Height of knee on exercising leg may require subtle adjustment during movement to permit clearance of traveling foot above floor. Gluteus Maximus will be activated as stabilizer on heavier loads when participant pushes stationary foot onto floor thereby anchoring lower body as hip adductors keep thighs together. Upper body muscles can also assist in keeping thigh of exercising leg along side stationary leg. Exercise name is somewhat counterintuitive since direction of rotation is relative to movement of hip, or thigh, not bent leg. For example, in this exercises, external rotation of hip causes front of thigh to turn outward despite bent leg moving inward. Incidentally if knee were straight during external rotation of thigh, foot would move outward.",
"stabilizers": "hipexernalrotators, gluteusmedius, gluteusmaximus, gluteusminimus",
"synergists": "hipexernalrotators",
"target": "Hip External Rotators (listed below)"}}