{"CalvesLV45ReverseCalfPress":{"id": "0",
"exerciseid": "LV45ReverseCalfPress",
"musclegroup": "Calves",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "TibialisAnterior",
"name": "Lever 45° Reverse Calf Press (plate loaded)",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on seat with back on padded support. Place feet very high on platform, grasp handles to sides, and extend knees.",
"execution": "Pull forefoot back toward body as far as possible while pushing platform with heels. Return feet down to platform and repeat.",
"comments": "Feet may be moved up higher on platform if bottom of forefoot can still remain on platform with knees straight and back of hips can remain on back pad. The angle of back pad may be lowered back to keep back of hips on lower portion of back pad. Keep knees straight throughout exercise. See Dorsal Flexor Calf Exercise Analyses.",
"stabilizers": "No significant stabilizers",
"synergists": "None",
"target": "tibialisanterior"},"CalvesLV45ReverseCalfRaise":{"id": "1",
"exerciseid": "LV45ReverseCalfRaise",
"musclegroup": "Calves",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "TibialisAnterior",
"name": "Lever 45° Reverse Calf Raise (plate loaded)",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on machine with lower back against padding. Grasp handles to sides and place feet on top portion of platform. Straighten knees and position heels on top edge of platform.",
"execution": "Pull forefoot of both feet up and back toward body as far as possible. Return by extending feet return to platform. Repeat.",
"comments": "When finished, engage dock lever (if it automatically disengaged), and lower seat to original position. Feet should be place highest position that still allows forefeet to make contact with platform. Keep knees straight throughout exercise. Exercise is performed on apparatus design to perform Hack Press. Also see similar movement performed on Sled Donkey Calf Machine. See Dorsal Flexor Calf Exercise Analyses.",
"stabilizers": "No significant stabilizers",
"synergists": "None",
"target": "tibialisanterior"},"CalvesLVReverseCalfRaisePL":{"id": "2",
"exerciseid": "LVReverseCalfRaisePL",
"musclegroup": "Calves",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "TibialisAnterior",
"name": "Lever Reverse Calf Raise (plate loaded)",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Place shoulders under padded lever. Stand erect by extending hips and knees. Position heels on forward edge of platform placed under padded lever. Grasp handles or sides of padded lever.",
"execution": "Pull forefoot of both feet up toward body as far as possible. Return by extending feet until toes are pointed downward. Repeat.",
"comments": "Keep knees and hips straight throughout exercise. The exercise can be made more difficult by positioning heels closer to edge of platform as well as adding weight. See Dorsal Flexor Calf Exercise Analyses.",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle",
"synergists": "None",
"target": "tibialisanterior"},"CalvesLVReverseVCalfRaiseH":{"id": "3",
"exerciseid": "LVReverseVCalfRaiseH",
"musclegroup": "Calves",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "TibialisAnterior",
"name": "Lever Reverse Calf Raise (on v-squat machine, plate loaded)",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Position shoulders under shoulder pads with back against back pad. Position feet far forward on platform. Grasp handles or sides of padded lever.",
"execution": "Pull forefeet up toward body as far as possible. Return by extending feet until toes are pointed downward. Repeat.",
"comments": "Feet may be moved up higher on platform if bottom of forefoot can still contact platform with knees straight. Bring feet no further forward than back half of feet remaining on platform. Keep knees and hips straight throughout exercise. See Dorsal Flexor Calf Exercise Analyses.",
"synergists": "None",
"target": "tibialisanterior"},"CalvesLVSeatedReverseCalfExtHammer":{"id": "4",
"exerciseid": "LVSeatedReverseCalfExtHammer",
"musclegroup": "Calves",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "TibialisAnterior",
"name": "Lever Reverse Calf Extension (plate loaded)",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on seat and position heels on lever platform with fore feet extended off top. Grasp handles to sides and straighten knees.",
"execution": "Pull forefoot back toward body as far as possible while pushing platform with heels. Return feet down to platform and repeat.",
"comments": "Care must be taken to avoid heels from slipping off platform. Begin with very light weight to insure shoes have adequate traction. Keep knees straight throughout exercise. See Dorsal Flexor Calf Exercise Analyses.",
"stabilizers": "No significant stabilizers",
"synergists": "None",
"target": "tibialisanterior"},"CalvesLVSeatedTibiaRaisePL":{"id": "5",
"exerciseid": "LVSeatedTibiaRaisePL",
"musclegroup": "Calves",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "TibialisAnterior",
"name": "Lever Seated Tibia Raise (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on bench or stool. Place both feet under padded lever with heels on pedal.",
"execution": "Lift forefeet upward as far as possible. Return by extending feet until toes are pointed downward. Repeat.",
"comments": "Avoid using other muscles to push pedal down with heels as lever is lifted. Insure full range of motion is practiced. In starting lower position, scoot back on bench just slightly until full planter flexion is felt. Establish range of motion criteria for highest position. See Dorsal Flexor Calf Exercise Analyses.",
"stabilizers": "No significant stabilizers",
"synergists": "None",
"target": "tibialisanterior"},"CalvesLVSingleLegSeatedSeatedTibiaRaisePL":{"id": "6",
"exerciseid": "LVSingleLegSeatedSeatedTibiaRaisePL",
"musclegroup": "Calves",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "TibialisAnterior",
"name": "Lever Single Leg Seated Tibia Raise (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on bench or stool. Place foot under padded lever with heel on pedal and other foot off to side.",
"execution": "Lift forefoot upward as far as possible. Return by extending foot until toes are pointed downward. Repeat.",
"comments": "Avoid using other muscles to push pedal down with heel as lever is lifted. Insure full range of motion is practiced. In starting lower position, scoot back on bench just slightly until full planter flexion is felt. Establish range of motion criteria for highest position. See Dorsal Flexor Calf Exercise Analyses.",
"stabilizers": "No significant stabilizers",
"synergists": "None",
"target": "tibialisanterior"},"CalvesLVStandingTibiaRaisePL":{"id": "7",
"exerciseid": "LVStandingTibiaRaisePL",
"musclegroup": "Calves",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "TibialisAnterior",
"name": "Lever Standing Tibia Raise (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Standing behind machine hold on to support for balance. Place foot under padded lever with heel on pedal.",
"execution": "Lift forefoot upward as far as possible. Return by extending foot until toes are pointed downward. Repeat.",
"comments": "Avoid pushing pedal down with heel as lever is lifted. Insure full range of motion is practiced. In starting lower position, lean back slightly until full planter flexion is felt. Establish range of motion criteria for highest position. Also see close up view. See Dorsal Flexor Calf Exercise Analyses.",
"stabilizers": "No significant stabilizers",
"synergists": "None",
"target": "tibialisanterior"}}