{"WaistBWHyperextensionBall":{"id": "0",
"exerciseid": "BWHyperextensionBall",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Back Extension (on stability ball, arms down)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie prone on ball with feet against base of wall. Place arms to sides or clasp hands behind hips.",
"execution": "Raise torso off of ball by hyperextending spine. Return torso to ball and repeat.",
"comments": "If no wall is available, hips can be positioned lower on ball and toes can be positioned out wide on floor for balance. Easier Movement can be made easier by positioning hips low on ball. Harder Exercise can be made more challenging by positioning ball lower toward hips or positioning hands behind head or arms to sides of head. See Arm Position During Waist Exercises. Arms Crossed",
"stabilizers": "splenius",
"synergists": "None",
"target": "erectorspinae"},"WaistBWHyperextensionBallArmsCrossed":{"id": "1",
"exerciseid": "BWHyperextensionBallArmsCrossed",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Back Extension (on stability ball, arms crossed)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie prone on ball, with front of feet apart on floor or with feet against base of wall. Cross arms, hands in front of shoulders.",
"execution": "Raise torso off of ball by hyperextending spine. Return torso to ball and repeat.",
"comments": "If no wall is available, hips can be positioned lower on ball and toes can be positioned out wide on floor for balance. Easier Movement can be made easier by placing hands behind hips or positioning hips low on ball. Hyperextension on Ball (arms down) Harder Exercise can be made more challenging by positioning ball lower toward hips or positioning hands behind head or arms to sides of head. See Arm Position During Waist Exercises. Exercise is also more challenging on hyperextension apparatus. Arms Up",
"stabilizers": "splenius",
"synergists": "None",
"target": "erectorspinae"},"WaistBWHyperextensionBallArmsUp":{"id": "2",
"exerciseid": "BWHyperextensionBallArmsUp",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Back Extension (on stability ball, arms up)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie prone on ball with feet against base of wall. Place arms parallel out over floor beyond head.",
"execution": "Raise torso off of ball and hands over head by hyperextending spine. Return torso to ball and hands toward floor. Repeat.",
"comments": "If no wall is available, hips can be positioned lower on ball and toes can be positioned out wide on floor for balance. Easier Movement can be made easier by positioning hips low on ball and by placing arms lower. See Arm Position During Waist Exercises. Arms Crossed Harder Exercise can be made more challenging by positioning ball lower toward hips or by adding weight. Exercise is also more challenging on hyperextension apparatus. Weighted Hyperextension on Ball",
"stabilizers": "trapeziusmiddle, splenius, deltoidlateral, deltoidanterior, trapeziuslower",
"synergists": "None",
"target": "erectorspinae"},"WaistBWBirdDog":{"id": "3",
"exerciseid": "BWBirdDog",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Bird Dog",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Kneel on mat on all fours with legs and hands slightly apart.",
"execution": "Raise arm out straight beside head while raising and extending leg on opposite side up out behind body. Lower arm and leg to floor to original position and repeat. Perform movement with opposite arm and leg.",
"comments": "Lift leg and arm deliberately with no jerking. Also see Alternating Bird Dog.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "hipexernalrotators, gluteusminimus, pectoralisclavicular, tricepsbrachii, gluteusmedius, serratusanterior, pectoralissternal",
"dynamic stabilizers": "hamstrings",
"synergists": "trapeziusmiddle, gluteusmaximus, deltoidlateral, deltoidanterior, trapeziuslower",
"target": "erectorspinae"},"WaistBWAlternatingBirdDog":{"id": "4",
"exerciseid": "BWAlternatingBirdDog",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Alternating Bird Dog",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Kneel on mat on all fours with legs and hands slightly apart.",
"execution": "Raise left arm out straight beside head while raising and extending right leg up out behind body. Lower arm and leg to floor to original position. Repeat by raising and lowering right arm and left leg in same manner. Repeat by alternating between opposite sides.",
"comments": "Lift legs and arms deliberately with no jerking. Also see Bird Dog.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "hipexernalrotators, gluteusminimus, pectoralisclavicular, tricepsbrachii, gluteusmedius, serratusanterior, pectoralissternal",
"dynamic stabilizers": "hamstrings",
"synergists": "trapeziusmiddle, gluteusmaximus, deltoidlateral, deltoidanterior, trapeziuslower",
"target": "erectorspinae"},"WaistBWBirdDogExBall":{"id": "5",
"exerciseid": "BWBirdDogExBall",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Bird Dog (on stability ball)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lay on top of exercise ball with legs and hands slightly apart. Place chest down so torso is wrapped over ball.",
"execution": "Raise arm and torso upward beside head while raising leg on opposite side up out behind body. Lower arm, torso, and leg to original position and repeat. Perform movement with opposite arm and leg.",
"comments": "Lift leg and arm deliberately with no jerking. Also see Alternating Bird Dog (one exercise ball). Easier Movement can be made easier by positioning body a bit lower on ball. Harder Exercise can be made more challenging by positioning ball lower toward hips or place supporting arm further away from ball.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "serratusanterior, pectoralissternal, pectoralisclavicular, tricepsbrachii",
"synergists": "hamstrings, trapeziusmiddle, gluteusmaximus, deltoidlateral, deltoidanterior, trapeziuslower",
"target": "erectorspinae"},"WaistBWAlternatingBirdDogExBall":{"id": "6",
"exerciseid": "BWAlternatingBirdDogExBall",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Alternating Bird Dog (on exercise ball)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lay on top of exercise ball with legs and hands slightly apart. Place chest down so torso is wrapped over ball.",
"execution": "Raise left arm and torso upward beside head while raising right leg up behind body. Lower arm, torso, and leg to original position and repeat. Repeat by raising and lowering right arm and left leg in same manner. Repeat by alternating between opposite sides.",
"comments": "Lift leg and arm deliberately with no jerking. Also see Bird Dog (on exercise ball). Easier Movement can be made easier by positioning body a bit lower on ball. Harder Exercise can be made more challenging by positioning ball lower toward hips or place supporting arm further away from ball.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "serratusanterior, pectoralissternal, pectoralisclavicular, tricepsbrachii",
"synergists": "hamstrings, trapeziusmiddle, gluteusmaximus, deltoidlateral, deltoidanterior, trapeziuslower",
"target": "erectorspinae"},"WaistBWHangingHyperextension":{"id": "7",
"exerciseid": "BWHangingHyperextension",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Hanging Hyperextension",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand behind bar facing elevated platform positioned slightly away on other side of bar. Grasp bar with slightly wider than shoulder width grip. Walk body under bar and position back of heels on elevated platform. With legs extended forward, hang under bar with arms straight and hips bent just above floor.",
"execution": "Raise hips up as high as possible by extending hips and spine. Lower hips to original position just above floor. Repeat.",
"comments": "Platform should be high enough to allow hips to flex without buttocks contacting floor. Full range of motion will vary from person to person. Adductor Magnus may only assist at initial phase hip extension depending on degree of hip flexion at bottom of movement. Also see Hanging Hamstring Bridge for Hamstrings. Easier Movement can be made easier by positioning bar higher. Harder Exercise is most difficult when bar is positioned in lower position, yet not allowing bottocks to contact floor while platform is elevated up to the point where hips travel more vertical. Performing movement with only one leg will greatly increase difficulty. Single Leg Hanging Hamstring Bridge",
"stabilizers": "trapeziuslower, trapeziusmiddle, rhomboids",
"synergists": "latissimusdorsi, tricepsbrachii, levatorscapulae, pectoralissternal, deltoidposterior, hamstrings, gluteusmaximus, teresmajor, adductors, pectoralisminor, rhomboids",
"target": "erectorspinae"},"WaistBWHyperextensionHead":{"id": "8",
"exerciseid": "BWHyperextensionHead",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Hyperextension",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Position thighs prone on large pad and lower legs under padded brace. Place hands behind neck or to sides of head.",
"execution": "Raise upper body until hips and waist are fully extended. Lower body by bending hips and waist until fully flexed. Repeat.",
"comments": "Adjust lower leg brace so pressure is evenly distributed on thigh pad. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings and low back. Full range of motion will vary from person to person. Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. If hands are positioned behind head, neck extensors act as stabilizers SpleniusErector SpinaeLevator Scapulae Easier Movement can be made easier by crossing arms on chest. See Arm Position During Waist Exercises. Hyperextension (arms crossed) Harder Begin with body weight and add additional weight gradually to allow lower back adequate adaptation. Exercise can be made more challenging by using additional weight or positioning hands further up on head, or even overhead. Weighted Hyperextension",
"stabilizers": "See comments",
"synergists": "hamstrings, gluteusmaximus, adductors",
"target": "erectorspinae"},"WaistBWHyperextensionX":{"id": "9",
"exerciseid": "BWHyperextensionX",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Hyperextension (arms crossed)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Position thighs prone on large pad and lower legs under padded brace. Cross arms on chest.",
"execution": "Raise upper body until hips and waist are fully extended. Lower body by bending hips and waist until fully flexed. Repeat.",
"comments": "Adjust lower leg brace so pressure is evenly distributed on thigh pad. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings and low back. Full range of motion will vary from person to person. Easier Movement can be made easier by placing hands lower on chest or positioning hands behind hips. See Arm Position During Waist Exercises. Hyperextension (hands behind hips) Harder Exercise can be made more challenging by positioning hands higher on shoulders, behind neck, or to sides of head. Hyperextension (hands behind neck)",
"stabilizers": "See comments",
"synergists": "hamstrings, gluteusmaximus, adductors",
"target": "erectorspinae"},"WaistBWHyperextensionHips":{"id": "10",
"exerciseid": "BWHyperextensionHips",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Hyperextension (hands behind hips)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Position thighs prone on large pad and lower legs under padded brace. Clasp hands behind hips.",
"execution": "Raise upper body until hips and waist are fully extended. Lower body by bending hips and waist until fully flexed. Repeat.",
"comments": "Adjust lower leg brace so pressure is evenly distributed on thigh pad. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings and low back. Full range of motion will vary from person to person. Easier Movement can be made easier by performing exercise on exercise ball and somewhat easier on 45 hyperextension apparatus. Hyperextension on Ball Harder Exercise can be made more challenging by crossing arms on chest. See Arm Position During Waist Exercises. Hyperextension (arms crossed)",
"synergists": "hamstrings, gluteusmaximus, adductors",
"target": "erectorspinae"},"WaistSuperman":{"id": "11",
"exerciseid": "Superman",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Superman",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie prone on mat with legs together and arms extended out on floor approximately parallel.",
"execution": "Slowly raise upper body and legs off floor. Return upper body and legs to floor and repeat.",
"comments": "Lift legs and upper body slowly with no jerking or fast movements. Also see Contralateral Superman.",
"stabilizers": "trapeziusmiddle, splenius, deltoidlateral, deltoidanterior, trapeziuslower",
"synergists": "hamstrings, gluteusmaximus",
"target": "erectorspinae"},"WaistContraLateralSuperman":{"id": "12",
"exerciseid": "ContraLateralSuperman",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Contralateral Superman",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie prone on mat with legs together and arms extended out on floor approximately parallel.",
"execution": "Raise left arm and shoulder and right leg up off floor. Lower arm and shoulder and leg to floor. Repeat by raising and lowering right arm and shoulder and left leg. Repeat by alternating between opposite sides.",
"comments": "Lift legs and arms deliberately with no jerking. Also see bilateral movement Superman.",
"stabilizers": "splenius, deltoidlateral, deltoidanterior",
"synergists": "trapeziuslower, hamstrings, trapeziusmiddle, gluteusmaximus",
"target": "erectorspinae"}}