{"HipsCBAssistedKneelingWheelRollout":{"id": "0",
"exerciseid": "CBAssistedKneelingWheelRollout",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Cable Assisted Wheel Rollout",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "With ab wheel attached to cable via double looped strap attachment, straddle cable facing away from low pulley. Kneel with both knees on mat. Grasp handles on wheel to each side with overhand grip. Position wheel near front of knees and lean over wheel with arms extended downward, supporting upper body.",
"execution": "With arms straight, roll wheel out as far as possible. Lower body gently to floor extending arms forward. Raise body back up by flexing hips and pulling arms back to original position. Return until hips are extended. Repeat.",
"comments": "Keep elbows straight or nearly straight throughout exercise. Exercise can be performed without assistance. Rectus Abdominis and Obliques practically contract isometrically since little waist flexion occurs under resistance. With no waist flexion, Rectus Abdominis and External Oblique act to stabilize pelvis and waist during hip flexion. See target muscle of rollout question. Also see Spot Reduction Myth and Lower Ab Myth.",
"antagonist stabilizers": "erectorspinae",
"dynamic stabilizers": "quadriceps",
"stabilizers": "pectoralisclavicular, tricepsbrachii, wristflexors, rectusabdominis, obliques",
"synergists": "latissimusdorsi, tensorfasciaelatae, pectoralissternal, sartorius, deltoidposterior, teresmajor, adductors, pectineus, pectoralisminor, rhomboids",
"target": "iliopsoas"},"HipsCBLyingLegRaise":{"id": "1",
"exerciseid": "CBLyingLegRaise",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Cable Lying Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Attach cable ankle straps to both ankles, then attach ankle straps to cable. Lie supine on floor or mat, back far enough so cable is taut. Grasp support behind head.",
"execution": "Raise legs by flexing hips and knees until thighs are just past perpendicular to torso or before hips raise off of bench. Return until hips and knees are extended. Repeat.",
"comments": "Exercise can be performed on bench. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible see Cable Lying LegHip Raise. Knees may be kept extended throughout leg raise to increase intensity see Cable Lying Straight Leg Raise. Also see Spot Reduction Myth and Lower Ab Myth.",
"dynamic stabilizers": "quadriceps",
"stabilizers": "rectusabdominis, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsCBLyingLegRaiseBench":{"id": "2",
"exerciseid": "CBLyingLegRaiseBench",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Cable Lying Leg Raise (on bench)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Attach cable ankle straps to both ankles. Sit on end of bench facing pulley at bench height. Attach cable to both ankle straps. Lie supine on bench until cable is taut. Grasp sides of bench behind head.",
"execution": "Raise legs by flexing hips and knees until thighs are past perpendicular to torso or before hips raise off of bench. Return until hips and knees are extended. Repeat.",
"comments": "Training partner or trainer may need to assist attaching ankle cuffs to cable. Ankle cuffs may also be attached to cable pulley in lowest position when feet are on floor, but assistance may be needed to raise pulley to bench height. Cable Lying Leg Raise on floor is easier to set up. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible see Cable Lying LegHip Raise on Bench. Knees may be kept extended throughout leg raise to increase intensity see Cable Lying Straight Leg Raise. Also see Spot Reduction Myth and Lower Ab Myth.",
"dynamic stabilizers": "quadriceps",
"stabilizers": "rectusabdominis, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsCBLyingStraightLegRaise":{"id": "3",
"exerciseid": "CBLyingStraightLegRaise",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Cable Lying Straight Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Attach cable ankle straps to both ankles, then attach ankle straps to cable. Lie supine on floor, mat, or bench back far enough so cable is taut. Grasp support behind head.",
"execution": "With knees straight, raise legs by flexing hips until thighs are just past perpendicular to torso or before hips raise off of mat. Return until hips are extended. Repeat.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible see Cable Lying LegHip Raise. Knees can flex along with hips to decrease intensity see Cable Lying Leg Raise. Also see Spot Reduction Myth and Lower Ab Myth.",
"stabilizers": "rectusabdominis, obliques",
"synergists": "sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps",
"target": "iliopsoas"},"HipsCBStandingLegRaise":{"id": "4",
"exerciseid": "CBStandingLegRaise",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Cable Standing Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Attach cable ankle cuff to one ankle. Stand facing away from low pulley. Step forward with opposite leg so leg with cuff is pulled back. Grasp lateral bars or other prop for support.",
"execution": "Raise knee by flexing hip while allowing lower leg to bend back under resistance. When thigh is just beyond horizontal, lower leg until hip and knee is extended. Repeat. Continue with opposite leg.",
"comments": "See Spot Reduction Myth and Lower Ab Myth.",
"dynamic stabilizers": "quadriceps",
"stabilizers": "gluteusminimus, quadratuslumborum, gluteusmedius, rectusabdominis, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsCBStandingStraightLegRaise":{"id": "5",
"exerciseid": "CBStandingStraightLegRaise",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Cable Standing Straight Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand facing away from low pulley. Place foot in cable boot or foot harness. Grasp lateral bars or other prop for support. Stand forward on free leg, allowing leg attached to cable to be pulled back.",
"execution": "Raise leg upward by flexing hip while keeping knee straight. Raise leg as high as possible. Lower leg to original starting position. Repeat. Continue with opposite leg.",
"comments": "Since knee of moving leg is straight and waist flexion is impeded by standing leg, range of motion will be limit to hamstring flexibility. See Spot Reduction Myth and Lower Ab Myth.",
"stabilizers": "gluteusminimus, quadratuslumborum, gluteusmedius, rectusabdominis, obliques",
"synergists": "sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps",
"target": "iliopsoas"}}