{"BackDBInternalRotation":{"id": "0",
"exerciseid": "DBInternalRotation",
"musclegroup": "Back",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Subscapularis",
"name": "Dumbbell Shoulder Internal Rotation (on bench)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Hold dumbbell in one hand. Lie on bench close to edge on side with dumbbell in hand. Position elbow on edge of bench against side of body with elbow bent approximately 90. Position legs on bench for support.",
"execution": "Maintaining 90 bend in elbow, lower dumbbell away from body until slight stretch is felt in shoulder. Lift dumbbell toward body by internally rotating shoulder until forearm is across belly. Continue with opposite arm.",
"comments": "Maintain elbows bend and position at edge of bench against side of body throughout exercise. Elbow can be held with opposite hand for additional support.",
"stabilizers": "wristflexors",
"synergists": "latissimusdorsi, teresmajor, pectoralisclavicular, deltoidanterior, pectoralissternal",
"target": "subscapularis"},"BackDBInternalRotationFloor":{"id": "1",
"exerciseid": "DBInternalRotationFloor",
"musclegroup": "Back",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Subscapularis",
"name": "Dumbbell Shoulder Internal Rotation (on floor)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Hold dumbbell in one hand. Lie on mat with dumbbell in hand. Position upper arm on mat close to body. Bend elbow approximately 90 with dumbbell held upright above elbow.",
"execution": "Maintaining 90 bend in elbow, lower dumbbell toward floor until slight stretch is felt in shoulder. Lift dumbbell toward body by internally rotating shoulder until forearm is vertical and repeat. Continue with opposite arm.",
"comments": "Torso can lean back slightly allowing for fuller range of motion at the bottom of movement. In which case, forearm does not need to travel any closer than vertical toward body. Elbow can be held with opposite hand for additional support.",
"stabilizers": "wristflexors",
"synergists": "latissimusdorsi, teresmajor, pectoralisclavicular, deltoidanterior, pectoralissternal",
"target": "subscapularis"}}