{"NeckWtLyingNeckFlexion":{"id": "0",
"exerciseid": "WtLyingNeckFlexion",
"musclegroup": "Neck",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Sternocleidomastoid",
"name": "Weighted Lying Neck Flexion",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Place folded towel on weight plate(s). Lie supine on bench, head extending off of end of bench. Place plates on forehead with towel placed in between for comfort.",
"execution": "Move head up by flexing neck until chin touches upper chest. Return by hyperextending neck and repeat.",
"comments": "Balance weight on back of head with both hands throughout movement. Weight plate(s) can be tilted slightly to higher point on head to keep resistance slightly more consistent throughout movement. Tilt weight forward slightly at bottom and back slightly at top. Also see Weighted Neck Flexion positioning body perpendicular on bench.",
"stabilizers": "rectusabdominis, obliques",
"synergists": "None",
"target": "sternocleidomastoid"},"NeckWtNeckFlx":{"id": "1",
"exerciseid": "WtNeckFlx",
"musclegroup": "Neck",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Sternocleidomastoid",
"name": "Weighted Neck Flexion",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Place folded towel on weight plate. Lie supine perpendicular on bench with low back and hips extending off and feet on floor. Place weight and towel on forehead. Place plates on forehead with towel placed in between for comfort.",
"execution": "Move head up by flexing neck until chin touches upper chest. Return by hyperextending neck and repeat.",
"comments": "Balance weight on back of head with both hands throughout movement.Weight plate(s) can be tilted slightly to higher point on head to keep resistance slightly more consistent throughout movement. Tilt wei ght forward slightly at bottom and back slightly at top. Also see Weighted Lying Neck Flexion lying on bench longwise.",
"stabilizers": "rectusabdominis, obliques",
"synergists": "None",
"target": "sternocleidomastoid"},"NeckWtNeckLateralFlex":{"id": "2",
"exerciseid": "WtNeckLateralFlex",
"musclegroup": "Neck",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Sternocleidomastoid",
"name": "Weighted Lateral Neck Flexion",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Place folded towel on weight plate. Lie on bench on side with knees and hips bent and arm hanging over edge. Position weight and towel on side of upper head. Hold weight on side of head with hand of upper arm. Place hand of lower arm on floor for support.",
"execution": "Move head up to side by laterally flexing neck. Lower head to opposite side and repeat. Lie on other side and continue.",
"comments": "See all muscle used in Lateral Flexion Atlantoccipical  AntlantoaxialCervical Spine",
"synergists": "levatorscapulae, trapeziusupper, splenius, erectorspinae",
"target": "sternocleidomastoid"}}