{"WaistRearDeclinePlank":{"id": "0",
"exerciseid": "RearDeclinePlank",
"musclegroup": "Waist",
"equipment": "isometric",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Rear Decline Bridge",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Lie supine on mat with arms to sides. Place feet flat on floor or mat with knees bent.",
"execution": "Raise hips up off floor until hips are straight. Hold position.",
"comments": "Muscles are exercised isometrically. Easier Movement can be made easier by raising hips off of mat only slightly. Harder Exercise could be made more challenging by placing only one foot on floor with the other leg extended out off of ground.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "gluteusmaximus, quadriceps",
"target": "erectorspinae"},"WaistRearInclinePlank":{"id": "1",
"exerciseid": "RearInclinePlank",
"musclegroup": "Waist",
"equipment": "isometric",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Rear Incline Bridge",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Sit on mat with legs together. Place hands back to sides on floor or mat so torso is reclined back slightly.",
"execution": "Raise hips up off floor until hips are straight. Hold position.",
"comments": "Muscles are exercised isometrically. Easier Movement can be made easier placing hands back onto sturdy elevated structure and performing movement. Movement can also be performed on forearms with arms bent. Harder Exercise could be made more challenging with added weight (eg sandbags, partner) on hips or upper thighs, although it is rarely performed in that manner. Raising one foot up off floor can also make holding this position more difficult.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, tricepsbrachii, levatorscapulae, hamstrings, trapeziusmiddle, gluteusmaximus, trapeziuslower, rhomboids",
"target": "erectorspinae"}}