{"ThighsWtSquat":{"id": "0",
"exerciseid": "WtSquat",
"musclegroup": "Thighs",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Weighted Belt Squat",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Place weight on dip belt around waist. Step up onto boxes or benches spaced apart foot on each one. Arms can be extended forward throughout exercise.",
"execution": "Squat down by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Squat up by extending knees and hips until legs are straight. Return and repeat.",
"comments": "Keep head facing forward, back straight, chest high, and feet flat on surface equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis. Also see similar exercise Cable Belt Squat.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsWTFrontSquat":{"id": "1",
"exerciseid": "WTFrontSquat",
"musclegroup": "Thighs",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Weighted Front Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand with feet shoulder width or slightly narrower apart. Holding weight plate upper chest height with both hands.",
"execution": "Squat down by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Extend knees and hips until legs are straight. Return and repeat.",
"comments": "Keep head facing forward, back straight, chest high, and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis. Also see Kettlebell Goblet Squat.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, erectorspinae, pectoralisclavicular, levatorscapulae, brachioradialis, serratusanterior, bicepsbrachii, brachialis, supraspinatus, trapeziusmiddle, deltoidlateral, deltoidanterior, trapeziuslower",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsWTSingleLegSquat":{"id": "2",
"exerciseid": "WTSingleLegSquat",
"musclegroup": "Thighs",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Weighted Single Leg Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand with arms extended out in front holding medicine ball or weight plate. Balance on one leg with opposite leg extended straight leg forward as high as possible.",
"execution": "Squat down as far as possible while keeping leg elevated off of floor. Keep supporting knee pointed same direction as foot supporting. Raise bodyback up to original position until knee and hip of supporting leg is straight. Return and repeat. Continue with opposite leg.",
"comments": "Supporting knee should point same direction as foot throughout movement. Range of motion will be improved with greater leg strength and glute flexibility. Significant spinal flexion occurs at bottom of deep single leg squat to maintain center of gravity over foot. Erector Spinae becomes a stabilizer if spine is kept straight. An easier, alternative style is to place barbell on back of shoulders and cross lower leg above knee of supporting leg or wrap one foot around back of supporting leg.",
"stabilizers": "trapeziusupper, levatorscapulae, deltoidanterior, sartorius, trapeziusmiddle, gluteusminimus, deltoidlateral, trapeziuslower, rectusabdominis, pectoralisclavicular, gluteusmedius, tensorfasciaelatae, serratusanterior, wristextensors, iliopsoas, quadratuslumborum, obliques, pectineus, quadriceps",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "erectorspinae, soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsWTSissySquat":{"id": "3",
"exerciseid": "WTSissySquat",
"musclegroup": "Thighs",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Weighted Sissy Squat",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "With shoulder width stance, grasp fixed bar or support at hip level with one arm and secure plate across chest with other arm.",
"execution": "With hips and waist straight, bend knees to allow body to fall backwards as knees come forward. Allow heels to raise from floor. Lower body until knees are almost fully flexed or near floor. Return to original position by extending knees as heels return to floor.",
"comments": "Keep waist and hips straight throughout exercise. Knees should point same direction as feet throughout movement. Sissy Squat can be performed without additional weight until additional resistance is required. Also see Weighted Sissy Squat on apparatus.",
"stabilizers": "soleus, gluteusmaximus, gastrocnemius, rectusabdominis, obliques",
"synergists": "None",
"target": "quadriceps"},"ThighsWTSissySquatAp":{"id": "4",
"exerciseid": "WTSissySquatAp",
"musclegroup": "Thighs",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Weighted Sissy Squat (on apparatus)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Place feet under lower padded bar with calves against upper pads. Secure weight plate high on chest with both arms.",
"execution": "Allow body to fall backwards by bending knees. During descent, gradually bend hips, yet keep chest high and dont allow torso to angle forward. Lower body until back of thigh is against upper pad. Rise to original position by extending knees and hips while keeping shoulders behind hips. Repeat.",
"comments": "Keep chest high and shoulder behind hips, preventing torso to angle forward. If upper pad is too high, it can obstruct range of motion, and possibly create abrupt forward dislocating forces on knee particularly if descent is not controlled. In contrast, inadequate support will be provided if upper pad is too low. Sissy Squat without added weight can be performed with torso angled slightly forward until confidence is achieved. At which point, exercise can be practiced with torso progressively more upright, then with shoulders progressively behind hips. Synergists and Dynamic Stabilizers are only activated if torso becomes upright or angles slightly forward. If this happens, Antagonist Stabilizer becomes Stabilizer and listed stabilizers are no longer significantly involved. Also see Weighted Sissy Squat performed without apparatus.",
"antagonist stabilizers": "erectorspinae",
"dynamic stabilizers": "hamstrings",
"stabilizers": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, rectusabdominis, obliques",
"synergists": "gluteusmaximus, adductors",
"target": "quadriceps"}}