{"WaistSMBentKneeGoodMorning":{"id": "0",
"exerciseid": "SMBentKneeGoodMorning",
"musclegroup": "Waist",
"equipment": "smith",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Smith Bent Knee Good-morning",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Position bar on back of shoulders. Grasp bar to sides. Disengage bar by rotating bar back.",
"execution": "Bend hips to lower torso forward until parallel to floor. Bend knees slightly during descent. Raise torso until hips are extended. Repeat.",
"comments": "Target muscle is exercised isometrically . Begin with light weight and add additional weight gradually to allow adequate adaptation. Throughout lift, keep back straight. Knees will have to bend more with those with less hamstring flexibility. Knees can be kept bent throughout movement. Also see straight leg Goodmorning emphasizing Hamstrings.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "quadriceps",
"synergists": "hamstrings, gluteusmaximus, adductors",
"target": "erectorspinae"},"WaistSMDeadlift":{"id": "1",
"exerciseid": "SMDeadlift",
"musclegroup": "Waist",
"equipment": "smith",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Smith Deadlift",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand with shoulder width or narrower stance with feet flat beneath bar. Grasp bar with shoulder width or slightly wider mixed grip or slightly wider. Disengage bar by rotating bar back.",
"execution": "Squat down to lower bar by bending hips and knees. Lift bar by extending hips and knees to full extension. Pull shoulders back at top of lift if rounded. Return and repeat.",
"comments": "Throughout lift, keep hips low, shoulders high, arms and back straight. Keep bar close to body to improve mechanical leverage. See Smith Deadlift under Gluteus Maximus. Also see Deadlift Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, rhomboids",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "hamstrings, soleus, gluteusmaximus, adductors, quadriceps",
"target": "erectorspinae"},"WaistSMStiffLegDeadlift":{"id": "2",
"exerciseid": "SMStiffLegDeadlift",
"musclegroup": "Waist",
"equipment": "smith",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Smith Stiff Leg Deadlift",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand with shoulder width or narrower stance on elevated platform with thigh against bar. Grasp bar with shoulder width or slightly wider overhand grip. Disengage bar by rotating bar back.",
"execution": "With knees slightly bent, Lower bar toward top of feet by bending hips. Keep waist straight, flexing only slightly at bottom. Lift bar by extending at hips until standing upright. Pull shoulders back slightly if rounded. Extend knees at top if desired. Repeat.",
"comments": "Lower back may bend slightly during full hip flexion. Erector Spinae is exercised isometrically if low back does articulate as with Straight Back Stiff Leg Deadlift (targeting Glutes). Begin with light weight and add additional weight gradually to allow adequate adaptation. Throughout lift, keep arms straight. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings. Full range of motion will vary from person to person. Those with less flexibility may have to bend their knees more or they may not even need to stand on platform. Knee can be kept bent throughout movement. See Dangerous Exercise Essay. Also see Straight Leg Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, trapeziusmiddle, levatorscapulae, trapeziuslower, rhomboids, quadriceps",
"synergists": "hamstrings, gluteusmaximus, adductors",
"target": "erectorspinae"},"WaistSMStraightLegDeadlift":{"id": "3",
"exerciseid": "SMStraightLegDeadlift",
"musclegroup": "Waist",
"equipment": "smith",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Smith Straight Leg Deadlift",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand with shoulder width or narrower stance on elevated platform with thigh against bar. Grasp bar with shoulder width or slightly wider overhand grip. Disengage bar by rotating bar back.",
"execution": "With knees straight, lower bar toward top of feet by bending hips. After hips can no longer flex, bend waist as bar approaches top of feet. Lift bar by extending waist and hip until standing upright. Pull shoulders back slightly if rounded. Repeat.",
"comments": "Begin with very light weight and add additional weight gradually to allow lower back adequate adaptation. Throughout lift, keep arms and knees straight. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings and low back. Full range of motion will vary from person to person. Those with less flexibility may not even need to stand on platform. See Dangerous Exercise Essay. Also see Stiff Leg Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, trapeziusmiddle, levatorscapulae, trapeziuslower, rhomboids",
"synergists": "hamstrings, gluteusmaximus, adductors",
"target": "erectorspinae"}}