{"HipsLVBentOverRearKickPL":{"id": "0",
"exerciseid": "LVBentOverRearKickPL",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Bent-over Glute Kickback (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lean over wide padded area, place forearms on padded arm rest, and grip handles. Bend knee and position foot against lever platform.",
"execution": "Push platform back by extending leg back. Return leg to original position. Repeat. Continue with opposite leg.",
"comments": "None",
"antagonist stabilizers": "hamstrings, rectusabdominis",
"stabilizers": "gluteusmedius, obliques, gluteusminimus, erectorspinae",
"synergists": "adductors",
"target": "gluteusmaximus"},"HipsLVDeadlift":{"id": "1",
"exerciseid": "LVDeadlift",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Deadlift (plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand between lever handles to sides. Squat down with feet flat and grasp handles to sides.",
"execution": "Lift lever by extending hips and knees to full extension. Pull shoulders back at top of lift if rounded. Return weight by bending hips back while allowing knees to bend forward slightly, keeping back straight and knees pointed same direction as feet. Repeat.",
"comments": "Throughout lift, keep hips low, shoulders high, arms and back straight. Knees should point same direction as feet throughout movement. Exercise can also be performed facing opposite direction, toward fulcrum.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, trapeziusmiddle, erectorspinae, levatorscapulae, rhomboids",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVStiffLegDeadlift":{"id": "2",
"exerciseid": "LVStiffLegDeadlift",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Stiff Leg Deadlift (plate loaded)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand between lever handles with shoulder width or narrower stance. Squat down and grasp handles to each side. Stand upright with arms straight down to sides.",
"execution": "Bow forward by bending hips. Bend knees slightly during descent and keep waist straight, flexing low back at bottom. With knees slightly bent, raise torso by extending at waist, then hips, gradually extending knees until standing upright. Pull shoulders back slightly if rounded. Repeat.",
"comments": "Lower back may bend slightly during hip flexion phase. Target muscle is exercised isometrically if lower back does not bend. Begin with light weight and add additional weight gradually to allow adequate adaptation. Throughout lift, keep arms straight. Knee can be kept bent throughout movement. Do not stand behind lever handles. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings and back When finished with set, dismount by lowering weight with knees bent and low back straight. Full range of motion will vary from person to person. Those with less flexibility may have to bend knees more or they may not even need to stand on platform. See Dangerous Exercise Essay.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, trapeziusmiddle, levatorscapulae, trapeziuslower, rhomboids, quadriceps",
"synergists": "hamstrings, adductors, erectorspinae",
"target": "gluteusmaximus"},"HipsLVStrBackStiffLegDeadlift":{"id": "3",
"exerciseid": "LVStrBackStiffLegDeadlift",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Straight-back Stiff-leg Deadlift (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand between lever handles with shoulder width or narrower stance. Squat down and grasp handles to each side. Stand upright with arms straight down to sides.",
"execution": "With back straight, bow forward by bending hips and bend knees slightly during descent. Raise torso by extending hips while gradually extending knees until standing upright. Pull shoulders back slightly if rounded. Repeat.",
"comments": "Do not stand behind handles. Throughout lift, keep arms and back straight. Do not lower weight beyond mild stretch throughout hamstrings. When finished with set, dismount by lowering weight with knees bent and low back straight. Full range of motion will vary from person to person. Those with less flexibility may have to bend knees more. Knees can be kept bent throughout movement.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, levatorscapulae, trapeziusmiddle, erectorspinae, trapeziuslower, rhomboids, quadriceps",
"synergists": "hamstrings, adductors",
"target": "gluteusmaximus"},"HipsLV45LegPress":{"id": "4",
"exerciseid": "LV45LegPress",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever 45° Leg Press (plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on machine with back on padded support. Place feet slightly high on platform. Extend hips and knees. Release dock lever and grasp handles to sides.",
"execution": "Flex hips and knees to lower lever until hips are completely flexed. Push platform by extending knees and hips. Repeat.",
"comments": "Adjust safety brace and back support to accommodate near full range of motion without forcing hips to bend at waist. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot. Knees should point same direction as feet throughout movement. Placing feet slightly high on platform emphasize Gluteus Maximus. Placing feet slightly lower on platform emphasize Quadriceps. Also see Locking Out Knees on Leg Press.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVSingleLeg45LegPress":{"id": "5",
"exerciseid": "LVSingleLeg45LegPress",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Single Leg 45° Leg Press",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on machine with back on padded support. Place one foot mid height to high up on platform. Place outside of resting foot on lower surface with knee positioned out for greater clearance. Push platform up by extending hip and knee. Release dock lever and grasp handles to sides.",
"execution": "Lower platform by bending leg until knee is just short of complete flexion. Return by extending knee and hip. Repeat. Continue with opposite leg.",
"comments": "Lower platform enough to achieve full range of motion without forcing pelvis to bend at waist. On exercised leg, keep pointed same direction as foot . Also, do not allow heel to raise off of platform, pushing with both heel and forefoot. For alternative view, see Lever Single Leg 45 Leg Press performed with opposite leg.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVHackPress":{"id": "6",
"exerciseid": "LVHackPress",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Hack Press (plate loaded)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on seat with back of hips against back pad. Place feet on platform shoulder width or slightly wider. Extend hips and knees. Disengage dock lever if it does not automatically disengage.",
"execution": "Lower seat by flex hips and knees until either is near complete flexion. Raise seat by extending knees and hips. Repeat.",
"comments": "When finished, engage dock lever, and lower seat to starting position. If insufficient hip flexibility forces pelvis to pull away from back pad at lower portions of movement, only lower sled just short of spinal articulation. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot. Placing feet slightly high on platform emphasize Gluteus Maximus. Placing feet slightly lower on platform emphasize Quadriceps. Also see Sled Hack Press.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVLyingLegPressH":{"id": "7",
"exerciseid": "LVLyingLegPressH",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Lying Leg Press (plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Climb up steps to top of machine. Lie supine on horizontal padded platform with shoulders against pad. Place feet equally spaced and slightly high on platform. Grip handles above shoulder pads.",
"execution": "Push lever platform away by extending hips and knees until knees are straight. Return lever platform by flexing hips and knees until knees are just short of complete flexion or until hips are completely flexed. Repeat.",
"comments": "Adjust shoulder pads to allow full range of motion without forcing hips to rise at waist. Keep knees pointed same directions as feet. Push with both heel and forefoot and do not allow heels to raise off of platform. Placing feet slightly high on platform emphasize Gluteus Maximus. Placing feet slightly lower on platform emphasize Quadriceps.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVLyingLegPress":{"id": "8",
"exerciseid": "LVLyingLegPress",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Lying Leg Press (custom - plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie supine on padded platform. Place hands on bars above head or to sides. Place feet flat on lever platform with hips and knees bent.",
"execution": "Push lever platform by extending hips and knees until knees are straight. Lower lever platform by flexing hips and knees until knees are just short of complete flexion. Repeat.",
"comments": "Adjust machine to accommodate near full range of motion without forcing hips to rise at waist. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot. Placing feet slightly high on platform emphasize Gluteus Maximus. Placing feet slightly lower on platform emphasize Quadriceps. Unique apparatus is designed and built by Tracey Cheuvront.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVSingleLegLyingLegPress":{"id": "9",
"exerciseid": "LVSingleLegLyingLegPress",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Single Leg Lying Leg Press (custom - plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie supine on padded platform. Place hands on bars above head or to sides. Place one foot on platform and other foot on floor below platform.",
"execution": "Push platform away by extending hip and knee. Return by bending leg until knee or hip is just short of complete flexion. Repeat. Continue with opposite leg.",
"comments": "Adjust machine to accommodate near full range of motion without forcing pelvis to bend at waist. Keep knee pointed same direction as foot. Do not allow heel to raise off of platform, pushing with both heel and forefoot. Unique apparatus is designed and built by Tracey Cheuvront.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVSeatedLegPressH":{"id": "10",
"exerciseid": "LVSeatedLegPressH",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Seated Leg Press (plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on machine with back on padded support. Place feet slightly high on platform. Grasp handles to sides.",
"execution": "Push platform(s) away by extending knees and hips until knees are fully extended. Return until hips are completely flexed. Repeat.",
"comments": "Adjust seat and back support to accommodate near full range of motion without forcing hips to bend at waist. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot. Placing feet slightly high on platform emphasize Gluteus Maximus. Placing feet slightly lower on platform emphasize Quadriceps.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVAlternatingLegPress":{"id": "11",
"exerciseid": "LVAlternatingLegPress",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Alternating Seated Leg Press (plate loaded)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on machine with back on padded support. Place feet on slightly high on platform. Grasp handles to sides.",
"execution": "Push one platform away by extending knee and hip. Return to original position. Repeat with opposite leg. Continue by alternating between sides.",
"comments": "Adjust seat and back support to accommodate near full range of motion without forcing hips to bend at waist. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot. This exercise may be performed by alternating (as described), simultaneous, or in simultaneousalternating fashion.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVSingleLegPressH":{"id": "12",
"exerciseid": "LVSingleLegPressH",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Single Leg Seated Leg Press (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on machine with back on padded support. Place one foot slightly high on platform and other foot near floor below platform or off to side.",
"execution": "Push platform away by extending hip and knee. Return by bending leg until knee or hip is just short of complete flexion. Repeat. Continue with opposite leg.",
"comments": "Adjust back support back to accommodate near full range of motion without forcing pelvis to bend at waist. Keep knee pointed same direction as foot. Push with both heel and forefoot and do not allow heel to raise off of platform.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVLyingHipExtensionH":{"id": "13",
"exerciseid": "LVLyingHipExtensionH",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Lying Hip Extension (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Lie on bench with knees legs over pads. Align hip joints with lever fulcrum. Strap hips down with belt. Grasp handles at each side.",
"execution": "Extend hips and knees until legs are straight. Return to original position by flexing hips and knees. Repeat.",
"comments": "Also see Lever Lying Hip Extension on selectorized machine.",
"antagonist stabilizers": "rectusabdominis",
"dynamic stabilizers": "hamstrings",
"stabilizers": "erectorspinae",
"synergists": "adductors",
"target": "gluteusmaximus"},"HipsLVPowerRunnerPL":{"id": "14",
"exerciseid": "LVPowerRunnerPL",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Power Runner (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Place forefeet into pedals. Squat down and position shoulders forward in padded yoke. Grasp handles to sides. Push one pedal back by extending knee and hip so one leg is straight while the other remains forward.",
"execution": "Push forward pedal back by extending leg while allowing other pedal to come forward by bending opposite leg. Continue pedalling by alternating between sides.",
"comments": "Adjust yoke position to accommodate near full range of motion without forcing hips to bend at waist. Also see Lever Sprint Machine.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVRearLunge":{"id": "15",
"exerciseid": "LVRearLunge",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Rear Lunge (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between lever handles to sides. Squat down with feet flat on floor and grasp lower handles to sides. Lift lever by extending hips and knees to full extension. Position both feet slightly forward.",
"execution": "Step back with one leg while bending supporting leg. Plant forefoot far back on floor. Lower body by flexing knee and hip of supporting leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward supporting leg and return rear leg next to supporting leg. Repeat movement with opposite legs alternating between sides.",
"comments": "Keep torso upright during lunge flexible hip flexors are important. Forward knee should point same direction as foot throughout lunge. A long lunge emphasizes Gluteus Maximus short lunge emphasizes Quadriceps. Also see Lever Rear Lunge on apparatus without platform.",
"stabilizers": "trapeziusupper, levatorscapulae, gluteusmedius, gluteusminimus, quadratuslumborum, erectorspinae, trapeziuslower, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVBBRearLunge":{"id": "16",
"exerciseid": "LVBBRearLunge",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Barbell Rear Lunge (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "With bar upper chest height, position bar on back of shoulders and grasp bar to sides. Place feet under bar or slightly forward. Straighten legs so weight is lifted. Disengage bar by rotating bar back. Place feet slightly forward.",
"execution": "Step back with one leg while bending supporting leg. Plant forefoot far back on floor. Lower body by flexing knee and hip of supporting leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward supporting leg and return rear leg next to supporting leg. Repeat movement with opposite legs alternating between sides.",
"comments": "Keep torso upright during lunge flexible hip flexors are important. Forward knee should point same direction as foot throughout lunge. A long lunge with feet slightly forward emphasizes Gluteus Maximus short lunge with feet under the bar emphasizes Quadriceps.",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVReverseHyperextension":{"id": "17",
"exerciseid": "LVReverseHyperextension",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Reverse Hyper-extension (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Place one leg in strap so it is positioned above ankle. Step up onto step built on side of apparatus with other foot. Lay torso and waist on bench and grasp handles. Place stepping foot inside of strap, just in front of leg already in strap. Position legs side by side. Feet should be above floor with legs hanging straight down.",
"execution": "Raise lever by extending hips as high as possible with legs nearly straight. Lower legs to original position. Repeat.",
"comments": "Taller individuals may be able to place both legs into strap and position torso on bench without using steps. Some individuals may be able to articulate both through the hips and through the lower back (i.e. lumbar spine), in which case, Erector Spinae also becomes synergist. Movement can be performed without resistance. Lever Reverse Hyperextension was invented by Louie Simmons of Westside Barbell.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"synergists": "hamstrings",
"target": "gluteusmaximus"},"HipsLVSingleLegSplitSquat":{"id": "18",
"exerciseid": "LVSingleLegSplitSquat",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Single Leg Split Squat (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between lever handles to sides. Extend leg back and place top of foot on cross bar. Squat down and grasp handles to sides.",
"execution": "With chest high, lift lever by extending hips and knees to full extension. Return until knee of rear leg is almost in contact with floor. Repeat. Continue with opposite leg.",
"comments": "Keep torso upright during squat flexible hip flexors are important. Forward knee should point same direction as foot throughout movement. Keep foot flat on floor. Position foot slightly forward to distribute force on hip extensors. May also be referred to as Lever Bulgarian Squat.",
"stabilizers": "trapeziusupper, gluteusminimus, erectorspinae, levatorscapulae, trapeziuslower, gluteusmedius",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVBBSingleLegSplitSquat":{"id": "19",
"exerciseid": "LVBBSingleLegSplitSquat",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Barbell Single Leg Split Squat (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Place bench behind smith bar. With bar upper chest height, position bar on back of shoulders and grasp bar to sides. Place foot slightly forward under bar. Extend other leg back and place top of foot on bench. Disengage bar by rotating bar back.",
"execution": "Lower body by flexing knee and hip of front leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward leg. Repeat. Continue with opposite leg.",
"comments": "Keep torso upright during squat flexible hip flexors are important. Forward knee should point same direction as foot throughout movement. Keep foot flat on floor. Position foot slightly forward to distribute force on hip extensors. May also be referred to as Lever Barbell Bulgarian Squat.",
"stabilizers": "gluteusmedius, gluteusminimus, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVSingleLegSquat":{"id": "20",
"exerciseid": "LVSingleLegSquat",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Single Leg Squat (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between handles facing away from fulcrum. Grasp both handles to sides and stand upright. Cross lower leg above knee of supporting leg.",
"execution": "Bend knee forward slightly while allowing hips to bend back behind, keeping back straight and knee pointed same direction of foot. Squat down as low as possible. Extend knee and hip until leg is straight. Return and repeat. Continue with opposite leg.",
"comments": "Range of motion will be improved with greater leg strength and glute flexibility. Base knee should point same direction as foot throughout movement.",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVSplitSquat":{"id": "21",
"exerciseid": "LVSplitSquat",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Split Squat (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between lever handles to sides. Place forefoot of one foot on floor to rear and other foot slightly forward. Squat down and grasp handles to sides.",
"execution": "With chest high, lift lever by extending hips and knees to full extension. Return until knee of rear leg is almost in contact with floor and repeat. Continue with opposite leg.",
"comments": "Keep torso upright during squat flexible hip flexors are important. Knees should point same direction as feet throughout movement. Keep foot flat on floor. Position foot slightly forward to distribute force on hip extensors. Also known as Lever Lunge.",
"stabilizers": "trapeziusupper, gluteusminimus, erectorspinae, levatorscapulae, trapeziuslower, gluteusmedius",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVBBSplitSquat":{"id": "22",
"exerciseid": "LVBBSplitSquat",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Barbell Split Squat (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "With bar upper chest height, position bar on back of shoulders and grasp bar to sides. Place one foot forward and forefoot of other leg further back. Disengage bar by rotating bar back.",
"execution": "Lower body on other leg by flexing knees and hips of of both legs until knee of rear leg is almost in contact with floor. Return to original straddled position by extending hips and knees of both legs. Repeat. Continue with opposite leg.",
"comments": "Keep torso upright during movement flexible hip flexors are important. Knees should point same direction as feet throughout movement. A forward foot further forward will emphasizes Gluteus Maximus forward foot more closer under bar will emphasizes Quadriceps.",
"stabilizers": "erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVSlidingSplitSquatPL":{"id": "23",
"exerciseid": "LVSlidingSplitSquatPL",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Sliding Split Squat (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand with one foot on stationary platform under foot pad and other foot back on sliding platform. Squat down and grasp handles to sides. Stand upright with arms straight to sides.",
"execution": "Lower lever downward by sliding platform back and squatting down on forward leg. Keep chest high as hips descend to knee height. Lift sliding forward and extending hips and knee to full extension. Repeat and continue with opposite leg.",
"comments": "Keep torso upright during movement flexible hip flexors are important. Knees should point same direction as feet throughout movement. Keep forward foot flat on stationary platform.",
"stabilizers": "trapeziusupper, gluteusminimus, erectorspinae, levatorscapulae, trapeziuslower, gluteusmedius, quadriceps",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVSquatPL":{"id": "24",
"exerciseid": "LVSquatPL",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Squat (plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Squat down to place shoulders under padded lever. Place feet shoulder width apart slightly in front of shoulders. Extend knees and hips until legs are straight. Release support lever.",
"execution": "Squat down by bending hips back while allowing knees to bend forward slightly, keeping back straight and knees pointed same direction as feet. Descend by bending knees and hip until thighs are just past parallel to floor. Lift lever up by extending knees and hips until legs are straight. Repeat.",
"comments": "If available, reengage support lever in extended position before dismounting. Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis. Also see exercise performed on alternative machine.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVSquatPL3":{"id": "25",
"exerciseid": "LVSquatPL3",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Squat (plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Squat down to place shoulders under padded lever. Place feet shoulder width or marginally wider apart, slightly in front of shoulders. Extend knees and hips until legs are straight. Release support lever.",
"execution": "Squat down by bending hips back while allowing knees to bend forward slightly, keeping back straight and knees pointed same direction as feet. Descend by bending knees and hip until thighs are just past parallel to floor. Lift lever up by extending knees and hips until legs are straight. Repeat.",
"comments": "If available, reengage support lever in extended position before dismounting. Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis.Also see exercise performed onclassic Lever Squat machine.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVBBSquat":{"id": "26",
"exerciseid": "LVBBSquat",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Barbell Squat (plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "With bar upper chest height, position bar on back of shoulders and grasp bar to sides. Place feet slightly forward. Disengage bar by rotating bar back.",
"execution": "Squat down by bending hips back while allowing knees to bend forward slightly, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Extend knees and hips until legs are straight. Return and repeat.",
"comments": "Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVFrontSquatPL":{"id": "27",
"exerciseid": "LVFrontSquatPL",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Front Squat",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Step onto platform facing padded levers. Squat down to place shoulders under padded lever. Place feet shoulder width apart on platform. Extend knees and hips until legs are straight. Release support lever if it does not disengage by itself.",
"execution": "Lower lever by bending hips back while allowing knees to bend forward slightly, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Lift lever up by extending knees and hips until legs are straight. Repeat.",
"comments": "If available, reengage support lever in extended position before dismounting. Model shown uses foot pedal near base of platform to reengage support lever. Keep head facing forward, back straight and feet flat on platform equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVFullSquatPL":{"id": "28",
"exerciseid": "LVFullSquatPL",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Full Squat (plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Squat down to place shoulders under padded lever. Place feet shoulder width apart slightly in front of shoulders. Extend knees and hips until legs are straight. Release support lever.",
"execution": "Squat down by bending hips back while allowing knees to bend forward slightly, keeping back straight and knees pointed same direction as feet. Descend until knees and hips are fully bent. Lift lever up by extending knees and hips until legs are straight. Repeat.",
"comments": "If available, reengage support lever in extended position before dismounting. Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVHackSquat":{"id": "29",
"exerciseid": "LVHackSquat",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever Hack Squat (plate loaded)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Position shoulders under shoulder pad and back on back pad. Place feet slightly high on platform. Extend hips and knees and release dock lever if available.",
"execution": "Lower lever by bending hips and knees, until knees are just short of complete flexion. Raise sled by extending knees and hips. Repeat.",
"comments": "If insufficient hip flexibility forces pelvis to pull away from back pad at lower portions of movement, only lower sled just short of spinal articulation. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform. Push with both heel and forefoot. If available, reengage dock lever in extended position before dismounting. Placing feet slightly high on platform emphasize Gluteus Maximus. Placing feet slightly lower on platform emphasize Quadriceps. Also see similar exercise Lever VSquat.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsLVVSquatH":{"id": "30",
"exerciseid": "LVVSquatH",
"musclegroup": "Hips",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Lever V-Squat (plate loaded)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Position shoulders under shoulder pads with back against back pad. Place feet on platform, shoulder or hip width apart. Extend hips and knees and release lever if available.",
"execution": "Bend knees forward slightly while allowing hips to bend back behind, keeping back straight and knees pointed same direction as feet. Descend until hips are just short of complete flexion. Raise sled by extending knees and hips. Repeat.",
"comments": "If available, reengage support lever in extended position before dismounting. If insufficient hip flexibility forces pelvis to pull away from back pad at lower portions of movement, only lower sled just short of spinal articulation. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform. Push with both heel and forefoot. Also see selectorized machine. Placing feet slightly forward on platform emphasize Gluteus Maximus. Placing feet slightly back on platform emphasize Quadriceps.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"}}