{"UpperArmsSTArmCurl":{"id": "0",
"exerciseid": "STArmCurl",
"musclegroup": "UpperArms",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "Brachialis",
"name": "Suspended Arm Curl",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp suspension handles and momentarily step back until arms are extended forward and straight. While keeping arms straight and shoulders back, step forward so body is reclined back. Position palms up or slightly inward.",
"execution": "Bring handles toward shoulders by flexing arms, while keeping elbows pointed forward. Return by straightening arms and repeat.",
"comments": "Dismounting can be achieved by walking backward until body is upright. Also known as Suspended Biceps Curl, arguably somewhat of a misnomer. The positioning of arms, with elbows high, places short head (medial head) of Bicep Brachii in active insufficiency as arm continues to flex. The long head of Biceps Brachii (lateral head) and in particular, Brachialis are primary movers in this position. Allowing elbows to drop slightly during flexion may somewhat decrease active insufficiency of biceps brachii. However, this technique may not ideally emphasize biceps involvement, since this position prevents body from achieving a more upright position at end of movement at any given initial body angle, thereby creating a peak contraction (greatest resistance at top of movement) on elbow flexors which enter into yet another related compromised mechanical position (see Tension Potential and Muscle Lengthtension Relationship). This exercise can be performed on TRX style suspension trainer or adjustable length gymnastics rings. Easier Resistance is least when body is positioned upright at top of exercise. Movement can be made easier with staggered foot position by placing one foot slightly back. Harder Begin in a more reclined position. With body more angled back, stance can be on heels with forefeet pointing upward. At higher angles, feet can be placed flat on floor. When angled further back, only heels may contact floor with forefeet raising upward. See Gravity Vectors for greater understanding of how body angle influences resistance.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "hamstrings, trapeziusmiddle, gluteusmaximus, erectorspinae, wristflexors, rhomboids",
"synergists": "brachioradialis, bicepsbrachii",
"target": "brachialis"}}