{"WaistCBLyingCrunchStabilityBall":{"id": "0",
"exerciseid": "CBLyingCrunchStabilityBall",
"musclegroup": "Waist",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Cable Lying Crunch (on stability ball)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on stability ball against low pulley column. Roll back away from low pulley column, so back is on ball. Reach back and grasp cable rope attachment with both hands and place inside of wrists on sides of head. Allow weight to hyperextend lower back against stability ball.",
"execution": "With hips stationary, flex waist so elbows travel toward thighs. Return and repeat.",
"comments": "See Spot Reduction Myth. Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. Some individuals may experience low back discomfort if hips are not bent so they must use smaller ball size or lower their hip position on ball.",
"stabilizers": "latissimusdorsi, pectoralisclavicular, tricepsbrachii, serratusanterior, pectoralissternal, deltoidposterior, teresmajor, trapeziuslower, pectoralisminor, rhomboids",
"synergists": "obliques",
"target": "rectusabdominis"},"WaistCBLyingLegHipRaise":{"id": "1",
"exerciseid": "CBLyingLegHipRaise",
"musclegroup": "Waist",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Cable Lying Leg-Hip Raise",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Attach cable ankle straps to both ankles then attach ankle straps to cable. Lie supine on floor or mat, back far enough so cable is taut. Grasp support behind head.",
"execution": "Raise legs by flexing hips while flexing knees until hips are fully flexed. Raise hips from floor by flexing waist. Return until waist, hips and knees are extended downward. Repeat.",
"comments": "Movement can also be performed on bench. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible. See Spot Reduction Myth and Lower Ab Myth. Also see Cable Lying Leg Raise.",
"dynamic stabilizers": "quadriceps",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, obliques",
"target": "rectusabdominis"},"WaistCBLyingLegHipRaiseBench":{"id": "2",
"exerciseid": "CBLyingLegHipRaiseBench",
"musclegroup": "Waist",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Cable Lying Leg-Hip Raise (on bench)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Attach cable ankle straps to both ankles, then attach ankle straps to cable. Lie supine on floor or mat, back far enough so cable is taut. Grasp support behind head.",
"execution": "Raise legs by flexing hips while flexing knees until hips are fully flexed. Raise hips from floor by flexing waist. Return until legs are extended horizontally. Repeat.",
"comments": "Training partner or trainer may need to assist attaching ankle cuffs to cable. Ankle cuffs may also be attached to cable pulley in lowest position when feet are on floor, but assistance may be needed to raise pulley to bench height. Cable Lying Leg Raise on floor is easier to set up. Movement can also be performed on bench. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible. See Spot Reduction Myth and Lower Ab Myth . Also see Cable Lying Leg Raise on Bench.",
"dynamic stabilizers": "quadriceps",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, obliques",
"target": "rectusabdominis"},"WaistCBLyingStraightLegHipRaise":{"id": "3",
"exerciseid": "CBLyingStraightLegHipRaise",
"musclegroup": "Waist",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Cable Lying Straight Leg-Hip Raise",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Attach cable ankle straps to both ankles, then attach ankle straps to cable. Lie supine on floor or mat, back far enough so cable is taut. Grasp support behind head.",
"execution": "Raise legs by flexing hips until fully flexed. Raise hips from floor by flexing waist. Return until waist and hips are extended downward. Repeat.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. Waist flexion will occur earlier in lift if legs are straighter or Hamstrings are not that flexible. See Spot Reduction Myth and Lower Ab Myth. Also see Cable Lying Straight Leg Raise.",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps, obliques",
"target": "rectusabdominis"},"WaistCBKneelingCrunch":{"id": "4",
"exerciseid": "CBKneelingCrunch",
"musclegroup": "Waist",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Cable Kneeling Crunch",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Kneel below high pulley. Grasp cable rope attachment with both hands. Place wrists against head. Position hips back and flex hips, allowing resistance on cable pulley to lift torso upward so spine is hyperextended.",
"execution": "With hips stationary, flex waist so elbows travel toward middle of thighs. Return and repeat.",
"comments": "Note movement occurs in waist, not hips. See Spot Reduction Myth. Hyperextension of spine at top of motion is achieved by anterior rotation of pelvis with flexed hips. Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. If two soft stirrups are used instead of rope attachment, grasp stirrups at side of head. Also see alternative technique. Movement can also be performed standing up, see Cable Standing Overhead Crunch.",
"stabilizers": "latissimusdorsi, pectoralisclavicular, tricepsbrachii, tensorfasciaelatae, serratusanterior, pectoralissternal, iliopsoas, sartorius, deltoidposterior, teresmajor, trapeziuslower, pectoralisminor, rhomboids, quadriceps",
"synergists": "obliques",
"target": "rectusabdominis"},"WaistCBSeatedCrunch":{"id": "5",
"exerciseid": "CBSeatedCrunch",
"musclegroup": "Waist",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Cable Seated Crunch",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Seat with back support away from medium high pulley. Grasp cable rope attachment with both hands and place securely over both shoulders. Allow weight to lift chest up with spine arched back slightly.",
"execution": "With hips stationary, flex waist so elbows travel toward hips. Return and repeat.",
"comments": "See Spot Reduction Myth. Also see movement performed on dedicated apparatus or plate loaded apparatus.",
"stabilizers": "No significant stabilizers",
"synergists": "obliques",
"target": "rectusabdominis"},"WaistCBOverheadSeatedCrunch":{"id": "6",
"exerciseid": "CBOverheadSeatedCrunch",
"musclegroup": "Waist",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Cable Overhead Seated Crunch",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on bench or seat below two very close high pulleys. Grasp two separate cable stirrups, one with each hand. Pull stirrups down with palms facing back over each shoulder. Holding arms in place, allow weight to pull torso up, hyperextend lower back slightly.",
"execution": "With arms fixed in place, flex waist so shoulders travel forward and downward toward thighs. Return until chest is high and back is hyperextended. Repeat.",
"comments": "Keep arms fixed in position keeping them close to body throughout movement. See Spot Reduction Myth.",
"stabilizers": "latissimusdorsi, deltoidposterior, teresmajor, pectoralisminor, rhomboids",
"synergists": "obliques",
"target": "rectusabdominis"},"WaistCBSeatedCrunchPL":{"id": "7",
"exerciseid": "CBSeatedCrunchPL",
"musclegroup": "Waist",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Cable Seated Crunch (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on apparatus with back on back support. Grasp cable rope attachment with both hands and place securely over both shoulders. Allow weight to lift chest up with spine arched back slightly.",
"execution": "With hips stationary, flex waist small of back pushes into back of seat as upper back travels forward. Return and repeat.",
"comments": "See Spot Reduction Myth. Also see movement performed on selectorized apparatus.",
"stabilizers": "No significant stabilizers",
"synergists": "obliques",
"target": "rectusabdominis"},"WaistCBStandingCrunch":{"id": "8",
"exerciseid": "CBStandingCrunch",
"musclegroup": "Waist",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Cable Standing Crunch",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Position back against back pad with knees slightly bent, shoulders back, and chest high. Position both cable ropes over shoulders, one in each hand. Place hands with cable ropes in front of each shoulder so that cable is taut. If available, place hand in rope slot that allows cable to be taut when hands are in position.",
"comments": "Padded hump should be adjusted to height of low back. See Spot Reduction Myth. Also see Cable Standing Twisting Crunch and Cable Standing Overhead Crunch.",
"stabilizers": "No significant stabilizers",
"synergists": "obliques",
"target": "rectusabdominis"},"WaistCBStandingOverheadCrunch":{"id": "9",
"exerciseid": "CBStandingOverheadCrunch",
"musclegroup": "Waist",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Cable Standing Overhead Crunch",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand below high pulley. Grasp cable rope attachment and place wrists against head. Squat down slightly with hips flexed, allowing resistance on cable pulley to lift torso upward so spine is hyperextended.",
"execution": "With knees and hips stationary, flex waist so elbows travel toward middle of thighs. Return and repeat.",
"comments": "Note movement occurs in waist, not hips. Hyperextension of spine at top of motion is achieved by anterior rotation of pelvis with flexed hips. See Spot Reduction Myth. Two soft stirrups or multiexercise bar can be substituted for rope. If two soft stirrups are used, grasp stirrups at side of head. Also see similar exercises Cable Kneeling CrunchCable Standing CrunchCable Standing Overhead Crunch (multiexercise bar)",
"stabilizers": "latissimusdorsi, pectoralisclavicular, tricepsbrachii, tensorfasciaelatae, serratusanterior, pectoralissternal, iliopsoas, sartorius, deltoidposterior, teresmajor, trapeziuslower, pectoralisminor, rhomboids, quadriceps",
"synergists": "obliques",
"target": "rectusabdominis"},"WaistCBStandingOverheadCrunchMultiBar":{"id": "10",
"exerciseid": "CBStandingOverheadCrunchMultiBar",
"musclegroup": "Waist",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Cable Standing Overhead Crunch (multi-exercise bar)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand below high pulley. Grasp multiexercise bar cable attachment with parallel grip. Position hands near sides of head. Squat down slightly with hips flexed, allowing resistance on cable pulley to lift torso upward so spine is hyperextended.",
"execution": "With knees and hips stationary, flex waist so elbows travel toward middle of thighs. Return and repeat.",
"comments": "Note movement occurs in waist, not hips. Hyperextension of spine at top of motion is achieved by anterior rotation of pelvis with flexed hips. See Spot Reduction Myth. Two soft stirrups or triceps rope can also be substituted for multipurpose bar. Also see similar exercises Cable Kneeling CrunchCable Standing CrunchCable Standing Overhead Crunch (triceps rope)",
"stabilizers": "latissimusdorsi, pectoralisclavicular, tricepsbrachii, tensorfasciaelatae, serratusanterior, pectoralissternal, iliopsoas, sartorius, deltoidposterior, teresmajor, trapeziuslower, pectoralisminor, rhomboids, quadriceps",
"synergists": "obliques",
"target": "rectusabdominis"}}