{"CalvesLV45CalfPress":{"id": "0",
"exerciseid": "LV45CalfPress",
"musclegroup": "Calves",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Gastrocnemius",
"name": "Lever 45° Calf Press (plate loaded)",
"utility": "Basic",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Sit on seat with back on padded support. Place feet on platform. Grasp handles to sides and extend hips and knees. Place toes and balls of feet on lower portion of platform with heels and arches extending off.",
"execution": "Push platform by extending ankles as far as possible. Return by bending ankles until calves are stretched. Repeat.",
"comments": "Reposition stance if feet slip. Keep knees straight throughout exercise or bend knees slightly only during stretch. Quadriceps serve as synergists muscle if knees are bent slightly during stretch. See Calf Exercise Analyses.",
"stabilizers": "No significant stabilizers",
"synergists": "soleus",
"target": "gastrocnemius"},"CalvesLV45CalfRaisePL":{"id": "1",
"exerciseid": "LV45CalfRaisePL",
"musclegroup": "Calves",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Gastrocnemius",
"name": "Lever 45° Calf Raise (plate loaded)",
"utility": "Basic",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Sit on machine with low back against padding and grasp handles to sides. Place feet high on platform and straighten knees. Position toes and balls of feet on lower portion of platform with arches and heels extending off.",
"execution": "Raise heels by extending ankles as high as possible. Lower heels by bending ankles until calves are stretched. Repeat.",
"comments": "When finished, place feet back on platform, engage dock lever (if it automatically disengaged), and lower seat to original position. Keep knees straight throughout exercise or bend knees slightly only during stretch. Quadriceps serve as synergists muscle if knees are bent slightly during stretch. See Calf Exercise Analyses. Exercise is performed on apparatus designed to perform Hack Press. Also see Sled 45 Calf Raise.",
"stabilizers": "No significant stabilizers",
"synergists": "soleus",
"target": "gastrocnemius"},"CalvesLVSeatedCalfExtensionHammer":{"id": "2",
"exerciseid": "LVSeatedCalfExtensionHammer",
"musclegroup": "Calves",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Gastrocnemius",
"name": "Lever Calf Extension (plate loaded)",
"utility": "Basic",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Sit on seat and position forefeet on lever platform. Grasp handles to sides and straighten knees.",
"execution": "Push lever by extending ankle as far as possible. Return by bending ankles until calves are stretched. Repeat.",
"comments": "Position seat to allow full range of motion. Reposition stance if feet slip. Keep knees straight throughout exercise or bend knees slightly only during stretch. Quadriceps serve as synergists muscle if knees are bent slightly during stretch. Also known as Rotary Calf Extension. See Calf Exercise Analyses.",
"stabilizers": "No significant stabilizers",
"synergists": "soleus",
"target": "gastrocnemius"},"CalvesLVDonkeyCalfRaisePL":{"id": "3",
"exerciseid": "LVDonkeyCalfRaisePL",
"musclegroup": "Calves",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Gastrocnemius",
"name": "Lever Donkey Calf Raise (plate loaded)",
"utility": "Basic",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Position lower back and hips under padded lever. Place forearms on supports. Position toes and balls of feet on calf block with arches and heels extending off. Straighten knees.",
"execution": "Raise heels by extending ankles as high as possible. Lower heels by bending ankles until calves are stretched. Repeat.",
"comments": "Position lever just below lowest range of motion. Keep knees straight throughout exercise or bend knees slightly only during stretch. Quadriceps serve as synergists muscle if knees are bent slightly during stretch. See Calf Exercise Analyses.",
"stabilizers": "serratusanterior, pectoralissternal, pectoralisclavicular",
"synergists": "soleus",
"target": "gastrocnemius"},"CalvesLVSeatedCalfPressH":{"id": "4",
"exerciseid": "LVSeatedCalfPressH",
"musclegroup": "Calves",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Gastrocnemius",
"name": "Lever Seated Calf Press (plate loaded)",
"utility": "Basic",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Place seat away from platform. Sit on seat with lower back against back of seat. Place toes and balls of feet on lower portion of platform(s) with heels and arches extending off. Grasp handles to sides and straighten knees.",
"execution": "Push lever platform(s) by extending ankles as far as possible. Return by bending ankles until calves are stretched. Repeat.",
"comments": "Position seat back yet not so far that lever bottoms out during stretch. Reposition stance if feet slip. Keep knees straight throughout exercise or bend knees slightly only during stretch. Quadriceps serve as synergists muscle if knees are bent slightly during stretch. See Calf Exercise Analyses.",
"stabilizers": "No significant stabilizers",
"synergists": "soleus",
"target": "gastrocnemius"},"CalvesLVStandingCalfRaisePL":{"id": "5",
"exerciseid": "LVStandingCalfRaisePL",
"musclegroup": "Calves",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Gastrocnemius",
"name": "Lever Standing Calf Raise (plate loaded)",
"utility": "Basic",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Place shoulders under padded lever. Position toes and balls of feet on calf block with arches and heels extending off. Grasp handles or sides of padded lever. Stand erect by extending hips and knees.",
"execution": "Raise heels by extending ankles as high as possible. Lower heels by bending ankles until calves are stretched. Repeat.",
"comments": "If available, position lever or chain just below lowest range of motion. Keep knees straight throughout exercise or bend knees slightly only during stretch. Quadriceps serve as synergists muscle if knees are bent slightly during stretch. See Calf Exercise Analyses.",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle",
"synergists": "soleus",
"target": "gastrocnemius"},"CalvesLVVCalfRaiseH":{"id": "6",
"exerciseid": "LVVCalfRaiseH",
"musclegroup": "Calves",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Gastrocnemius",
"name": "Lever Calf Raise (on v-squat machine, plate loaded)",
"utility": "Basic",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Position shoulders under shoulder pads with back against back pad. Place feet on platform shoulder width apart. Extend hips and knees. Position toes and balls of feet on nearest edge of platform with arches and heels extending off.",
"execution": "Raise heels by extending ankles as high as possible. Lower heels by bending ankles until calves are stretched. Repeat.",
"comments": "Keep knees straight throughout exercise or bend knees slightly only during stretch. Quadriceps serve as synergists muscle if knees are bent slightly during stretch. See Calf Exercise Analyses.",
"synergists": "soleus",
"target": "gastrocnemius"}}