{"HipsSTMountainClimber":{"id": "0",
"exerciseid": "STMountainClimber",
"musclegroup": "Hips",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Suspended Mountain Climber",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Sit on floor facing suspension trainer loops in low position. Place right foot in left lower loop. Cross left leg over right leg placed in right lower loop. Turn body to right and place hands on floor, shoulder width apart. Turn body to kneel on hands and knees. Reposition hands (shoulder width or slightly wider) at desired distance from suspension trainer so that body is square with suspension trainer straps. With arms straight, raise knees from ground so body is supported by arms and suspension trainer. Bend one leg so knee is pointing down while keeping other leg extended out straight.",
"execution": "Simultaneously alternate leg positions by straightening bent leg behind, while bending straight leg forward. Repeat.",
"comments": "Attempt to straighten hip each stroke, while maintaining approximate height of hips from floor throughout movement. Dismount by removing straps, while kneeling or after sitting on one side of hip before rotating body to seated position. See Suspended Prone Feet MountDismount. This exercise can be performed on TRX style suspension trainer. Flexion and extension of knees are passive. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible, as in Suspended Jackknife where both legs are pulled in simultaneously. Also see Spot Reduction Myth and Lower Ab Myth. Easier Movement can be made easier by lying closer under anchor of suspension trainer. Harder Movement can be made more challenging by lying further forward, away horizontally from anchor of suspension trainer.",
"antagonist stabilizers": "trapeziuslower, trapeziusmiddle, rhomboids, erectorspinae",
"dynamic stabilizers": "quadriceps",
"stabilizers": "tricepsbrachii, rectusabdominis, quadriceps, serratusanterior, pectoralissternal, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsSTPike":{"id": "1",
"exerciseid": "STPike",
"musclegroup": "Hips",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Suspended Pike",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on floor facing suspension trainer loops in low position. Place right foot in left lower loop. Cross left leg over right leg placed in right lower loop. Turn body to right and place hands on floor shoulder width apart. Turn body to kneel on hands and knees. Reposition hands (shoulder width or slightly wider) at desired distance from suspension trainer so that body is square with suspension trainer straps. With arms straight, raise knees from ground, so body is supported by arms and suspension trainer.",
"execution": "Raise rear end up as high as possible by bending hips. Pull feet toward hands, while keeping knees straight. Return by extending hips to original straight body position. Repeat.",
"comments": "Keep arms straight with shoulders positioned above hands. Dismount by removing straps while kneeling or after sitting on one side of hip before rotating body to seated position. See Suspended Prone Feet MountDismount. This exercise can be performed on TRX style suspension trainer. Flexion of shoulders are passive. Trapezius acts as Stabilizer in inverted position, whereas its middle and lower fibers act as Antagonist Stabilizers in plank position. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible, as in leghip raise. See Spot Reduction Myth and Lower Ab Myth. Easier Movement can be made easier by lying closer under anchor of suspension trainer. Alternately, allow knees to bend to decrease intensity. Suspended Jackknife Pike Harder Movement can be made more challenging by lying further forward, away horizontally from anchor of suspension trainer.",
"antagonist stabilizers": "trapeziuslower, trapeziusmiddle, rhomboids, erectorspinae",
"stabilizers": "trapeziusupper, obliques, tricepsbrachii, serratusanterior, pectoralissternal, trapeziusmiddle, deltoidanterior, trapeziuslower, rectusabdominis, quadriceps",
"synergists": "sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps",
"target": "iliopsoas"}}