{"HipsSMBentKneeGoodMorning":{"id": "0",
"exerciseid": "SMBentKneeGoodMorning",
"musclegroup": "Hips",
"equipment": "smith",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Smith Bent Knee Good-morning",
"utility": "",
"mechanics": "",
"force": "",
"preparation": "Position bar on back of shoulders. Disengage bar by rotating bar back. Grasp bar to sides.",
"execution": "Bend hips to lower torso forward until parallel to floor. Bend knees slightly during descent. Raise torso until hips are extended. Repeat.",
"comments": "Begin with light weight and add additional weight gradually to allow adequate adaptation. Throughout lift, keep back straight. Knees will have to bend more with those with less hamstring flexibility. Knees can be kept bent throughout movement. Also see straight leg Goodmorning, emphasizing Hamstrings.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "quadriceps, erectorspinae",
"synergists": "hamstrings, adductors",
"target": "gluteusmaximus"},"HipsSMDeadlift":{"id": "1",
"exerciseid": "SMDeadlift",
"musclegroup": "Hips",
"equipment": "smith",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Smith Deadlift",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand with shoulder width or narrower stance with feet flat beneath bar. Grasp bar with shoulder width or slightly wider mixed grip or slightly wider. Disengage bar by rotating bar back.",
"execution": "Return weight toward floor by bending hips back while allowing knees to bend forward slightly, keeping back straight and knees pointed same direction as feet. Lift bar by extending hips and knees to full extension. Pull shoulders back at top of lift if rounded. Return and repeat.",
"comments": "Throughout lift, keep hips low, shoulders high, arms and back straight. Knees should point same direction as feet throughout movement. Keep bar close to body to improve mechanical leverage. See Smith Deadlift under Erector Spinae. Also see Deadlift Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, trapeziusmiddle, erectorspinae, levatorscapulae, rhomboids",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "hamstrings, soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSMStiffLegDeadlift":{"id": "2",
"exerciseid": "SMStiffLegDeadlift",
"musclegroup": "Hips",
"equipment": "smith",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Smith Stiff Leg Deadlift",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand with shoulder width or narrower stance on elevated platform with thigh against bar. Grasp bar with shoulder width or slightly wider overhand grip. Disengage bar by rotating bar back.",
"execution": "With knees slightly bent, lower bar toward top of feet by bending hips. Keep waist straight, flexing only slightly at bottom. Lift bar by extending at hips until standing upright. Pull shoulders back slightly if rounded. Extend knees at top if desired. Repeat.",
"comments": "Lower back may bend slightly during full hip flexion. Target muscle is exercised isometrically if lower back does not bend. Begin with light weight and add additional weight gradually to allow adequate adaptation. Throughout lift, keep arms straight. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings. Full range of motion will vary from person to person. Those with less flexibility may have to bend their knees more or they may not even need to stand on platform. Knee can be kept bent throughout movement. See Dangerous Exercise Essay. Also see Straight Back Stiff Leg Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, trapeziusmiddle, levatorscapulae, trapeziuslower, rhomboids, quadriceps",
"synergists": "hamstrings, adductors, erectorspinae",
"target": "gluteusmaximus"},"HipsSMStrBackStiffLegDeadlift":{"id": "3",
"exerciseid": "SMStrBackStiffLegDeadlift",
"musclegroup": "Hips",
"equipment": "smith",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Smith Straight-back Stiff-leg Deadlift",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand with shoulder width or narrower stance with thigh against bar. Grasp bar with shoulder width or slightly wider overhand grip. Disengage bar by rotating bar back.",
"execution": "With knees bent, lower bar toward top feet by bending hips and keeping waist straight. Lift bar by extending at hips until standing upright. Pull shoulders back slightly if rounded. Extend knees at top if desired. Repeat.",
"comments": "Throughout lift, keep arms and back straight. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch. Full range of motion will vary from person to person depending on flexibility. Stand on elevated platform if smith machine does not allow full range of motion. Those with less flexibility may have to bend their knees more. Knees can be kept bent throughout movement. Also see Stiff Leg Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, levatorscapulae, trapeziusmiddle, erectorspinae, trapeziuslower, rhomboids, quadriceps",
"synergists": "hamstrings, adductors",
"target": "gluteusmaximus"},"HipsSMRearLunge":{"id": "4",
"exerciseid": "SMRearLunge",
"musclegroup": "Hips",
"equipment": "smith",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Smith Rear Lunge",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "With bar upper chest height, position bar on back of shoulders and grasp bar to sides. Place feet under bar or slightly forward. Straighten legs so weight is lifted. Disengage bar by rotating bar back. Place feet slightly forward.",
"execution": "Step back with one leg while bending supporting leg. Plant forefoot far back on floor. Lower body by flexing knee and hip of supporting leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward supporting leg and return rear leg next to supporting leg. Repeat movement with opposite legs, alternating between sides.",
"comments": "Keep torso upright during lunge flexible hip flexors are important. Forward knee should point same direction as foot throughout lunge. A long lunge with feet slightly forward emphasizes Gluteus Maximus short lunge with feet under the bar emphasizes Quadriceps.",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSMSingleLegSplitSquat":{"id": "5",
"exerciseid": "SMSingleLegSplitSquat",
"musclegroup": "Hips",
"equipment": "smith",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Smith Single Leg Split Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Place bench behind smith bar. With bar upper chest height, position bar on back of shoulders and grasp bar to sides. Place foot slightly forward under bar. Extend other leg back and place top of foot on bench. Disengage bar by rotating bar back.",
"execution": "Lower body by flexing knee and hip of front leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward leg. Repeat. Continue with opposite leg.",
"comments": "Keep torso upright during squat flexible hip flexors are important. Forward knee should point same direction as foot throughout movement. Keep foot flat on floor. Position foot slightly forward to distribute force on hip extensors. May also be referred to as Smith Bulgarian Squat.",
"stabilizers": "gluteusmedius, gluteusminimus, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSMSplitSquat":{"id": "6",
"exerciseid": "SMSplitSquat",
"musclegroup": "Hips",
"equipment": "smith",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Smith Split Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "With bar upper chest height, position bar on back of shoulders and grasp bar to sides. Place one foot forward and forefoot of other leg further back. Disengage bar by rotating bar back.",
"execution": "Lower body on other leg by flexing knees and hips of both legs until knee of rear leg is almost in contact with floor. Return to original straddled position by extending hips and knees of both legs. Repeat. Continue with opposite leg.",
"comments": "Keep torso upright during movement flexible hip flexors are important. Knees should point same direction as feet throughout movement. A forward foot further forward will emphasize Gluteus Maximus forward foot more closer under bar will emphasize Quadriceps.",
"stabilizers": "erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSMSquat":{"id": "7",
"exerciseid": "SMSquat",
"musclegroup": "Hips",
"equipment": "smith",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Smith Squat",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "With bar upper chest height, position bar on back of shoulders and grasp bar to sides. Place feet slightly forward. Disengage bar by rotating bar back.",
"execution": "Squat down by bending hips back while allowing knees to bend forward slightly, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Extend knees and hips until legs are straight. Return and repeat.",
"comments": "Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Smith Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSMSingleLegSquat":{"id": "8",
"exerciseid": "SMSingleLegSquat",
"musclegroup": "Hips",
"equipment": "smith",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Smith Single Leg Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "With bar upper chest height, position bar on back of shoulders and grasp bar to sides. Place feet slightly forward and cross lower leg above knee of supporting leg. Disengage bar by rotating bar back.",
"execution": "Bend knee slightly forward while allowing hips to bend, keeping back straight and knee pointed same direction of foot. Descend until thigh of supporting leg is just past parallel to floor. Extend knee and hip until leg is straight. Return and repeat.",
"comments": "Keep head facing forward, back straight and foot flat on floor equal distribution of weight through forefoot and heel. Forward knee should point same direction as foot throughout movement.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSMFrontSquat":{"id": "9",
"exerciseid": "SMFrontSquat",
"musclegroup": "Hips",
"equipment": "smith",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Smith Front Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "With bar upper chest height, grasp bar with overhand shoulder width grip. Position bar on front of shoulders with elbows forward and wrists hyperextended. Place feet slightly forward. Disengage bar by rotating bar back.",
"execution": "Squat down by bending hips back while allowing knees to bend forward , keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Extend knees and hips until legs are straight. Return and repeat.",
"comments": "Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefeet and heel. Knees should point same direction as feet throughout movement. Also see bodybuildingstyle Smith Squat and Smith Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, erectorspinae, pectoralisclavicular, levatorscapulae, serratusanterior, trapeziusmiddle, deltoidlateral, deltoidanterior, trapeziuslower",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSMHackSquat":{"id": "10",
"exerciseid": "SMHackSquat",
"musclegroup": "Hips",
"equipment": "smith",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Smith Hack Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand with back of thighs or gluteus against bar. Grasp bar from behind with overhand grip. Disengage bar by rotating bar back.",
"execution": "Squat down by bending knees forward while allowing hips to bend back behind, keeping back straight and knees pointed same direction as feet. Descend until thighs are too close to parallel to floor and bar is behind lower leg. Lift bar by extending hips and knees to full extension. Repeat.",
"comments": "Throughout lift, keep hips low, shoulders high, arms and back straight. Knees should point same direction as feet throughout movement. See Smith Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSMWideSquat":{"id": "11",
"exerciseid": "SMWideSquat",
"musclegroup": "Hips",
"equipment": "smith",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Smith Wide Squat",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "With bar upper chest height, position bar on back of shoulders and grasp bar to sides. Place feet wide, pointing outward 45 to 30. Disengage bar by rotating bar back.",
"execution": "Squat down by bending hips back while allowing knees to bend forward slightly, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Extend knees and hips until legs are straight. Return and repeat.",
"comments": "Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Smith Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"}}