{"WaistDBStraightLegDeadlift":{"id": "0",
"exerciseid": "DBStraightLegDeadlift",
"musclegroup": "Waist",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Dumbbell Straight Leg Deadlift",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand with shoulder width or narrower stance. Grasp dumbbells to sides.",
"execution": "With knees straight, lower dumbbells to top or sides of feet by bending hips. Allow hips to fall back and bend waist as dumbbell approaches feet. Lift dumbbells by extending hips and waist until standing upright. Pull shoulders back if rounded. Repeat.",
"comments": "Begin with very light weight and add additional weight gradually to allow lower back adequate adaptation. Throughout lift keep arms and knees straight. Keep dumbbells close to legs. Do not pause or bounce at bottom of lift. Lower back may bend slightly during full hip flexion phase. Do not lower weight beyond mild stretch throughout hamstrings and low back. Full range of motion will vary from person to person depending on flexibility. See Dangerous Exercise Essay.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, trapeziusmiddle, levatorscapulae, trapeziuslower, rhomboids",
"synergists": "hamstrings, gluteusmaximus, adductors",
"target": "erectorspinae"},"WaistDBOneArmStraightLegDeadlift":{"id": "1",
"exerciseid": "DBOneArmStraightLegDeadlift",
"musclegroup": "Waist",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Dumbbell One Arm Straight Leg Deadlift",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand with shoulder width or wide stance. Grasp dumbbell to side. Place opposite hand to side or behind low back.",
"execution": "With knees straight, lower dumbbell between feet by bending hips and twisting waist, so shoulder of weighted side is turned forward. Allow hips to fall back and waist to bend as dumbbell approaches floor. Lift dumbbell upward and back to side by extending hips and waist until standing upright. Pull shoulder back if rounded. Repeat. Perform exercise with opposite arm.",
"comments": "Begin with very light weight and add additional weight gradually to allow lower back adequate adaptation. Throughout lift, keep weighted arm and knees straight. Do not pause or bounce at bottom of lift or jerk weight from floor. Lower back may bend slightly during full hip flexion or it can be kept straight. Do not lower weight beyond mild stretch throughout hamstrings and low back. Full rang e of motion will vary from person to person depending on flexibility. See Dangerous Exercise Essay and Kettlebell Straightleg Deadlift.",
"antagonist stabilizers": "rectusabdominis",
"stabilizers": "latissimusdorsi, trapeziusupper, trapeziusmiddle, levatorscapulae, trapeziuslower, rhomboids",
"synergists": "hamstrings, gluteusmaximus, quadratuslumborum, adductors, obliques",
"target": "erectorspinae"}}