{"HipsCBHipAbduction":{"id": "0",
"exerciseid": "CBHipAbduction",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "HipAbductor",
"name": "Cable Hip Abduction",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Stand in front of low pulley facing to one side. Attach cable cuff to far ankle. Step out away from stack and grasp ballet bar. Stand on near foot and allow far leg to cross in front.",
"execution": "Move leg to opposite side of low pulley by abduction hip. Return and repeat. Turn around and continue with opposite leg.",
"comments": "See ROM Criteria and Spot Reduction Myth.",
"stabilizers": "Hip Abductors (opposite)",
"synergists": "gluteusmedius, gluteusminimus, tensorfasciaelatae",
"target": "Hip Abductors (listed below)"},"HipsCBLyingHipInternalRotation":{"id": "1",
"exerciseid": "CBLyingHipInternalRotation",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "HipAbductor",
"name": "Cable Lying Hip Internal Rotation",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Attach cable ankle cuff to ankle, furthest low pulley. Step near foot over cable and lie prone perpendicular to cable. Bend knee 90 so attached ankle crosses over resting straight leg nearest pulley. Adjust positioning of legs slightly away from cable pulley so slight stretch is felt in hip.",
"execution": "Keeping knee of attached leg bent approximately 90, pull cable attachment away from pulley by rotating hip as far as possible. Return leg to original position toward pulley and repeat. Place ankle cuff on opposite leg and continue lying opposite direction.",
"comments": "Exercise name is somewhat counterintuitive since direction of rotation is relative to movement of hip, or thigh, not bent leg. For example, in this exercises, internal rotation of hip causes front of thigh to turn inward despite bent leg moving outward. Incidentally, if knee were straight during internal rotation of thigh, foot would move inward.",
"stabilizers": "hip#abduction, obliques",
"synergists": "gluteusmedius, gluteusminimus, tensorfasciaelatae",
"target": "Hip Internal Rotators (listed below)"},"HipsCBSeatedHipInternalRotation":{"id": "2",
"exerciseid": "CBSeatedHipInternalRotation",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "HipAbductor",
"name": "Cable Seated Hip Internal Rotation",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on bench or chair with low pulley to side. Attach cable ankle cuff to ankle furthest pulley. Place foot of stationary leg just forward of foot attached to cable. Grasp bench and handle bar on cable column if available. Position thighs of both legs side by side, perpendicular to cable. Raise foot attached to cable slightly off of floor.",
"execution": "Keeping knee of attached leg bent approximately 90, pull cable attachment away from pulley by rotating hip as far as possible. Return foot behind stationary foot and toward pulley. Repeat. Place ankle cuff on opposite leg and continue facing opposite direction.",
"comments": "Height of knee on exercising leg may require subtle adjustment during movement to permit clearance of traveling foot above floor. Gluteus Maximus will be activated as stabilizer on heavier loads when participant pushes stationary foot onto floor, thereby anchoring lower body as hip abductors keep thighs in place. Exercise name is somewhat counterintuitive since direction of rotation is relative to movement of hip, or thigh, not bent leg. For example, in this exercise, internal rotation of hip causes front of thigh to turn inward despite bent leg moving outward. Incidentally, if knee was straight during internal rotation of thigh, foot would move inward.",
"stabilizers": "pectineus, gracilis, gluteusmaximus, adductors",
"synergists": "hipexernalrotators, gluteusmedius, gluteusminimus, tensorfasciaelatae",
"target": "Hip Internal Rotators (listed below)"}}