{"CalvesWTDonkeyCalfRaise":{"id": "0",
"exerciseid": "WTDonkeyCalfRaise",
"musclegroup": "Calves",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Gastrocnemius",
"name": "Weighted Donkey Calf Raise",
"utility": "Basic",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Stand on edge of platform, toes and balls of feet on calf block with arches and heels extending off. Bend over and grasp knee high bar (as shown) or place forearms on thigh high surface (see example). Allow training partner to mount hips or lower back from bench.",
"execution": "Raise heels by extending ankles as high as possible. Lower heels by bending ankles until calves are stretched. Repeat.",
"comments": "Torso should be approximately parallel to floor. Keep knees straight throughout exercise or bend knees slightly only during stretch. Quadriceps serve as Synergists muscle if knees are bent slightly during stretch. Exercise is more challenging with training partner toward hips sitting upright. Also, training partner can hold additional weight in arms. See Calf Exercise Analyses.",
"stabilizers": "serratusanterior, pectoralissternal, pectoralisclavicular",
"synergists": "soleus",
"target": "gastrocnemius"},"CalvesWTSingleLegCalfRaise":{"id": "1",
"exerciseid": "WTSingleLegCalfRaise",
"musclegroup": "Calves",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Gastrocnemius",
"name": "Weighted Single Leg Calf Raise",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Hang weight from dip belt around waist. Position toes and ball of foot on calf block end of platform with heel and arch extending off. Place hand or hands on support for balance. Lift other leg to rear by bending knee.",
"execution": "Raise heel by extending ankle as high as possible. Lower heel by bending ankle until calf is stretched. Repeat. Continue with opposite leg.",
"comments": "Keep knee straight throughout exercise or bend knee slightly only during stretch. Quadriceps serve as synergists muscle if knee is bent slightly during stretch. Use lighter load if you need to assist with hands used for support. See Calf Exercise Analyses.",
"stabilizers": "gluteusmedius, gluteusminimus, quadratuslumborum, obliques",
"synergists": "soleus",
"target": "gastrocnemius"}}