{"WaistBWLyingTwist":{"id": "0",
"exerciseid": "BWLyingTwist",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Lying Twist",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie on back on floor or mat with arms extended out to sides. Raise legs upward with knees slightly bent.",
"execution": "Lower legs to one side until side of thigh is on floor. Raise and lower legs to opposite side. Repeat.",
"comments": "Maintain knee position throughout movement. See Spot Reduction Myth. Easier For less resistance, bend knees more. Lying Bent Knee Twist Harder Place exercise ball between lower legs or medicine ball between bent knees. Weighted Lying TwistWeighted bentknee Lying Twist.",
"stabilizers": "deltoidposterior, trapeziusmiddle, tricepsbrachii, rhomboids, trapeziuslower, adductors",
"synergists": "iliopsoas, quadratuslumborum, erectorspinae",
"target": "obliques"},"WaistBWInclineTwistingSitUp":{"id": "1",
"exerciseid": "BWInclineTwistingSitUp",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Incline Twisting Situp",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Hook feet under foot or ankle brace and lie supine on incline bench with hips and knees bent. Place hands behind neck.",
"execution": "Flex and twist waist to one direction while raising torso from bench by bending hips. Return until back of shoulders contact padded incline board. Repeat to opposite side alternating twists.",
"comments": "Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. If no knee support is built in to incline board, ball can be placed under legs. If upper back does not come completely down at end of movement, abdominal muscles may only be isometrically involved in exercise. Pectineus, Adductor Longus, and Brevis do not assist in hip flexion since hips are already initially bent. Knee flexors may be involved as stabilizers if incline is steep and no calf support is used. See Spot Reduction Myth. Easier Movement can be made easier by lowering incline, performing movement on horizontal surface, or placing arms further down away from head. Twisting SitupIncline Twisting Situp (arms on chest) Harder Exercise can be made more challenging by placing hands further up on head or beyond head. See Arm Position During Waist Exercises. Exercise can also be performed on higher incline board or with additional weight. Weighted Incline Twisting Situp (Advanced)",
"stabilizers": "tibialisanterior",
"synergists": "iliopsoas, sartorius, tensorfasciaelatae, rectusabdominis, quadriceps",
"target": "obliques"},"WaistBWTwistingSitUpX":{"id": "2",
"exerciseid": "BWTwistingSitUpX",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Twisting Situp (arms crossed)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Place feet under foot bar or low overhanging stationary object. Lie supine on floor, mat, or situp bench with hips and knees bent. Cross arms on chest.",
"execution": "Flex and twist waist to one direction while raising torso from bench by bending hips. Return until back of shoulders contact floor or mat. Repeat to opposite side alternating twists.",
"comments": "If upper back does not come completely down at end of movement, abdominal muscles may only be isometrically involved in exercise. Pectineus, Adductor Longus, and Brevis do not assist in hip flexion since hips are already initially bent. See Spot Reduction Myth. Easier Movement can be made easier by placing arms further down away from head. Exercise can also be performed on declined bench. Harder Exercise can be made more challenging by placing hands further up on head or beyond head. See Arm Position During Waist Exercises. Exercise can also be performed on incline board or with additional weight. Incline Twisting Situp (hands on neck)Weighted Twisting Situp",
"stabilizers": "tibialisanterior",
"synergists": "iliopsoas, sartorius, tensorfasciaelatae, rectusabdominis, quadriceps",
"target": "obliques"},"WaistBWSideCrunch":{"id": "3",
"exerciseid": "BWSideCrunch",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Side Crunch",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie upper back supine on floor or mat. With both legs together, knees and hips bent, position outside of leg down to side. Place one hand base on of neck or place arms across upper chest.",
"execution": "Flex waist, raising upper torso off mat or floor. Return until back of shoulders return to mat or floor. Repeat and continue with movement in opposite position.",
"comments": "Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. See Spot Reduction Myth. Easier Movement can be made easier by placing arms further down, away from head (eg arms crossed on chest). See Arm Position During Waist Exercises. Harder Exercise can be made more challenging by placing both hands behind lower part of neck or even more difficult by placing hands further up on head or beyond head. Exercise can also be performed with additional weight. Weighted Side Crunch",
"stabilizers": "No significant stabilizers",
"synergists": "rectusabdominis",
"target": "obliques"},"WaistBWTwistingSitUp":{"id": "4",
"exerciseid": "BWTwistingSitUp",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Twisting Situp",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Place feet under foot bar or low overhanging stationary object. Lie supine on floor, mat, or situp bench with hips and knees bent. Place hands behind neck.",
"execution": "Flex and twist waist to one direction while raising torso from bench by bending hips. Return until back of shoulders contact floor or mat. Repeat to opposite side alternating twists.",
"comments": "Feet can be held down by partner instead of foot bar. Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. If upper back does not come completely down at end of movement, abdominal muscles may only be isometrically involved in exercise. Pectineus, Adductor Longus, and Brevis do not assist in hip flexion since hips are already initially bent. See Spot Reduction Myth. Easier Movement can be made easier by placing arms further down away from head. Twisting Situp (arms crossed) Harder Exercise can be made more challenging by placing hands further up on head or beyond head. See Arm Position During Waist Exercises. Exercise can also be performed on incline board or with additional weight. Incline Twisting Situp (arms on neck)Weighted Twisting Situp",
"stabilizers": "tibialisanterior",
"synergists": "iliopsoas, sartorius, tensorfasciaelatae, rectusabdominis, quadriceps",
"target": "obliques"},"WaistBWTwistingCrunch":{"id": "5",
"exerciseid": "BWTwistingCrunch",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Twisting Crunch",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie supine on mat with lower legs on bench. Place hands behind neck or head.",
"execution": "Flex and twist waist to raise upper torso from mat to one side. Return until back of shoulders contact mat. Repeat to opposite side alternating twists.",
"comments": "Leg elevation keeps pelvis tilted back keeping low back on mat. Certain individuals may need to keep their neck in neutral position with space between their chin and sternum, particularly with their hands are behind their heads. See Spot Reduction Myth. Easier Movement can be made by crossing arms on chest. Twisting Crunch (arms on chest) Harder Exercise can be made more challenging by placing hands further up on or beyond head. See Arm Position During Waist Exercises. Exercise can also be performed on incline board or with additional weight. Weighted Twisting CrunchIncline Twisting Crunch",
"synergists": "iliopsoas, rectusabdominis",
"target": "obliques"},"WaistBWSideBridge":{"id": "6",
"exerciseid": "BWSideBridge",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Side Bridge",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Lie on side on mat. Place forearm on mat under shoulder perpendicular to body. Place upper leg directly on top of lower leg and straighten knees and hips.",
"execution": "Raise hips upward by lateral flexion of spine. Lower to original position and repeat. Repeat with opposite side.",
"comments": "In addition to lateral flexion of spine, lower hip abducts and upper hip adducts. Exercise can also be performed isometrically, see Side Plank. Also see Spot Reduction Myth. Easier Exercise can be performed with bent knees. Movement can also be made easier by angling body up against wall, horizontal bar or platform. Bent Knee Side Bridge Harder Exercise can be made more challenging with added weight on hip.",
"stabilizers": "latissimusdorsi, pectoralisminor, levatorscapulae, pectoralissternal",
"synergists": "gracilis, gluteusmedius, tensorfasciaelatae, trapeziuslower, serratusanterior, iliopsoas, supraspinatus, trapeziusmiddle, gluteusminimus, quadratuslumborum, erectorspinae, pectineus, gluteusmaximus, deltoidlateral, adductors",
"target": "obliques"},"WaistBWAngledSideBridge":{"id": "7",
"exerciseid": "BWAngledSideBridge",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Angled Side Bridge",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Place forearm on padded elevated surface, positioned perpendicular to body. Position feet out away from elevated surface, one foot in front of other with hips and knees straight. Place free hand on upper hip and allow lower hip and waist to bend downward.",
"execution": "Raise hips upward by lateral flexion of spine. Lower to original position and repeat. Repeat with opposite side.",
"comments": "One of very few body weight exercises that directly exercises side deltoid in relatively full range of motion. In addition to lateral flexion of spine, lower hip abducts and upper hip adducts. See Spot Reduction Myth. Easier Movement can be made easier by positioning forearm on higher elevated surface. Harder Exercise can be made more challenging by propping forearm on lower height surface. Exercise is hardest when performed off of floor. Side Bridge",
"stabilizers": "latissimusdorsi, pectoralisminor, pectoralissternal",
"synergists": "levatorscapulae, trapeziusmiddle, gluteusminimus, gluteusmaximus, deltoidlateral, adductors, trapeziuslower, gracilis, gluteusmedius, tensorfasciaelatae, serratusanterior, iliopsoas, supraspinatus, quadratuslumborum, erectorspinae, pectineus",
"target": "obliques"},"WaistBWInclineTwistingCrunchX":{"id": "8",
"exerciseid": "BWInclineTwistingCrunchX",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Incline Twisting Crunch (arms crossed)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Hook feet under foot bar and lie supine on incline bench with hips bent. Cross arms on chest.",
"execution": "Flex and twist waist to raise upper torso from bench to one side. Return until back of shoulders contact padded incline board. Repeat to opposite side alternating twists.",
"comments": "If no knee support is built in to incline board, ball can be placed under legs. Hip and knee flexors may be involved as stabilizers if incline is steep and no calf support is used. See Spot Reduction Myth. Easier To make this movement easier, perform twisting crunches on lower height incline or on flat surface. Twisting Crunch (arms crossed) Harder Exercise can be made more challenging by placing hands further up toward head. See Arm Position During Waist Exercises. Exercise can also be performed on higher incline board or with additional weight. Incline Twisting Crunch (arms on neck)Weighted Incline Twisting Crunch",
"stabilizers": "tibialisanterior",
"synergists": "iliopsoas, rectusabdominis",
"target": "obliques"},"WaistBWInclineTwistingCrunch":{"id": "9",
"exerciseid": "BWInclineTwistingCrunch",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Incline Twisting Crunch",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Hook feet under foot bar and lie supine on incline bench with hips bent. Place hands behind neck.",
"execution": "Flex and twist waist to raise upper torso from bench to one side. Return until back of shoulders contact padded incline board. Repeat to opposite side alternating twists.",
"comments": "Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. If no knee support is built in to incline board, ball can be placed under legs. Hip and knee flexors may be involved as stabilizers if incline is steep and no calf support is used. See Spot Reduction Myth. Easier To make this movement easier, place arms lower on body or perform on lower height incline or on flat surface. Incline Twisting Crunch (arms crossed)Twisting Crunch Harder Exercise can be made more challenging by placing hands further up toward head. See Arm Position During Waist Exercises. Exercise can also be performed on higher incline board or with additional weight. Weighted Incline Twisting Crunch",
"stabilizers": "tibialisanterior",
"synergists": "iliopsoas, rectusabdominis",
"target": "obliques"},"WaistBWInclineTwistingSitUpX":{"id": "10",
"exerciseid": "BWInclineTwistingSitUpX",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Incline Twisting Situp (arms crossed)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Hook feet under foot or ankle brace and lie supine on incline bench with hips and knees bent. Cross arms on chest.",
"execution": "Flex and twist waist to one direction while raising torso from bench by bending hips. Raise crossed arm over opposite knees at top. Return until back of shoulders contact padded incline board. Repeat to opposite side alternating twists.",
"comments": "Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. If no knee support is built in to incline board, ball can be placed under legs. If upper back does not come completely down at end of movement, abdominal muscles may only be isometrically involved in exercise. Pectineus, Adductor Longus, and Brevis do not assist in hip flexion since hips are already initially bent. Knee flexors may be involved as stabilizers if incline is steep and no calf support is used. See Spot Reduction Myth. Easier Movement can be made easier by lowering incline, performing movement on horizontal surface, or extending arms over legs. Twisting Situp Harder Exercise can be made more challenging by placing hands further up near head. See Arm Position During Waist Exercises. Exercise can also be performed on higher incline board or with additional weight. Incline Situp (arms behind neck)Weighted Incline Twisting Situp",
"stabilizers": "tibialisanterior",
"synergists": "iliopsoas, sartorius, tensorfasciaelatae, rectusabdominis, quadriceps",
"target": "obliques"},"WaistBWBentKneeSideBridge":{"id": "11",
"exerciseid": "BWBentKneeSideBridge",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Bent Knee Side Bridge",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Lie on side on mat. Place forearm on mat under shoulder perpendicular to body. Bend knees at a right angle. Place upper leg directly on top of lower leg and straighten hips.",
"execution": "Raise hips upward by lateral flexion of spine. Lower to original position and repeat. Repeat with opposite side.",
"comments": "In addition to lateral flexion of spine, lower hip abducts and upper hip adducts. Exercise can also be performed isometrically, see Bent Knee Side Plank. Gracilis of upper leg enters into active insufficiency with hip extended and knee flexed. Also see Spot Reduction Myth. Easier Movement can be made easier by angling body up against wall with legs straight. Harder Exercise can be made more challenging with knees straight. Side Bridge",
"stabilizers": "latissimusdorsi, pectoralisminor, pectoralissternal",
"synergists": "levatorscapulae, gluteusmedius, tensorfasciaelatae, trapeziuslower, serratusanterior, iliopsoas, supraspinatus, trapeziusmiddle, gluteusminimus, quadratuslumborum, erectorspinae, pectineus, gluteusmaximus, deltoidlateral, adductors",
"target": "obliques"},"WaistBWBentKneeSideBridge":{"id": "12",
"exerciseid": "BWBentKneeSideBridge",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Bent Knee Side Bridge",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Lie on side on mat. Place forearm on mat under shoulder perpendicular to body. Bend knees at a right angle. Place upper leg directly on top of lower leg and straighten hips.",
"execution": "Raise hips upward by lateral flexion of spine. Lower to original position and repeat. Repeat with opposite side.",
"comments": "In addition to lateral flexion of spine, lower hip abducts and upper hip adducts. Exercise can also be performed isometrically, see Bent Knee Side Plank. Gracilis of upper leg enters into active insufficiency with hip extended and knee flexed. Also see Spot Reduction Myth. Easier Movement can be made easier by angling body up against wall with legs straight. Harder Exercise can be made more challenging with knees straight. Side Bridge",
"stabilizers": "latissimusdorsi, pectoralisminor, pectoralissternal",
"synergists": "levatorscapulae, gluteusmedius, tensorfasciaelatae, trapeziuslower, serratusanterior, iliopsoas, supraspinatus, trapeziusmiddle, gluteusminimus, quadratuslumborum, erectorspinae, pectineus, gluteusmaximus, deltoidlateral, adductors",
"target": "obliques"},"WaistBWBallSideBend":{"id": "13",
"exerciseid": "BWBallSideBend",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Side Bend (on stability ball)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie on ball on side of torso, waist, and hip. Position legs outward with feet on floor or against floor board.",
"execution": "Raise side of torso up by lateral flexing waist. Lower torso back on ball and repeat. Position other side on ball and repeat with opposite side.",
"comments": "See alternative form. Also see Spot Reduction Myth and Arm Position During Waist Exercises. Easier Movement can be made easier by positioning hip low on ball. For less resistance, place upper arm over hip. Harder Exercise can be made more challenging by positioning hip higher on ball. In which case, feet may be placed against base of wall for stability. Movement can also be performed with added weight. Weighted Ball Side Bend",
"stabilizers": "No significant stabilizers",
"synergists": "iliopsoas, quadratuslumborum, erectorspinae",
"target": "obliques"},"WaistBWTwistingCrunchX":{"id": "14",
"exerciseid": "BWTwistingCrunchX",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Twisting Crunch (arms crossed)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie supine on mat with lower legs on bench. Cross arms on chest.",
"execution": "Flex and twist waist to raise upper torso from mat to one side. Return until back of shoulders contact mat. Repeat to opposite side alternating twists.",
"comments": "Leg elevation keeps pelvis tilted back keeping low back on mat. See Spot Reduction Myth. Easier Movement can be made easier by placing arms further down away from head or extended up above knees. Deconditioned individuals can start on slightly declined board. Harder Exercise can be made more challenging by placing hands further up toward head. See Arm Position During Waist Exercises. Exercise can also be performed on incline board or with additional weight. Twisting CrunchWeighted Twisting CrunchIncline Twisting Crunch",
"synergists": "iliopsoas, rectusabdominis",
"target": "obliques"},"WaistBWBentKneeLyingTwist":{"id": "15",
"exerciseid": "BWBentKneeLyingTwist",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Bent-knee Lying Twist",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie on back on floor or mat with arms extended out to sides. Raise bent legs so thighs are vertical and lower legs are horizontal.",
"execution": "Lower legs to one side until side of thigh is on floor. Raise and lower legs to opposite side. Repeat.",
"comments": "Maintain knee position throughout movement. See Spot Reduction Myth. Easier Movement can be made easier by tucking legs closer toward body, thereby decreasing length of resistance lever. Harder For greater resistance, place medicine ball between knees or straighten legs. Weighted Bentknee Lying TwistLying Straight Leg Lying Twist",
"stabilizers": "deltoidposterior, trapeziusmiddle, tricepsbrachii, rhomboids, trapeziuslower, adductors",
"synergists": "iliopsoas, quadratuslumborum, erectorspinae",
"target": "obliques"},"WaistBWExerciseBallPlankTwist":{"id": "16",
"exerciseid": "BWExerciseBallPlankTwist",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Plank Twist (on stability ball)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Kneel with chest or waist on exercise ball. Dive over top and place hands on floor with arms extended down supporting upper body. While keeping body horizontal, walk hands further away from ball until thighs are positioned on top of ball. Bend knees so feet are up above knees.",
"execution": "Rotate hips so thighs roll over top of ball to one side. Rotate to opposite side and repeat.",
"comments": "See Spot Reduction Myth.",
"stabilizers": "pectoralisclavicular, tricepsbrachii, tensorfasciaelatae, serratusanterior, pectoralissternal, iliopsoas, sartorius, deltoidanterior, pectineus, rectusabdominis, adductors, quadriceps",
"synergists": "iliopsoas, quadratuslumborum, erectorspinae",
"target": "obliques"},"WaistBWSideCrunchOnBall":{"id": "17",
"exerciseid": "BWSideCrunchOnBall",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Side Crunch (on stability ball)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on exercise ball. Walk forward on ball and lie back on ball with shoulders and head hanging off. Switch position of feet by positioning bent leg under extended leg so waist is twisted with hip positioned sideways. Gently hyperextend back to contour of ball. Place hands behind neck or cross arms across chest.",
"execution": "Flex waist to raise upper torso. Return to original position and repeat. Position legs in opposite position and continue.",
"comments": "Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. Some individuals may experience low back discomfort if hips are not bent, so they must use smaller ball size or lower their hip position on ball. Also see Spot Reduction Myth and Arm Position During Waist Exercises. Easier Movement can be made easier by positioning hips low on ball or placing arms further down away from head (eg arms crossed on chest). See Arm Position During Waist Exercises. Harder Exercise can be made more challenging by using positioning ball lower on back and hips higher or adding additional weight. In which case, feet may be placed against base of wall for stability. Weighted Side Crunch (on stability ball)",
"stabilizers": "No significant stabilizers",
"synergists": "rectusabdominis",
"target": "obliques"},"WaistBWTwistingBallCrunch":{"id": "18",
"exerciseid": "BWTwistingBallCrunch",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Twisting Crunch (on stability ball)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on exercise ball. Walk forward on ball and lie back on ball with shoulders and head hanging off, and knees and hips bent. Gently hyperextend back to contour of ball. Hold plate behind neck or on chest with both hands or use no weight.",
"execution": "Flex waist to raise upper torso. Return to original position. Repeat.",
"comments": "Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. Some individuals may experience low back discomfort if hips are not bent, so they must use smaller ball size or lower their hip position on ball. Also Spot Reduction Myth. Easier Movement can be made by crossing arms on chest. Movement can also be made easier by positioning hips low on ball. Harder Exercise can be made more challenging by placing hands further up on or beyond head. See Arm Position During Waist Exercises. Exercise can also be made more challenging by positioning ball lower on back and hips higher. Exercise can also be performed on incline board or with additional weight. Weighted Twisting Ball Crunch",
"stabilizers": "No significant stabilizers",
"synergists": "rectusabdominis",
"target": "obliques"}}