{"ThighsBBLunge":{"id": "0",
"exerciseid": "BBLunge",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Barbell Lunge",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Clean bar from floor or dismount bar from rack. From rack with barbell upper chest height, position bar on back of shoulders and grasp barbell to sides.",
"execution": "Lunge forward with first leg. Land on heel, then forefoot. Lower body by flexing knee and hip of front leg until knee of rear leg is almost in contact with floor. Return to original standing position by forcibly extending hip and knee of forward leg. Repeat by alternating lunge with opposite leg.",
"comments": "Keep torso upright during lunge flexible hip flexors are important. Lead knee should point same direction as foot throughout lunge. A long lunge emphasizes Gluteus Maximus short lunge emphasizes Quadriceps.",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, tibialisanterior, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsBBRearLunge":{"id": "1",
"exerciseid": "BBRearLunge",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Barbell Rear Lunge",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "From rack with barbell upper chest height, position bar on back of shoulders and grasp barbell to sides. Dismount bar from rack.",
"execution": "Step back with one leg while bending supporting leg. Plant forefoot far back on floor. Lower body by flexing knee and hip of supporting leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward supporting leg and return rear leg next to supporting leg. Repeat movement with opposite legs alternating between sides.",
"comments": "Keep torso upright during lunge flexible hip flexors are important. Forward knee should point same direction as foot throughout lunge. A long lunge emphasizes Gluteus Maximus short lunge emphasizes Quadriceps.",
"stabilizers": "gluteusmedius, gluteusminimus, quadratuslumborum, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsBBSideLunge":{"id": "2",
"exerciseid": "BBSideLunge",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Barbell Side Lunge",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Clean bar from floor or dismount bar from rack. From rack with barbell upper chest height, position bar on back of shoulders and grasp barbell to sides.",
"execution": "Lunge to one side with first leg. Land on heel, then forefoot. Lower body by flexing knee and hip of lead leg, keeping knee pointed same direction of foot. Return to original standing position by forcibly extending hip and knee of lead leg. Repeat by alternating lunge with opposite leg.",
"comments": "Keep torso upright during lunge. Lead knee should point same direction as foot throughout lunge. Flexible hip adductors will allow fuller range of motion. A long lunge emphasizes Gluteus Maximus short lunge emphasizes Quadriceps.",
"stabilizers": "tibialisanterior, gluteusmedius, gluteusminimus, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsBBWalkingLunge":{"id": "3",
"exerciseid": "BBWalkingLunge",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Barbell Walking Lunge",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Position barbell on back of shoulders and grasp bar to sides.",
"execution": "Step forward with first leg. Land on heel, then forefoot. Lower body by flexing knee and hip of front leg until knee of rear leg is almost in contact with floor. Stand on forward leg with assistance of rear leg. Lunge forward with opposite leg. Repeat by alternating lunge with opposite legs.",
"comments": "Keep torso upright during lunge flexible hip flexors are important. Lead knee should point same direction as foot throughout lunge. A long lunge emphasizes Gluteus Maximus short lunge emphasizes Quadriceps. Tibilalis Anterior is exercised eccentrically during landing on heel.",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, tibialisanterior, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsBBSingleLegSplitSquat":{"id": "4",
"exerciseid": "BBSingleLegSplitSquat",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Barbell Single Leg Split Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand facing away from bench. Position bar on back of shoulders and grasp barbell to sides. Extend leg back and place top of foot on bench.",
"execution": "Squat down by flexing knee and hip of front leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward leg. Repeat. Continue with opposite leg.",
"comments": "Keep torso upright during squat flexible hip flexors are important. Forward knee should point same direction as foot throughout movement. Also known as Bulgarian Squat.",
"stabilizers": "gluteusmedius, gluteusminimus, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsBBSideSplitSqaut":{"id": "5",
"exerciseid": "BBSideSplitSqaut",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Barbell Side Split Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Place barbell on back of shoulders and grasp bar on each side. Stand with feet wide apart foot of lead leg angled out to side.",
"execution": "Lower body toward side of angled foot by bending knee and hip of lead leg while keeping opposite leg only slightly bent. Return to original standing position by extending hip and knee of lead leg. Repeat.",
"comments": "Keep torso upright and knee of lead leg pointed same direction of foot. Flexible hip adductors and stronger legs will allow fuller range of motion. A wider stance emphasizes Gluteus Maximus slightly narrower straddled stance emphasizes Quadriceps. Do not position feet too close nor too wide.",
"stabilizers": "gluteusmedius, gluteusminimus, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsBBSingleLegSquat":{"id": "6",
"exerciseid": "BBSingleLegSquat",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Barbell Single Leg Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand with arms extended out in front holding barbell. Balance on one leg with opposite leg extended straight leg forward as high as possible.",
"execution": "Squat down as far as possible while keeping leg elevated off of floor. Keepsupporting knee pointed same direction as foot supporting. Raise body back up to original position until knee and hip of supporting leg is straight. Return and repeat. Continue with opposite leg.",
"comments": "Supporting knee should point same direction as foot throughout movement. Range of motion will be improved with greater leg strength and glute flexibility. Significant spinal flexion occurs at bottom of deep single leg squat to maintain center of gravity over foot. Erector Spinae becomes a stabilizer if spine is kept straight. An easier, alternative style is to place barbell on back of shoulders, cross lower leg above knee of supporting leg or wrap one foot around back of supporting leg.",
"stabilizers": "trapeziusupper, levatorscapulae, deltoidanterior, sartorius, trapeziusmiddle, gluteusminimus, deltoidlateral, trapeziuslower, rectusabdominis, pectoralisclavicular, gluteusmedius, tensorfasciaelatae, serratusanterior, wristextensors, iliopsoas, quadratuslumborum, obliques, pectineus, quadriceps",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "erectorspinae, soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsBBSplitSquat":{"id": "7",
"exerciseid": "BBSplitSquat",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Barbell Split Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Position barbell on back of shoulders and grasp barbell to sides. Stand with feet far apart one foot forward and other foot behind.",
"execution": "Squat down by flexing knee and hip of front leg. Allow heel of rear foot to rise up while knee of rear leg bends slightly until it almost makes contact with floor. Return to original standing position by extending hip and knee of forward leg. Repeat. Continue with opposite leg.",
"comments": "Knees should point same direction as feet throughout movement. Heel of rear foot can be kept elevated off floor throughout movement. Keep torso upright during squat flexible hip flexors are important. With feet further apart Gluteus Maximus is emphasized, Quadriceps are less emphasized.",
"stabilizers": "gluteusmedius, gluteusminimus, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsBBSquat":{"id": "8",
"exerciseid": "BBSquat",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Barbell Squat",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "From rack with barbell at upper chest height, position bar high on back of shoulders and grasp barbell to sides. Dismount bar from rack and stand with shoulder width stance.",
"execution": "Squat down by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Extend knees and hips until legs are straight. Return and repeat.",
"comments": "Keep head facing forward, back straight and feet flat on floor equal distribution of weight throughout forefoot and heel. Knees should point same direction as feet throughout movement. See Squat mount and dismountSpotting techniqueSpotting assistanceSide view ASideview B Also see Squat for Targeting Glutes and Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsBBFrontSquat":{"id": "9",
"exerciseid": "BBFrontSquat",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Barbell Front Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "From rack with barbell upper chest height, position bar in front of shoulders. Cross arms and place hands on top of barbell with upper arms parallel to floor. Dismount bar from rack.",
"execution": "Squat down by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel. Extend knees and hips until legs are straight. Return and repeat.",
"comments": "Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis. Also see weightlifting style Front Squat.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, erectorspinae, pectoralisclavicular, levatorscapulae, serratusanterior, supraspinatus, trapeziusmiddle, deltoidlateral, deltoidanterior, trapeziuslower",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsBBFullSquat":{"id": "10",
"exerciseid": "BBFullSquat",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Barbell Full Squat",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "From rack with barbell upper chest height, position barbell on back of shoulders and grasp bar to sides. Dismount bar from rack.",
"execution": "Squat down by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until knees and hips are fully bent. Extend knees and hips until legs are straight. Return and repeat.",
"comments": "Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. Hip and ankle flexibility is important for both execution and safety in this movement. Certain knee and low back problems may be aggravated by this exercise. See Squat Mount and Dismount. See Squat Analysis. See spotting technique and spotting assistance.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsBBHackSquat":{"id": "11",
"exerciseid": "BBHackSquat",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Barbell Hack Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Position barbell just behind legs. With feet flat on floor, squat down and grasp barbell from behind with overhand grip.",
"execution": "Lift bar by extending hips and knees to full extension. Squat down by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until thighs are close to parallel to floor and bar is behind lower leg. Repeat.",
"comments": "Throughout lift, keep hips low, shoulders high, arms and back straight. Knees should point same direction as feet throughout movement. See flawed demonstration showing depth of hack squat that is NOT sufficient and knees are NOT pointed same angle as feet. Individuals with short arm to torso ratio or protracted shoulder posture, may find this exercise very difficult to perform. See Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsSBSquat":{"id": "12",
"exerciseid": "SBSquat",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Safety Barbell Squat",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand facing safety barbell on rack upper chest height. Position head in yoke with padded bar around shoulders. Hands can be placed on ends of yoke (as shown) or on safety bar out to sides. Dismount bar from rack and step back.",
"execution": "Squat down by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Stand by extending hips and knees until legs are straight. Repeat.",
"comments": "Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. Exercise can also be performed holding onto supports or with long handled safety bar. Also see Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsSBSquatHandles":{"id": "13",
"exerciseid": "SBSquatHandles",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Safety Barbell Squat (long handles)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand facing safety barbell on rack upper chest height. Position head in yoke with padded bar around shoulders. Grasp ends of handles. Dismount bar from rack and step back.",
"execution": "Squat down by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Stand with or without assistance of arms, extending knees and hips until legs are straight. Repeat.",
"comments": "Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. Exercise can also be performed holding onto supports or with safety bar without bar handles. Also see Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsSBSquatSelfSpot":{"id": "14",
"exerciseid": "SBSquatSelfSpot",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Safety Barbell Squat (self-spotting)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand facing safety barbell on rack upper chest height. Place hands vertical rack supports. Position head in yoke with padded bar around shoulders. Dismount bar from rack and step back so body is upright at arms length from supports.",
"execution": "Squat down by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Stand with or without assistance of arms, extending hips and knees until legs are straight. Repeat.",
"comments": "Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. If handles are not available, horizontal bars on rack can be used for assistance if needed. Exercise can also be performed without holding onto supports. Also see Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusmiddle, tricepsbrachii, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "latissimusdorsi, pectoralisclavicular, tricepsbrachii, levatorscapulae, deltoidposterior, soleus, gluteusmaximus, teresmajor, adductors, rhomboids",
"target": "quadriceps"},"ThighsTBSquat":{"id": "15",
"exerciseid": "TBSquat",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Trap Bar Squat",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand on platform under loaded trap bar. Squat down until thighs are just past parallel to floor with knees pointed same direction as feet and feet flat on platform. Grasp handles to sides. Posture chest up with back arched tightly.",
"execution": "Lift weight upward by extending knees and hips until straight. Pull shoulders back at top of lift if rounded. Return weights to floor by bending hips back while allowing knees to bend forward. Repeat.",
"comments": "An inverted, squared openended trap bar is used in this demonstration. Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsBBSquatChains":{"id": "16",
"exerciseid": "BBSquatChains",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Barbell Squat (with chains)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand facing barbell, racked upper chest height, with thick chains hanging to floor on each side. Position bar high on back of shoulders and grasp barbell to sides. Dismount bar from rack and stand with shoulder width stance.",
"execution": "Squat down by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Extend knees and hips until legs are straight. Return and repeat.",
"comments": "Chains provide increasing resistance as barbell moves away from floor. Keep head facing forward, back straight and feet flat on floor equal distribution of weight throughout forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Mount and Dismount. See spotting technique and spotting assistance. Also see Squat for Targeting Glutes and Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsBBZercherSquat":{"id": "17",
"exerciseid": "BBZercherSquat",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Barbell Zercher Squat",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "From rack with barbell upper waist high, position forearms under bar and in front of bar with elbows shoulder width apart. Cross wrists and pull bar in close against body. Lift barbell from rack. Step back with wide stance, feet pointing out 2030.",
"execution": "Squat down by bending hips back while allowing knees to bend forward, keeping back straight, hands close to body, and knees pointed same direction as feet. Descend until thighs are near parallel. Extend knees and hips until legs are straight. Return and repeat.",
"comments": "Turning knuckles up places bar more on Brachioradialis rather than on more sensitive crook of elbow. Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement.. Also see rear side view. Zercher Squat was created by Ed Zercher, a strongman from 1930s. This style of squat removes axial loading and instead, places load in front of body allowing more upright torso position. Louie Simmons commits on the benefits of Zercher Squats It teaches you exactly how to squat. It teaches you to push your knees apart. Push your chest up. Push your buttocks out. The whole nine yards. The Zercher Squat also has carryover to activities of first responders, laborers, and strongman movements (1) Atlas Stone Event, (2) Africa Stone Carry, and (3) Yoke Carry.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, erectorspinae, pectoralisclavicular, levatorscapulae, brachioradialis, serratusanterior, pectoralissternal, bicepsbrachii, brachialis, supraspinatus, trapeziusmiddle, deltoidlateral, deltoidanterior, trapeziuslower",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsBBStepUp":{"id": "18",
"exerciseid": "BBStepUp",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Barbell Step-up",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand facing side of bench. Position bar on back of shoulders and grasp barbell to sides.",
"execution": "Place foot of first leg on bench. Stand on bench by extending hip and knee of first leg and place foot of second leg on bench. Step down with second leg by flexing hip and knee of first leg. Return to original standing position by placing foot of first leg to floor. Repeat first step with opposite leg, alternating first steps between legs.",
"comments": "Keep torso upright during exercise. Lead knee should point same direction as foot throughout movement. Stepping distance from bench emphasizes Gluteus Maximus stepping close to bench emphasizes Quadriceps.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gastrocnemius, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsBBLateralStepUp":{"id": "19",
"exerciseid": "BBLateralStepUp",
"musclegroup": "Thighs",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Barbell Lateral Step-up",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between two benches, one to each side. Position bar on back of shoulders and grasp barbell to sides.",
"execution": "Lift leg and place foot on bench to side slightly forward of straight knee. Stand on bench by straightening leg and pushing body upward. Step down returning feet to original position. Repeat with opposite leg alternating between legs.",
"comments": "Keep torso upright during exercise. Stepping knee should point same direction as foot. A modest degree of knee rotation occurs during this movement. See Controversial Exercises and Rotary Force in Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gastrocnemius, gluteusmaximus, adductors",
"target": "quadriceps"}}