{"BackBBPullover":{"id": "0",
"exerciseid": "BBPullover",
"musclegroup": "Back",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "LatissimusDorsi",
"name": "Barbell Pullover",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie upper back perpendicular on bench. Flex hips slightly. Grasp barbell from behind and position over chest with elbows bent slightly.",
"execution": "With elbows bent slightly, lower bar over and beyond head until shoulders are fully flexed or upper arms are approximately parallel to torso. Return and repeat.",
"comments": "Lower body extending off of bench acts as counter balance to resistance and keeps upper back fixed on bench. Avoid hips from raising up significantly. Actual range of motion is dependent upon individual shoulder flexibility. Keep elbows fixed at small bend throughout exercise. Either straight barbell or EZ barbell can be used. Also see Barbell Bent Arm Pullover.",
"stabilizers": "wristflexors, deltoidanterior, pectoralisclavicular, tricepsbrachii",
"synergists": "pectoralisminor, deltoidposterior, teresmajor, tricepsbrachii, levatorscapulae, pectoralissternal, rhomboids",
"target": "latissimusdorsi"},"BackBBBentArmPullover":{"id": "1",
"exerciseid": "BBBentArmPullover",
"musclegroup": "Back",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "LatissimusDorsi",
"name": "Barbell Bent Arm Pullover",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie upper back perpendicular on bench. Flex hips slightly. Grasp barbell from behind and position over chest with elbows bent approximately 90.",
"execution": "With elbow bent, lower bar over and just behind head until upper arm is approximately parallel to torso. Return and repeat.",
"comments": "Keep elbows bent approximately 90 throughout exercise. Keep hips from raising up significantly. Either straight barbell or EZ barbell can be used. Also see Barbell Pullover.",
"stabilizers": "wristflexors, deltoidanterior, pectoralisclavicular, tricepsbrachii",
"synergists": "pectoralisminor, deltoidposterior, teresmajor, tricepsbrachii, levatorscapulae, pectoralissternal, rhomboids",
"target": "latissimusdorsi"}}