{"NeckCBNeckFlx":{"id": "0",
"exerciseid": "CBNeckFlx",
"musclegroup": "Neck",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Sternocleidomastoid",
"name": "Cable Neck Flexion",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on bench facing away from middle pulley. Place neck in harness cable attachment. Place arms on lower thighs for support.",
"execution": "Move head away from pulley by bending neck forward until chin touches upper chest. Return head by hyperextending neck and repeat.",
"comments": "Positioning pulleyhigher will alter tension curve by decreasing effort required near initiation of concentric contraction while increasing effort required near end of concentric contraction. Positioning pulley slightly higher than what is shown will allow greater effort in middle of movement.",
"stabilizers": "rectusabdominis, obliques",
"synergists": "None",
"target": "sternocleidomastoid"},"NeckCBNeckFlxBelt":{"id": "1",
"exerciseid": "CBNeckFlxBelt",
"musclegroup": "Neck",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Sternocleidomastoid",
"name": "Cable Neck Flexion (with belt)",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Attach belt on low pulley cable by attaching carabiner on belt buckle. Grasp attached belt, face away from pulley, and place head in belt loop. With belt above ears, clamp belt snugly around head by tightly gripping ends close to back of midhead. With neck braced and assistance of arm, lunge forward to angle torso forward with feet staggered. Place hand on lower thigh for support.",
"execution": "Pull head forward and down by flexing neck until chin touches upper chest. Return by hyperextending neck until head is angled upward. Repeat.",
"comments": "Use neck to pull belt rather than allowing hand to assist. Keep clinched grip on belt against back of midhead throughout movement. Clamping belt higher up further from base of skull will permit torque throughout fuller range of motion, particularly range of motion nearer full flexion. Woven cotton or cloth belts tend to slip less from forehead. If belt slips from head, place small towel between belt and head. Cable carabiner slips to one side on square buckles and stresses belts structural integrity under heavy loads. Rounded buckle is more ideal since it provides more even stress on belt. Belts not made specifically for weight training may cause injury if they fail under load in which they were not designed. Exercise can also be performed off of rack with belt, nylon rope, and plate holder from wrist roller. Nylon rope offers less friction on smooth rounded fixed surface. Alternatively, nonnylon ropes can be used off of revolving barbell sleeve on smith machine. See Cable Neck Flexion with belt and rope",
"antagonist stabilizers": "erectorspinae",
"stabilizers": "rectusabdominis, obliques",
"synergists": "None",
"target": "sternocleidomastoid"},"NeckCBNeckRotationBelt":{"id": "2",
"exerciseid": "CBNeckRotationBelt",
"musclegroup": "Neck",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Sternocleidomastoid",
"name": "Cable Neck Rotation (with belt)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Place workout chair or bench with vertical back support facing to one side near adjustable height cable pulley. Adjust pulley approximately height of head when seated. Attach belt on low pulley cable by attaching carabiner on belt buckle. Sit on bench, grasp attached belt from side. Face toward cable pulley and place head in belt loop. With belt above ears, clamp belt snugly around head by tightly gripping ends close forehead. Position torso upright with feet wide apart and hand nearest cable pulley on lower thigh for added support.",
"execution": "Turn head away from pulley cable by rotating head away from pulley. Turn head back toward cable pulley and repeat. Turn seat the opposite direction or attach belt to pulley on opposite side and continue with other side.",
"comments": "Sit at distance away from pulley so weight does not bottom out at lowest range of motion. Keep clinched grip on belt against side of head throughout movement. Use heads friction on belt to pull belt rather than pushing with the hand used to keep belt tight around head. Keep back against back pad to minimize torso movement, reducing rotation below cervical spine. Woven cotton or cloth belts tend to slip less, particularly on bald heads. If belt slips from head, place small towel between belt and head. Cable carabiner slips to one side on square buckles and stresses belts structural integrity under heavy loads. Rounded buckle is more ideal since it provides more even stress on belt. Belts not made specifically for weight training may cause injury if they fail under load in which they were not designed. Exercise can also be performed off of rack with belt, nylon rope, and plate holder from wrist roller. Nylon rope offers less friction on smooth rounded fixed surface. Alternatively, nonnylon ropes can be used off of revolving barbell sleeve on smith machine. See Cable Neck Rotation with belt and rope.",
"other": "latissimusdorsi, trapeziusmiddle, pectoralisclavicular, levatorscapulae, pectoralissternal",
"synergists": "trapeziusupper, splenius, levatorscapulae, iliopsoas, quadratuslumborum, erectorspinae, obliques",
"target": "sternocleidomastoid"},"NeckCBNeckLtrFlxBelt":{"id": "3",
"exerciseid": "CBNeckLtrFlxBelt",
"musclegroup": "Neck",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Sternocleidomastoid",
"name": "Cable Lateral Neck Flexion (with belt)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Adjust pulley approximately height of neck or head when seated. Attach belt on low pulley cable by attaching carabiner on belt buckle. Sit on bench with pulley to one side and feet apart. Place head in belt loop. With belt above ears, clamp belt snugly around head by tightly gripping ends close to side of head. Pull torso upright by bracing opposite hand on far side of bench.",
"execution": "Pull head away from pulley cable by laterally flexing neck. Tilt head back toward cable pulley and repeat. Sit on bench the opposite direction and continue with other side.",
"comments": "Sit at distance away from pulley so weight does not bottom out at lowest range of motion. Keep clinched grip on belt against side of head throughout movement. Woven cotton or cloth belts tend to slip less, particularly on bald heads. If belt slips from head, place small towel between belt and head. Cable carabiner slips to one side on square buckles and stresses belts structural integrity under heavy loads. Rounded buckle is more ideal since it provides more even stress on belt. Belts not made specifically for weight training may cause injury if they fail under load in which they were not designed. Exercise can also be performed off of rack with belt, nylon rope, and plate holder from wrist roller. Nylon rope offers less friction on smooth rounded fixed surface. Alternatively, nonnylon ropes can be used off of revolving barbell sleeve on smith machine. See Cable Neck Lateral Flexion with belt and rope. See all muscle used in Lateral Flexion Atlantoccipical  AntlantoaxialCervical SpineThoracic  Lumbar Spine A degree of Thoracic  Lumbar Spine lateral flexion is typical involved in this movement. See animation of spinal lateral flexionduring neck lateral flexion.",
"other": "latissimusdorsi, trapeziusmiddle, pectoralisclavicular, levatorscapulae, pectoralissternal",
"synergists": "trapeziusupper, splenius, levatorscapulae, iliopsoas, quadratuslumborum, erectorspinae, obliques",
"target": "sternocleidomastoid"}}