{"ShouldersBBRearDeltRaise":{"id": "0",
"exerciseid": "BBRearDeltRaise",
"musclegroup": "Shoulders",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Barbell Rear Delt Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand holding barbell behind thighs or hips with arms straight down to sides.",
"execution": "Pull barbell behind hips and low back up as far as possible allowing elbows to travel up behind body to each side. Flex wrists near top of movement so bar can be raised higher. Lower until arms and wrists are straight. Repeat.",
"comments": "Flexion of wrist can allow for slightly greater range of movement near top, but this movement optional.",
"dynamic stabilizers": "bicepsbrachii",
"stabilizers": "trapeziusupper, pectoralisminor",
"synergists": "brachialis, trapeziusupper, deltoidlateral, levatorscapulae, wristflexors, brachioradialis, bicepsbrachii",
"target": "deltoidposterior"},"ShouldersBBRearDeltRow":{"id": "1",
"exerciseid": "BBRearDeltRow",
"musclegroup": "Shoulders",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Barbell Rear Delt Row",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Bend knees slightly and bend over bar with back straight, approximately horizontal. Grasp bar with wide overhand grip.",
"execution": "Keeping upper arm perpendicular to torso, pull barbell up toward upper chest until upper arms are just beyond horizontal. Return and repeat.",
"comments": "If upper arm travels closer than perpendicular to trunk, latissimus dorsi becomes involved. Elbows should be raised directly lateral to shoulders. Positioning torso at 45 is not sufficient angle to target rear deltoids. Keep torso bent over approximately horizontal. Knees are bent in effort to keep low back straight (See Hamstring Inflexibility). If low back becomes rounded due to tight hamstrings, either knees should be bent more or torso may not be positioned as low. If low back is rounded due to poor form, deadlift weight to standing position and lower torso into horizontal position with knees bent and back straight. Much lighter resistance is required as Barbell Bentover Row.",
"stabilizers": "hamstrings, gluteusmaximus, erectorspinae, adductors, quadriceps",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "infraspinatus, rhomboids, brachioradialis, brachialis, trapeziusmiddle, deltoidlateral, trapeziuslower, teresminor",
"target": "deltoidposterior"},"ShouldersBBLyingRearDeltRow":{"id": "2",
"exerciseid": "BBLyingRearDeltRow",
"musclegroup": "Shoulders",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Barbell Lying Rear Delt Row",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Lie chest down on elevated bench. Grasp bar with wide overhand grip.",
"execution": "Keeping upper arm perpendicular to torso, pull barbell up toward upper chest until upper arms are just beyond parallel to floor. Return and repeat.",
"comments": "If upper arm travels closer than perpendicular to trunk, latissimus dorsi becomes involved. Elbows should be raised directly lateral to shoulders. Bench should be just high enough to prevent barbell from hitting floor and close to horizontal. Lying at 45 is not sufficient angle to target rear deltoids. Much lighter resistance is required as Cambered Bar Lying Row.",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "infraspinatus, rhomboids, brachioradialis, brachialis, trapeziusmiddle, deltoidlateral, trapeziuslower, teresminor",
"target": "deltoidposterior"}}