{"ThighsPCHamstring":{"id": "0",
"exerciseid": "PCHamstring",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Hamstrings",
"name": "Lever Seated Hamstring Stretch",
"preparation": "Sit on seat in forward position with lower leg on shin pad, feet on foot rest. Place hands through wrist straps. Hold lower bar with overhand grip.",
"execution": "Push and lower seat back. Hold stretch. Repeat with opposite leg.",
"comments": "To intensify stretch, hold upper bar. Those with longer upper thigh may need to deliberately keep extended leg straight, position hips further back on seat, or perform alternative stretch.",
"other": "rhomboids, erectorspinae",
"target": "hamstrings"},"ThighsLVLyingHamstring":{"id": "1",
"exerciseid": "LVLyingHamstring",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Hamstrings",
"name": "Lever Lying Hamstring Stretch",
"preparation": "Lie on bench with leg on padded lever and foot against horizontal bar.",
"execution": "Pull release lever. Keeping knee straight, pull rail so leg rises upward until mild stretch is felt. Hold stretch. Repeat with opposite leg.",
"comments": "Keep knee straight throughout stretch. If horizontal foot bar is set so foot is more dorsal flexed, leg angle may not need to be set as high.",
"target": "hamstrings"},"ThighsLyingSingleLeg":{"id": "2",
"exerciseid": "LyingSingleLeg",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Hamstrings",
"name": "Lying Hamstring Stretch",
"preparation": "Lie on back and lift knee up. Grasp behind thigh near knee with both hands. Pull knee close to chest.",
"execution": "Extend knee while maintaining knee close to chest. Hold stretch. Repeat with opposite leg.",
"comments": "Far leg can be bent at knee and hip particularly if hip flexors are tight and greater spinal flexion will not irritate existing lower back injury. Alternative method (pictured low right) involves pulling leg toward chest with knee nearly straight. Also see Lying Hamstring Stretch with towel.",
"target": "hamstrings"},"ThighsPNFLyingSingleLeg":{"id": "3",
"exerciseid": "PNFLyingSingleLeg",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Hamstrings",
"name": "PNF Lying Hamstring Stretch",
"preparation": "Instruct participant to lie on floor or mat. Kneel beside participant and extend participants leg upward. Position back of participants lower leg on nearest shoulder. Position near ankle on participants opposite lower leg.",
"execution": "Push participants leg close to participants chest. Place hands on floor with arms extended to control resistance. Repeat with opposite leg.",
"comments": "See PNF stretch techniques. Also see Lying Hamstring Stretch for similar static stretch.",
"target": "hamstrings"},"ThighsLyingTowel":{"id": "4",
"exerciseid": "LyingTowel",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Hamstrings",
"name": "Lying Hamstring Stretch (towel)",
"preparation": "Sit on mat or floor with knees bent. Position towel under middle of foot with hands grasping towel on both ends. Lie back and raise leg straight above maintaining grip on towel with both hands.",
"execution": "Pull leg back while keeping knee straight. Hold stretch. Repeat with opposite leg.",
"comments": "Far leg can be straightened keep hip from rolling up or bent for comfort. Also see Lying Hamstring Stretch without towel.",
"target": "hamstrings"},"ThighsLyingVerticalHamstring":{"id": "5",
"exerciseid": "LyingVerticalHamstring",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Hamstrings",
"name": "Lying Vertical Hamstring Stretch",
"preparation": "Lie on floor with one leg extending up onto side of wall or column and other leg bent with foot on floor. One way this can be position can be achieved in a single motion is by sitting on floor with back of one shoulder against end of wall or column. Rotate body 90 onto back while swinging one leg up onto side of wall or column, ending up with back on floor and head positioned away from wall.",
"execution": "Straighten elevated knee until slight stretch is felt in back of thigh. If no stretch is felt, slowly straighten bent leg until slight stretch is felt in back of thigh. Hold stretch. Repeat with opposite leg on opposite side of wall or column.",
"comments": "Those with greater than average hamstring flexibility may not find this stretch to be effective. In which case, an alternative stretch would be more suitable.",
"target": "hamstrings"},"ThighsSeated":{"id": "6",
"exerciseid": "Seated",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Hamstrings",
"name": "Seated Hamstring Stretch",
"preparation": "Sit on floor or mat with knees straight.",
"execution": "Reach toward or beyond toes or bring torso toward legs. Hold stretch.",
"comments": "Keep knees straight by tensing Quadriceps. Knees may inadvertently bend if feet are extended off of thick mat. Spine may be kept straight. Pelvis may be tilted forward to intensify stretch.",
"other": "erectorspinae",
"target": "hamstrings"},"ThighsPNFSeated":{"id": "7",
"exerciseid": "PNFSeated",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Hamstrings",
"name": "PNF Seated Hamstring Stretch",
"preparation": "Instruct participant to sit with knees straight on floor or mat. Kneel behind participant and position chest on participants back. Place hands just above knees from each side.",
"execution": "Push participants torso toward legs with chest while holding down knees. Hold stretch.",
"comments": "See PNF stretch techniques. Also see Seated Hamstring Stretch for similar static stretch.",
"other": "erectorspinae",
"target": "hamstrings"},"ThighsSeatedSingleLeg":{"id": "8",
"exerciseid": "SeatedSingleLeg",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Hamstrings",
"name": "Seated Single Leg Hamstring Stretch",
"preparation": "Sit on floor or mat with legs apart and knees straight.",
"execution": "Reach toward one foot or bring torso toward one leg. Hold stretch for 20 seconds. Repeat with opposite leg.",
"comments": "Alternatively, leg not being stretched can be bent so sole of foot is next to stretched thigh. Keep knee of stretched leg straight by tensing Quadriceps. Knees may inadvertently bend if feet are extended off of thick mat or bench. Spine may be kept straight. Pelvis may be tilted forward to intensify stretch.",
"other": "erectorspinae",
"target": "hamstrings"},"ThighsSeatedChair":{"id": "9",
"exerciseid": "SeatedChair",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Hamstrings",
"name": "Seated Hamstring Stretch (Chair)",
"preparation": "Sit on edge of chair or exercise ball. Position heels on floor with knees straight.",
"execution": "Reach toward toes or bring torso toward legs. Hold stretch.",
"comments": "Precautions must be taken to prevent sliping off chair. This stretch may be appropriate for those restricted to chair. Keep knees straight by tensing Quadriceps. Spine may be kept straight. Pelvis may be tilted forward to intensify stretch.",
"other": "erectorspinae",
"target": "hamstrings"},"ThighsSeatedChairSingleLeg":{"id": "10",
"exerciseid": "SeatedChairSingleLeg",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Hamstrings",
"name": "Seated Single Leg Hamstring Stretch (Chair)",
"preparation": "Sit on edge of chair or exercise ball. Position heel on floor with knee straight.",
"execution": "Reach toward toe or bring torso toward leg. Hold stretch. Repeat with opposite leg.",
"comments": "Precautions must be taken to prevent sliping off chair. This stretch may be appropriate for those restricted to chair. Keep knee straight by tensing Quadriceps. Spine may be kept straight. Pelvis may be tilted forward to intensify stretch.",
"other": "erectorspinae",
"target": "hamstrings"},"ThighsSeatedBenchSingleLeg":{"id": "11",
"exerciseid": "SeatedBenchSingleLeg",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Hamstrings",
"name": "Seated Single Leg Hamstring Stretch (Bench)",
"preparation": "Sit on bench. Place one leg on bench with knee straight.",
"execution": "Reach toward foot or bring torso toward leg on bench. Hold stretch. Repeat with opposite leg.",
"comments": "Keep knees straight by tensing Quadriceps. The knee may inadvertently bend if foot is extended off edge of bench. Spine may be kept straight. Pelvis may be tilted forward to intensify stretch.",
"other": "erectorspinae",
"target": "hamstrings"},"ThighsStanding":{"id": "12",
"exerciseid": "Standing",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Hamstrings",
"name": "Standing Hamstring Stretch",
"preparation": "Stand and bend over with knees straight.",
"execution": "Reach toward toes or floor or bring torso toward legs. Hold stretch.",
"comments": "Keep knees straight by tensing Quadriceps. Spine may be kept straight. Pelvis may be tilted forward to intensify stretch.",
"other": "erectorspinae",
"target": "hamstrings"},"ThighsStandingCrossLeg":{"id": "13",
"exerciseid": "StandingCrossLeg",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Hamstrings",
"name": "Standing Cross Leg Hamstring Stretch",
"preparation": "Stand erect with legs crossed, outsides of feet together. Bend over with rear knee straight.",
"execution": "Reach toward feet or bring torso toward legs. Hold stretch. Repeat with opposite leg.",
"comments": "Keep rear knee straight. If necessary, tense Quadriceps. Spine may be kept straight. Pelvis may be tilted forward to intensify stretch.",
"other": "erectorspinae",
"target": "hamstrings"},"ThighsStandingSingleLeg":{"id": "14",
"exerciseid": "StandingSingleLeg",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Hamstrings",
"name": "Standing Single Leg Hamstring Stretch",
"preparation": "Sand with on foot forward and rear foot pointing out. Bend over and brace torso by placing hand just above bent rear knee.",
"execution": "Lean down and bend rear knee further. Hold stretch. Repeat with opposite leg.",
"comments": "Rear knee should remain pointed same direction of rear foot. Both hands may be braced just above both knees. Forward knee may also be keep straight by tensing Quadriceps. Spine may be kept straight. Pelvis may be tilted forward to intensify stretch.",
"other": "erectorspinae",
"target": "hamstrings"},"ThighsStandingBenchSingleLeg":{"id": "15",
"exerciseid": "StandingBenchSingleLeg",
"musclegroup": "Thighs",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "Hamstrings",
"name": "Standing Single Leg Hamstring Stretch (Bench)",
"preparation": "Place foot on bench or elevation.",
"execution": "Reach toward foot on bench or bring torso toward leg. Hold stretch. Repeat with opposite leg.",
"comments": "Avoid throwing leg up onto high elevation. Keep forward knee straight by tensing Quadriceps. Spine may be kept straight. Pelvis may be tilted forward to intensify stretch.",
"other": "erectorspinae",
"target": "hamstrings"}}