{"HipsCBRearLunge":{"id": "0",
"exerciseid": "CBRearLunge",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Cable Rear Lunge",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between two very low pulleys with shoulder width or narrower stance. Squat down and grasp stirrup attachments to each side. Stand upright with arms straight down to sides.",
"execution": "Step back with one leg while bending supporting leg. Plant forefoot far back on floor. Lower body by flexing knee and hip of supporting leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward supporting leg and return rear leg next to supporting leg. Repeat movement with opposite legs alternating between sides.",
"comments": "Keep torso upright during lunge flexible hip flexors are important. Forward knee should point same direction as foot throughout movement. A long lunge emphasizes Gluteus Maximus short lunge emphasizes Quadriceps. See Cable Rear Stepdown Lunge for similar exercise.",
"stabilizers": "trapeziusupper, levatorscapulae, gluteusmedius, gluteusminimus, quadratuslumborum, erectorspinae, trapeziuslower, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsCBRearStepdownLunge":{"id": "1",
"exerciseid": "CBRearStepdownLunge",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Cable Rear Step-down Lunge",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand on upper platform with stirrups grasped to sides.",
"execution": "Extend one leg back on forefoot. Lower body on other leg by flexing knee and hip of front leg until knee of rear leg is almost in contact with lower platform. Return to original standing position by extending hip and knee of forward leg. Repeat by alternating rear lunge with opposite leg.",
"comments": "Keep torso upright during lunge flexible hip flexors are important. Forward knee should point same direction as foot throughout lunge. A long lunge emphasizes Gluteus Maximus short lunge emphasizes Quadriceps.",
"stabilizers": "trapeziusupper, levatorscapulae, gluteusmedius, gluteusminimus, quadratuslumborum, erectorspinae, trapeziuslower, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsCBSingleLegSplitSquat":{"id": "2",
"exerciseid": "CBSingleLegSplitSquat",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Cable Single Leg Split Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Facing away from bench, stand between two very low pulleys with shoulder width or narrower stance. Squat down and grasp stirrup attachments to each side. Stand upright with arms straight down to sides. Extend leg back and place top of foot on bench.",
"execution": "Squat down by flexing knee and hip of front leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward leg. Repeat. Continue with opposite leg.",
"comments": "Keep torso upright during squat flexible hip flexors are important. Forward knee should point same direction as foot throughout movement. May also be referred to as Cable Bulgarian Squat. ",
"stabilizers": "trapeziusupper, gluteusminimus, erectorspinae, levatorscapulae, trapeziuslower, gluteusmedius",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsCBSingleLegSplitSquatOneArm":{"id": "3",
"exerciseid": "CBSingleLegSplitSquatOneArm",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Cable One Arm Single Leg Split Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between bench and low pulley cable. Grasp cable stirrup with one hand. Facing low pulley, extend leg back and place top of foot or forefoot on bench. Place other hand on hip or support to side.",
"execution": "Squat down by flexing knee and hip of front leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward leg. Repeat. Continue with opposite leg.",
"comments": "Keep torso upright during squat flexible hip flexors are important. Forward knee should point same direction as foot throughout movement. May also be referred to as Cable One Arm Bulgarian Squat.",
"stabilizers": "gluteusmedius, obliques, gluteusminimus, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsCBLunge":{"id": "4",
"exerciseid": "CBLunge",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Cable Split Squat (belt)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Facing low pulley, kneel to attach cable belt or dip belt around waist. Place hand(s) on ballet bar or machine (not on guide rod) for balance. Stand away from pulley with one leg forward and opposite leg to rear.",
"execution": "Squat down by flexing knee and hip of front leg. Allow heel of rear foot to rise up while knee of rear leg bends slightly until it almost makes contact with floor. Return to original straddle position by extending hip and knee of forward leg. Repeat. Continue with legs in opposite position.",
"comments": "Knees should point same direction as feet throughout movement. Heel of rear foot can be kept elevated off floor throughout movement as shown. Keep torso upright during squat flexible hip flexors are important. With feet further apart Gluteus Maximus is emphasized, Quadriceps are less emphasized. Also know as Cable Lunge.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsCBLungeTwoArm":{"id": "5",
"exerciseid": "CBLungeTwoArm",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Cable Split Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between two very low cable pulleys. Grasp stirrup attachments with each hand. Place one leg far forward and opposite leg far back to rear.",
"execution": "Squat down by flexing knee and hip of front leg. Allow heel of rear foot to rise up while knee of rear leg bends slightly until it almost makes contact with floor. Return to original straddle position by extending hip and knee of forward leg. Repeat. Continue with legs in opposite position.",
"comments": "Knees should point same direction as feet throughout movement. Heel of rear foot can be kept elevated off floor throughout movement as shown. Keep torso upright during squat flexible hip flexors are important. With feet further apart Gluteus Maximus is emphasized, Quadriceps are less emphasized. Also known as Cable Lunge.",
"stabilizers": "trapeziusupper, trapeziusmiddle, erectorspinae, levatorscapulae, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsCBLungeOneArm":{"id": "6",
"exerciseid": "CBLungeOneArm",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Cable One Arm Split Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Face low pulley and grasp stirrup attachment with one hand. Stand away from pulley with one leg forward and opposite leg to rear. Place other hand on hip or on support to side.",
"execution": "Squat down by flexing knee and hip of front leg. Allow heel of rear foot to rise up while knee of rear leg bends slightly until it almost makes contact with floor. Return to original straddle position by extending hip and knee of forward leg. Repeat. Continue with legs in opposite position.",
"comments": "Knees should point same direction as feet throughout movement. Heel of rear foot can be kept elevated off floor throughout movement as shown. Keep torso upright during squat flexible hip flexors are important. With feet further apart Gluteus Maximus is emphasized, Quadriceps are less emphasized. Also known as One Arm Split Squat.",
"stabilizers": "trapeziusupper, trapeziusmiddle, erectorspinae, levatorscapulae, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsCBSquat":{"id": "7",
"exerciseid": "CBSquat",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Cable Squat",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand with feet shoulder width or slightly wider on platform between very low and close pulley cables. Squat down with knees slightly beyond foot and shoulder above feet. Grasp stirrups to each side with arms straight.",
"execution": "Keeping chest high and back straight, raise stirrups by extending knees and hips until legs are straight. Squat down by bending hips back while allowing knees to bend forward slightly, keeping back straight and knees pointed same direction as feet. Squat down until thighs are just past parallel to floor. Return and repeat.",
"comments": "Keep head facing forward, back straight, chest high, arms straight to sides, and feet flat on platform equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsCBBarSquat":{"id": "8",
"exerciseid": "CBBarSquat",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Cable Bar Squat",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Adjust cable pulleys to medium low positions. Kneel under attached cable bar while supporting it with both hands. Position body in lower squat position with cable bar on top of shoulders, both feet flat on floor with mid feet in line with both pulleys, knees positioned same direction as feet, back straight and angled forward, and hands grasping bar to each side.",
"execution": "Stand up by extending hips and knees until legs are straight. Squat back down by bending hips back while allowing knees to bend slightly forward, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Return and repeat.",
"comments": "Position height of cable bar so moving weight plates make contact with unused weight stack at bottom of squat when hips are slightly lower or same height as knees. Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis. Also see Cable Squat.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsCBSquatBelt":{"id": "9",
"exerciseid": "CBSquatBelt",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Cable Belt Squat",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Place pin on lightest weight. Place belt around waist. Pull cable from pulley and attach to front of belt. Step onto platform and grasp pole. Squat or sit on platform and select desired weight. Stand with feet shoulder width or wider to each side of cable. Place both hands on pole at waist height.",
"execution": "Squat down by bending hips back while allowing knees to bend forward slightly, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Squat up by extending knees and hips until legs are straight. Return and repeat.",
"comments": "Keep head facing forward, back straight, chest high, and feet flat on surface equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. When finished, squat or sit and place pin into lightest weight setting. Step off of platform and unclip cable from belt. Also known as Pole Squat. Instead of holding onto pole for balance (as shown), arms can be extended forward without contact with pole. See Squat Analysis. Also see similar exercise Weighted Belt Squat.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsCBStandingHipExtension":{"id": "10",
"exerciseid": "CBStandingHipExtension",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Cable Standing Hip Extension",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Attach ankle cuff to low pulley. With cuff on one ankle, grasp ballet bar with both hands and step back with other foot. Elbows remain straight. Attached leg is straight and foot is slightly off floor.",
"execution": "Pull cable attachment back by extending hip. Return leg to original position. Repeat. Continue with opposite leg.",
"comments": "Also see Cable Bentover Hip Extension for more bent over posture.",
"antagonist stabilizers": "rectusabdominis",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, obliques",
"synergists": "hamstrings",
"target": "gluteusmaximus"},"HipsCBBentOverHipExtension":{"id": "11",
"exerciseid": "CBBentOverHipExtension",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Cable Bent-over Hip Extension",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Attach ankle cuff to low pulley. With cuff on one ankle, grasp ballet bar with both hands and step far back with other foot. Elbows remain straight to support body leaning forward. Attached leg is straight and foot is stretched off floor.",
"execution": "Pull cable attachment back by extending hip. Return leg to original position. Repeat. Continue with opposite leg.",
"comments": "Also see Cable Standing Hip Extension for more upright posture.",
"antagonist stabilizers": "rectusabdominis",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, obliques",
"synergists": "hamstrings",
"target": "gluteusmaximus"},"HipsCBStepUp":{"id": "12",
"exerciseid": "CBStepUp",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Cable Step-up",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand behind elevated platform and low and close pulley cables to sides. Grasp stirrups at each side of platform. Stand upright with arms straight down at sides.",
"execution": "Place foot of first leg on elevated platform. Stand on elevated platform by extending hip and knee of first leg and place foot of second leg on bench. Step down with second leg by flexing hip and knee of first leg. Return to original standing position by placing foot of first leg to lower position. Repeat first step with opposite leg alternating first steps between legs.",
"comments": "Keep torso upright during exercise. Forward knee should point same direction as foot throughout movement. Stepping distance from bench emphasizes Gluteus Maximus stepping close to bench emphasizes Quadriceps.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, levatorscapulae, gluteusmedius, trapeziusmiddle, gluteusminimus, quadratuslumborum, erectorspinae, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gastrocnemius, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsCBStiffLegDeadlift":{"id": "13",
"exerciseid": "CBStiffLegDeadlift",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Cable Stiff Leg Deadlift",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand on elevated platform between two very low pulleys with shoulder width or narrower stance. Squat down and grasp stirrup attachments to each side. Stand upright with arms straight down to sides.",
"execution": "Bow forward by bending hips. Bend knees slightly during descent and keep waist straight, flexing low back at bottom. With knees slightly bent, raise torso by extending at waist, then hips, gradually extending knees until standing upright. Pull shoulders back slightly if rounded. Repeat.",
"comments": "Lower back may bend slightly during hip flexion phase. Target muscle is exercised isometrically if lower back does not bend. Begin with light weight and add additional weight gradually to allow adequate adaptation. Throughout lift, keep arms straight. Knee can be kept bent throughout movement. Do not stand behind pulleys. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings and back. When finished with set, dismount by lowering weight with knees bent and low back straight. Full range of motion will vary from person to person. Those with less flexibility may have to bend knees more or they may not even need to stand on platform. See Dangerous Exercise Essay. Also see Straightback Stiffleg Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, trapeziusmiddle, levatorscapulae, trapeziuslower, rhomboids, quadriceps",
"synergists": "hamstrings, adductors, erectorspinae",
"target": "gluteusmaximus"},"HipsCBStrBackStiffLegDeadlift":{"id": "14",
"exerciseid": "CBStrBackStiffLegDeadlift",
"musclegroup": "Hips",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Cable Straight-back Stiff-leg Deadlift",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand between two very low pulleys with shoulder width or narrower stance. Squat down and grasp stirrup attachments to each side. Stand upright with arms straight down to sides.",
"execution": "With back straight, bow forward by bending hips and bend knees slightly during descent. Raise torso by extending hips while gradually extending knees until standing upright. Pull shoulders back slightly if rounded. Repeat.",
"comments": "Do not stand behind pulleys. Throughout lift, keep arms and back straight. Do not lower weight beyond mild stretch throughout hamstrings. When finished with set, dismount by lowering weight with knees bent and low back straight. Full range of motion will vary from person to person. Those with less flexibility may have to bend knees more. Knees can be kept bent throughout movement. Also see Stiff Leg Deadlift .",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, levatorscapulae, trapeziusmiddle, erectorspinae, trapeziuslower, rhomboids, quadriceps",
"synergists": "hamstrings, adductors",
"target": "gluteusmaximus"}}