{"WaistDB45SideBend":{"id": "0",
"exerciseid": "DB45SideBend",
"musclegroup": "Waist",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Dumbbell 45° Side Bend",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Position side of thigh on padding and side of feet on leg padding or platform lip. Hold dumbbell straight downward with lower arm.",
"execution": "Raise torso upward by lateral flexing waist. Lower torso by bending waist downward. Repeat. Position body facing opposite side and continue with opposite side.",
"comments": "Keep arm holding dumbbell approximately vertical (below shoulder) throughout movement. See Spot Reduction Myth and Arm Position During Waist Exercises.",
"stabilizers": "gluteusmedius, gluteusminimus",
"synergists": "iliopsoas, quadratuslumborum, erectorspinae",
"target": "obliques"},"WaistDBRussianTwistBall":{"id": "1",
"exerciseid": "DBRussianTwistBall",
"musclegroup": "Waist",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Dumbbell Russian Twist (on stability ball)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "With dumbbell in hand, sit on stability ball. Roll body down and lie with back on ball, hips nearly straight, and feet apart on floor. Hold onto dumbbell with both hands with arms extending straight upward.",
"execution": "Turn torso to one side while keeping arms straight and perpendicular to torso throughout movement. Return dumbbell back over shoulders by rotating torso to original position. Continue lowering dumbbell to opposite side. Repeat.",
"comments": "Both arms should be kept straight and perpendicular to torso. Hips should also be kept nearly straight, only slightly bent. See Spot Reduction Myth. This movement involves both spinal rotation and hip external rotation. Because leg to the opposite side of dumbbell acts to counter weight of dumbbells resistance, greatest downward force onto floor is placed on foot nearest to side of dumbbell. Since foot of near leg provides more secured base of support, external rotation of near hip provides significantly more torque as compared to relatively passive internal rotation of far hip.",
"stabilizers": "pectoralisclavicular, tricepsbrachii, pectoralissternal, deltoidposterior, trapeziusmiddle, gluteusmaximus, deltoidlateral, erectorspinae, trapeziuslower, pectoralisminor, rhomboids",
"synergists": "hipexernalrotators, iliopsoas, quadratuslumborum, erectorspinae",
"target": "obliques"},"WaistDBSideBend":{"id": "2",
"exerciseid": "DBSideBend",
"musclegroup": "Waist",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Dumbbell Side Bend",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp dumbbell with arm straight to side.",
"execution": "Bend waist to opposite side of dumbbell until slight stretch is felt. Lower to opposite side, same distance and repeat. Continue with opposite side.",
"comments": "See Spot Reduction Myth.",
"stabilizers": "trapeziusupper, trapeziusmiddle, gluteusminimus, levatorscapulae, gluteusmedius",
"synergists": "iliopsoas, quadratuslumborum, erectorspinae",
"target": "obliques"}}