{"UpperArmsLVCloseGripBenchPressH":{"id": "0",
"exerciseid": "LVCloseGripBenchPressH",
"musclegroup": "UpperArms",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Lever Close Grip Bench Press (plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie on bench with lever handles above sides of chest. Grasp handles with narrow overhand grip just above each side of chest.",
"execution": "Press lever up until arms are extended. Return weights down to starting position. Repeat.",
"comments": "Hands will be closer together at top of movement as compared to Barbell Close Grip Bench Press since lever arms travel inward at top of motion. Also see Bench Press Analysis.",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "pectoralissternal, pectoralisclavicular, deltoidanterior",
"target": "tricepsbrachii"},"UpperArmsLVBBCloseGripBenchPress":{"id": "1",
"exerciseid": "LVBBCloseGripBenchPress",
"musclegroup": "UpperArms",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Lever Barbell Close Grip Bench Press (plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie on bench with bar above chest and grasp bar with shoulder width or slightly narrower grip. Disengage bar by rotating bar back.",
"execution": "Lower weight to chest with elbows close to body. Push barbell back up until arms are straight. Repeat.",
"comments": "Grip can be slightly narrower than shoulder width but not too close. Also see Bench Press Analysis.",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "pectoralissternal, pectoralisclavicular, deltoidanterior",
"target": "tricepsbrachii"},"UpperArmsLVTriExtGripless":{"id": "2",
"exerciseid": "LVTriExtGripless",
"musclegroup": "UpperArms",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Lever Triceps Extension (plate loaded)",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Sit on seat. Place forearms on lever pad and back of upper arms, parallel on padding with elbows in line with levers fulcrum.",
"execution": "Push lever down until arms are fully extended. Return and repeat.",
"comments": "With heavy resistance, back pad will need to be adjusted to keep torso close to arm pad. Adjust seat height so back of upper arms rest on padding. If seat is too high, shoulder will need to rise near end of extension to complete final range of motion since forearms will make contact with pad before lockout. If seat is too low, range of motion will be compromised because elbows will not be completely flexed at beginning of movement. Also see Lever Triceps Extension on alternative apparatus.",
"stabilizers": "latissimusdorsi, deltoidposterior, pectoralisminor, teresmajor, trapeziuslower, pectoralissternal",
"synergists": "None",
"target": "tricepsbrachii"},"UpperArmsLVTricepsExtensionNoSeatPL":{"id": "3",
"exerciseid": "LVTricepsExtensionNoSeatPL",
"musclegroup": "UpperArms",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Lever Triceps Extension (no seat, plate loaded)",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Stand behind arm pad facing lever handles. Place one foot forward under arm pad and opposite foot back on foot bar. Grasp handles with narrow overhand grip. Squat down and position chest up against side of pad and back of upper arms on upper angled padded surface.",
"execution": "Push lever down until arms are fully extended. Return and repeat.",
"comments": "In effort to achieve fuller range of motion, head can be positioned down so handles can clear over head. With heavy resistance, back pad will need to be adjusted to keep torso close to arm pad. Position armpit to rest near top of pad. Back of upper arm should remain on pad throughout movement. Notice that this machine has secondary lever, so elbows are not aligned with primary fulcrum. The particular machine shown doubles as Preacher Curl Machine by placing weight on opposite side of fulcrum. Also see Lever Triceps Extension on alternative apparatus.",
"stabilizers": "latissimusdorsi, deltoidposterior, pectoralisminor, teresmajor, trapeziuslower, wristflexors, pectoralissternal",
"synergists": "None",
"target": "tricepsbrachii"},"UpperArmsLVTriDipH":{"id": "4",
"exerciseid": "LVTriDipH",
"musclegroup": "UpperArms",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Lever Triceps Dip (plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit upright on seat. If possible, place handles in narrow position. Grasp handles.",
"execution": "Push levers down with elbows pointing back. Allow lever bar to raise until shoulders are slightly stretched. Repeat.",
"comments": "Also see Lever Chest Dip.",
"stabilizers": "trapeziuslower",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "latissimusdorsi, pectoralisminor, pectoralisclavicular, deltoidanterior, levatorscapulae, pectoralissternal, rhomboids",
"target": "tricepsbrachii"}}