{"CalvesDBStandingCalfRaise":{"id": "0",
"exerciseid": "DBStandingCalfRaise",
"musclegroup": "Calves",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Gastrocnemius",
"name": "Dumbbell Standing Calf Raise",
"utility": "Basic",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Grasp dumbbell in one hand to side. Position toes and balls of feet on calf block with arches and heels extending off. Place hand on support for balance.",
"execution": "Raise heels by extending ankles as high as possible. Lower heels by bending ankles until calves are stretched. Repeat.",
"comments": "Exercise step that will not overturn can be used as calf block. Keep knees straight throughout exercise or bend knees slightly only during stretch. Quadriceps serve as synergists muscle if knees are bent slightly during stretch. If holding heavy dumbbell becomes too difficult, try single leg calf raise. See Calf Exercise Analyses.",
"stabilizers": "trapeziusupper, trapeziusmiddle, gluteusminimus, levatorscapulae, gluteusmedius",
"synergists": "soleus",
"target": "gastrocnemius"},"CalvesDBSingleLegCalfRaise":{"id": "1",
"exerciseid": "DBSingleLegCalfRaise",
"musclegroup": "Calves",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Gastrocnemius",
"name": "Dumbbell Single Leg Calf Raise",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Grasp dumbbell in one hand to side. Position toes and balls of feet on calf block with arches and heels extending off. Place hand on support for balance. Lift other leg to rear by bending knee.",
"execution": "Raise heel by extending ankle as high as possible. Lower heel by bending ankle until calf is stretched. Repeat. Continue with opposite leg.",
"comments": "Exercise step that will not overturn can be used as calf block. Keep knees straight throughout exercise or bend knees slightly only during stretch. Quadriceps serve as synergists muscle if knee is bent slightly during stretch. Use lighter load if you need to assist with hands used for support or use both feet. See Calf Exercise Analyses.",
"stabilizers": "trapeziusupper, trapeziusmiddle, gluteusminimus, quadratuslumborum, levatorscapulae, gluteusmedius, obliques",
"synergists": "soleus",
"target": "gastrocnemius"}}