{"BackDBBentOverRow":{"id": "0",
"exerciseid": "DBBentOverRow",
"musclegroup": "Back",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "BackGeneral",
"name": "Dumbbell Bent-over Row",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Kneel over side of bench by placing knee and hand of supporting arm on bench. Position foot of opposite leg slightly back to side. Grasp dumbbell from floor.",
"execution": "Pull dumbbell to up to side until it makes contact with ribs or until upper arm is just beyond horizontal. Return until arm is extended and shoulder is stretched downward. Repeat and continue with opposite arm.",
"comments": "Allow scapula to articulate but do not rotate torso in effort to throw weight up. Torso should be close to horizontal. Positioning supporting knee andor arm slightly forward or back will allow for proper levelling of torso. Torso may be positioned lower to allow for heavier dumbbell to make contact with floor, if desired.",
"stabilizers": "tricepsbrachii",
"dynamic stabilizers": "bicepsbrachii, tricepsbrachii",
"synergists": "latissimusdorsi, infraspinatus, brachioradialis, pectoralissternal, deltoidposterior, brachialis, trapeziusmiddle, teresmajor, trapeziuslower, teresminor, rhomboids",
"target": "Back, General"},"BackDBLyingRow":{"id": "1",
"exerciseid": "DBLyingRow",
"musclegroup": "Back",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "BackGeneral",
"name": "Dumbbell Lying Row",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Lie chest down on elevated bench. Grasp dumbbells below.",
"execution": "Pull dumbbells to sides until upper arm is just beyond horizontal or height of back. Return until arms are extended and shoulders are stretched downward. Repeat.",
"comments": "Bench should be high enough to allow shoulders to stretch forward without dumbbells hitting floor.",
"dynamic stabilizers": "bicepsbrachii, tricepsbrachii",
"synergists": "latissimusdorsi, infraspinatus, brachioradialis, pectoralissternal, deltoidposterior, brachialis, trapeziusmiddle, teresmajor, trapeziuslower, teresminor, rhomboids",
"target": "Back, General"}}