{"CalvesCBStandingCalfRaise":{"id": "0",
"exerciseid": "CBStandingCalfRaise",
"musclegroup": "Calves",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Gastrocnemius",
"name": "Cable Standing Calf Raise",
"utility": "Basic",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Place cable belt or dip belt around waist. Kneel before low pulley and attach belt to cable. Stand on calf block and grasp support bar for balance. Position toes and balls of feet on calf block with arches and heels extending off.",
"execution": "Raise heels by extending ankles as high as possible. Lower heels by bending ankles until calves are stretched. Repeat.",
"comments": "Chain may be used to add length to cable so belt can be more easily attached to cable as long as it is short enough to allow full range of motion. Exercise step that will not overturn can be used as calf block. Keep knees straight throughout exercise or bend knees slightly only during stretch. Quadriceps serve as synergists muscle if knees are bent slightly during stretch. See Calf Exercise Analyses. Also see same movement performed on slightly different apparatus, Lever Standing Calf Raise (belt loaded).",
"stabilizers": "No significant stabilizers",
"synergists": "soleus",
"target": "gastrocnemius"},"CalvesCBSingleLegCalfRaise":{"id": "1",
"exerciseid": "CBSingleLegCalfRaise",
"musclegroup": "Calves",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Gastrocnemius",
"name": "Cable Single Leg Calf Raise",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Kneel before low pulley and attach cable belt or dip belt to cable. Stand on edge of platform and grasp support bar for balance. Position toes and balls of feet on platform with arches and heels extending off. Lift one leg up off of floor.",
"execution": "Raise heel by extending ankle as high as possible. Lower heel by bending ankle until calf is stretched. Repeat.",
"comments": "A short chain may be used to add length to cable so belt can be more easily attached to cable as long as it is short enough to allow full range of motion. Calf block or exercise step that will not overturn can be used as platform. A short chain may be used, so belt can be more easily attached to cable as long as it is short enough to allow full range of motion. Keep knee straight throughout exercise or bend knee slightly only during stretch. Quadriceps serve as synergists muscle if knees are bent slightly during stretch. See Calf Exercise Analyses.",
"stabilizers": "gluteusmedius, gluteusminimus, quadratuslumborum, obliques",
"synergists": "soleus",
"target": "gastrocnemius"},"CalvesCBOneArmSingleLegCalfRaise":{"id": "2",
"exerciseid": "CBOneArmSingleLegCalfRaise",
"musclegroup": "Calves",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Gastrocnemius",
"name": "Cable One Arm Single Leg Calf Raise",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Stand facing low pulley with platform on floor. Bend over and grasp stirrup attachment with one hand. Stand on edge of platform and grasp support bar for balance. Position toes and balls of feet on platform with arches and heels extending off. Lift one leg up off of floor.",
"execution": "Raise heel by extending ankle as high as possible. Lower heel by bending ankle until calf is stretched. Repeat.",
"comments": "Calf block or exercise step that will not overturn can be used as platform. Keep knee straight throughout exercise or bend knee slightly only during stretch. Quadriceps serve as synergists muscle if knees are bent slightly during stretch. See Calf Exercise Analyses.",
"stabilizers": "trapeziusupper, trapeziusmiddle, gluteusminimus, quadratuslumborum, levatorscapulae, gluteusmedius, obliques",
"synergists": "soleus",
"target": "gastrocnemius"}}