{"ThighsCBRearLunge":{"id": "0",
"exerciseid": "CBRearLunge",
"musclegroup": "Thighs",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Cable Rear Lunge",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between two very low pulleys with shoulder width or narrower stance. Squat down and grasp stirrup attachments to each side. Stand upright with arms straight down to sides.",
"execution": "Step back with one leg while bending supporting leg. Plant forefoot far back on floor. Lower body by flexing knee and hip of supporting leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward supporting leg and return rear leg next to supporting leg. Repeat movement with opposite legs alternating between sides.",
"comments": "Keep torso upright during lunge flexible hip flexors are important. Forward knee should point same direction as foot throughout movement. A long lunge emphasizes Gluteus Maximus short lunge emphasizes Quadriceps. See Cable Rear Stepdown Lunge for similar exercise.",
"stabilizers": "trapeziusupper, levatorscapulae, gluteusmedius, gluteusminimus, quadratuslumborum, erectorspinae, trapeziuslower, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsCBRearStepDownLunge":{"id": "1",
"exerciseid": "CBRearStepDownLunge",
"musclegroup": "Thighs",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Cable Rear Step-down Lunge",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand on upper platform with stirrups grasped to sides.",
"execution": "Extend one leg back on forefoot. Lower body on other leg by flexing knee and hip of front leg until knee of rear leg is almost in contact with lower platform. Return to original standing position by extending hip and knee of forward leg. Repeat by alternating rear lunge with opposite leg.",
"comments": "Keep torso upright during lunge flexible hip flexors are important. Forward knee should point same direction as foot throughout movement. A long lunge emphasizes Gluteus Maximus short lunge emphasizes Quadriceps. See Cable Rear Lunge for similar exercise.",
"stabilizers": "trapeziusupper, levatorscapulae, gluteusmedius, gluteusminimus, quadratuslumborum, erectorspinae, trapeziuslower, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsCBSingleLegSplitSquat":{"id": "2",
"exerciseid": "CBSingleLegSplitSquat",
"musclegroup": "Thighs",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Cable Single Leg Split Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Facing away from bench, stand between two very low pulleys with shoulder width or narrower stance. Squat down and grasp stirrup attachments to each side. Stand upright with arms straight down to sides. Extend leg back and place top of foot on bench.",
"execution": "Squat down by flexing knee and hip of front leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward leg. Repeat. Continue with opposite leg.",
"comments": "Keep torso upright during squat flexible hip flexors are important. Forward knee should point same direction as foot throughout movement. May also be referred to as Cable Bulgarian Squat.",
"stabilizers": "trapeziusupper, gluteusminimus, erectorspinae, levatorscapulae, trapeziuslower, gluteusmedius",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsCBSingleLegSplitSquatOneArm":{"id": "3",
"exerciseid": "CBSingleLegSplitSquatOneArm",
"musclegroup": "Thighs",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Cable One Arm Single Leg Split Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between bench and low pulley cable. Grasp cable stirrup with one hand. Facing low pulley, extend leg back and place top of foot or forefoot on bench. Place other hand on hip or support to side.",
"execution": "Squat down by flexing knee and hip of front leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward leg. Repeat. Continue with opposite leg.",
"comments": "Keep torso upright during squat flexible hip flexors are important. Forward knee should point same direction as foot throughout movement. May also be referred to as Cable One Arm Bulgarian Squat.",
"stabilizers": "gluteusmedius, obliques, gluteusminimus, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsCBLunge":{"id": "4",
"exerciseid": "CBLunge",
"musclegroup": "Thighs",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Cable Split Squat (belt)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Facing low pulley, kneel to attach cable belt or dip belt around waist. Place hand(s) on ballet bar or machine (not on guide rod) for balance. Stand away from pulley with one leg forward and opposite leg to rear.",
"execution": "Squat down by flexing knee and hip of front leg. Allow heel of rear foot to rise up while knee of rear leg bends slightly, until it almost makes contact with floor. Return to original straddle position by extending hip and knee of forward leg. Repeat. Continue with legs in opposite position.",
"comments": "Knees should point same direction as feet throughout movement. Heel of rear foot can be kept elevated off floor throughout movement as shown. Keep torso upright during squat flexible hip flexors are important. With feet further apart Gluteus Maximus is emphasized, Quadriceps are less emphasized. Also known as Cable Lunge.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsCBLungeTwoArm":{"id": "5",
"exerciseid": "CBLungeTwoArm",
"musclegroup": "Thighs",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Cable Split Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between two very low cable pulleys. Grasp stirrup attachments with each hand. Place one leg forward and opposite leg back to rear.",
"execution": "Squat down by flexing knee and hip of front leg. Allow heel of rear foot to rise up while knee of rear leg bends slightly until it almost makes contact with floor. Return to original straddle position by extending hip and knee of forward leg. Repeat. Continue with legs in opposite position.",
"comments": "Knees should point same direction as feet throughout movement. Heel of rear foot can be kept elevated off floor throughout movement as shown. Keep torso upright during squat flexible hip flexors are important. With feet further apart Gluteus Maximus is emphasized, Quadriceps are less emphasized. Also known as Cable Lunge.",
"stabilizers": "trapeziusupper, trapeziusmiddle, erectorspinae, levatorscapulae, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsCBLungeOneArm":{"id": "6",
"exerciseid": "CBLungeOneArm",
"musclegroup": "Thighs",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Cable One Arm Split Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Face low pulley and grasp stirrup attachment with one hand. Stand away from pulley with one leg forward and opposite leg to rear. Place other hand on hip or on support to side.",
"execution": "Squat down by flexing knee and hip of front leg. Allow heel of rear foot to rise up while knee of rear leg bends slightly until it almost makes contact with floor. Return to original straddle position by extending hip and knee of forward leg. Repeat. Continue with legs in opposite position.",
"comments": "Knees should point same direction as feet throughout movement. Heel of rear foot can be kept elevated off floor throughout movement as shown. Keep torso upright during squat flexible hip flexors are important. With feet further apart Gluteus Maximus is emphasized, Quadriceps are less emphasized. Also known as Cable One Arm Lunge.",
"stabilizers": "obliques, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsCBSquat":{"id": "7",
"exerciseid": "CBSquat",
"musclegroup": "Thighs",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Cable Squat",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand with feet shoulder width or slightly wider on platform between very low and close pulley cables. Squat down with knees slightly beyond foot, hips bent back behind, back straight, knees pointed same direction as feet, and shoulder above feet. Grasp stirrups to each side with arms straight.",
"execution": "Keeping chest high and back straight, raise stirrups by extending knees and hips until legs are straight. Squat down by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Squat down until thighs are just past parallel to floor. Return and repeat.",
"comments": "Keep head facing forward, back straight, chest high, arms straight to sides, and feet flat on platform equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Cable Squat on model with higher platform. Also see Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsCBBarSquat":{"id": "8",
"exerciseid": "CBBarSquat",
"musclegroup": "Thighs",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Cable Bar Squat",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Adjust cable pulleys to medium low positions. Kneel under attached cable bar while supporting it with both hands. Position body in lower squat position with cable bar on top of shoulders, both feet flat on floor with mid feet in line with both pulleys, knees positioned same direction as feet, back straight and angled forward, and hands grasping bar to each side.",
"execution": "Stand up by extending hips and knees until legs are straight. Squat back down to original squat position by bending hips back and knees forward while keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Return and repeat.",
"comments": "Position height of cable bar so moving weight plates makes contact with unused weight stack at bottom of squat when hips are slightly lower or same height as knees. Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis. Also see Cable Squat.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsCBSquatBelt":{"id": "9",
"exerciseid": "CBSquatBelt",
"musclegroup": "Thighs",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Cable Belt Squat",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Place pin on lightest weight. Place belt around waist. Pull cable from pulley and attach to front of belt. Step onto platform and grasp pole. Squat or sit on platform and select desired weight. Stand with feet shoulder width or wider to each side of cable. Place both hands on pole at waist height.",
"execution": "Squat down by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Squat up by extending knees and hips until legs are straight. Return and repeat.",
"comments": "Keep head facing forward, back straight, chest high, and feet flat on surface equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. When finished, squat or sit and place pin into lightest weight setting. Step off of platform and unclip cable from belt. Also known as Pole Squat. Instead of holding onto pole for balance (as shown), arms can be extended forward without contact with pole. It may be difficult to achieve full range of motion when attempting this movement over a standard low pulley. Also see similar exercise Weighted Belt Squat. See Squat Analysis.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsCB3QuarterSquatDipBelt":{"id": "10",
"exerciseid": "CB3QuarterSquatDipBelt",
"musclegroup": "Thighs",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Cable Belt Half Squat",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Place cable belt or dip belt around waist. Kneel before low pulley and attach it to cable. Stand on elevated platform with feet shoulder width or slightly wider on platform between very low and close pulley cables. Place hand(s) on ballet bar or machine (not on guide rod) for balance.",
"execution": "Squat down by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until weight stack taps or comes very close from making contact. Keeping chest high and back straight, raise back up by extending knees and hips until legs are straight. Repeat.",
"comments": "More or less 34 squat depth can be achieved depending upon exercisers height, chain length on dip belt, and height of elevated platform. If greater depth can be achieved, descend as low as thighs being parallel to floor. Keep head facing forward, back straight, chest high, arms straight to sides, and feet flat on platform equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus",
"target": "quadriceps"},"ThighsCBStandingLegExtension":{"id": "11",
"exerciseid": "CBStandingLegExtension",
"musclegroup": "Thighs",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Cable Standing Leg Extension",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Stand facing away from low pulley. Place foot in cable boot attachment (as shown) or foot harness. Grasp lateral bars or other prop for support. Stand forward on free leg. Raise knee up positioning thigh approximately 45 forward. Allow lower leg attached to cable to be pulled back.",
"execution": "Keeping thigh stationary, extend lower leg forward until leg is straight. Return by lowering lower leg down and back to original position. Repeat.",
"comments": "Those with hamstring inflexibility may have difficulty fully extending knee if knee is too high. In which case, knee can be raised forward less than 45. Pectineus, Adductor Longus, Adductor Brevis do not contribute to hip stabilization since they are only involved in initial range of hip flexion.",
"stabilizers": "gluteusminimus, quadratuslumborum, gluteusmedius, rectusabdominis, obliques",
"synergists": "iliopsoas, tensorfasciaelatae, sartorius",
"target": "quadriceps"},"ThighsCBSingleLegSquat":{"id": "12",
"exerciseid": "CBSingleLegSquat",
"musclegroup": "Thighs",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Cable Step Down",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Grasp cable stirrup(s) with both hands. Place one foot on elevated platform positioned near or between low pulleys.",
"execution": "Raise body by extending knee and hip on platform until leg is straight. Return until foot of lower leg makes contact with lower platform or floor and repeat. Continue with opposite leg.",
"comments": "Keep lower leg straight throughout movement. Forward knee should point same direction as foot throughout movement. Instead of grasping cable stirrups, dip belt attached to low pulley cable can be placed around waist.",
"stabilizers": "gluteusmedius, gluteusminimus, quadratuslumborum, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsCBStepUp":{"id": "13",
"exerciseid": "CBStepUp",
"musclegroup": "Thighs",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Cable Step-up",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand behind elevated platform and low and close pulley cables to sides. Grasp stirrups at each side of platform. Stand upright with arms straight down at sides.",
"execution": "Place foot of first leg on elevated platform. Stand on elevated platform by extending hip and knee of first leg and place foot of second leg on bench. Step down with second leg by flexing hip and knee of first leg. Return to original standing position by placing foot of first leg to lower position. Repeat first step with opposite leg, alternating first steps between legs.",
"comments": "Keep torso upright during exercise. Lead knee should point same direction as foot throughout movement. Stepping distance from bench emphasizes Gluteus Maximus stepping close to bench emphasizes Quadriceps.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, levatorscapulae, gluteusmedius, trapeziusmiddle, gluteusminimus, quadratuslumborum, erectorspinae, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gastrocnemius, gluteusmaximus, adductors",
"target": "quadriceps"}}