{"WaistBBHyperextension":{"id": "0",
"exerciseid": "BBHyperextension",
"musclegroup": "Waist",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Barbell Hyperextension",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Position thighs prone on large pad and lower legs under padded brace. Place barbell on back of shoulders and grasp bar to sides.",
"execution": "Raise upper body until hips and waist are fully extended. Lower body by bending hips and waist until fully flexed. Repeat.",
"comments": "Adjust lower leg brace so pressure is evenly distributed on thigh pad. Begin with body weight and add additional weight gradually to allow lower back adequate adaptation. Maintain barbells position on back of shoulders when upper body is lowered. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings and low back. Full range of motion will vary from person to person. Also see Barbell Back Extension and Barbell Hip Extension.",
"stabilizers": "latissimusdorsi, tricepsbrachii, brachioradialis, bicepsbrachii, deltoidposterior, brachialis, teresmajor, trapeziuslower, pectoralisminor, rhomboids",
"synergists": "hamstrings, gluteusmaximus, adductors",
"target": "erectorspinae"},"WaistBBBackExtension":{"id": "1",
"exerciseid": "BBBackExtension",
"musclegroup": "Waist",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Barbell Back Extension (on hyperextension apparatus)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Position thighs prone on large pad and lower legs under padded bar. Place barbell on back of shoulders and grasp bar to sides.",
"execution": "Lower body by bending waist until fully flexed. Raise or extend waist until torso is parallel to legs. Repeat.",
"comments": "Adjust lower leg brace so pressure is evenly distributed on thigh pad. Begin with body weight and add additional weight gradually to allow lower back adequate adaptation. Maintain barbells position on back of shoulders when upper body is lowered. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings and low back. Full range of motion will vary from person to person. Although articulation of waist is emphasized, some hip extension may accommodate movement. Also see Barbell Hyperextension and Barbell Back Raise.",
"stabilizers": "latissimusdorsi, tricepsbrachii, brachioradialis, bicepsbrachii, deltoidposterior, brachialis, teresmajor, trapeziuslower, pectoralisminor, rhomboids",
"synergists": "hamstrings, gluteusmaximus, adductors",
"target": "erectorspinae"},"WaistBB45Hyperextension":{"id": "2",
"exerciseid": "BB45Hyperextension",
"musclegroup": "Waist",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Barbell 45° Hyperextension",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Position thighs prone on padding. Hook heels on platform lip or under padded brace. Place barbell on back of shoulders and grasp bar to sides.",
"execution": "Raise upper body until hips and waist are fully extended. Lower body by bending hips and waist until fully flexed. Repeat.",
"comments": "Position pad high enough to evenly distribute body weight on thigh but not so high that range of motion is limited abdomen should not press on top side of pad when upper body is lowered. Begin with body weight and add additional weight gradually to allow lower back adequate adaptation. Maintain barbells position on back of shoulders when upper body is lowered. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings and low back. Full range of motion will vary from person to person. Also see Barbell Back Extension and Barbell Hip Extension.",
"stabilizers": "latissimusdorsi, tricepsbrachii, brachioradialis, bicepsbrachii, deltoidposterior, brachialis, teresmajor, trapeziuslower, pectoralisminor, rhomboids",
"synergists": "hamstrings, gluteusmaximus, adductors",
"target": "erectorspinae"},"WaistBB45BackExtension":{"id": "3",
"exerciseid": "BB45BackExtension",
"musclegroup": "Waist",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Barbell 45° Back Extension (on hyperextension apparatus)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Position thighs prone on padding. Hook heels on platform lip or under padded brace. Place barbell on back of shoulders and grasp bar to sides.",
"execution": "Lower body by bending waist until fully flexed. Raise, or extend waist until torso is parallel to legs. Repeat.",
"comments": "Position pad high enough to evenly distribute body weight on thigh but not so high that range of motion is limited abdomen should not press on top side of pad when upper body is lowered. Begin with body weight and add additional weight gradually to allow lower back adequate adaptation. Maintain barbells position on back of shoulders when upper body is lowered. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings and low back. Full range of motion will vary from person to person. Although articulation of waist is emphasized, some hip extension may accommodate movement. Also see Barbell Hyperextension and Barbell Back Raise.",
"stabilizers": "latissimusdorsi, tricepsbrachii, brachioradialis, bicepsbrachii, deltoidposterior, brachialis, teresmajor, trapeziuslower, pectoralisminor, rhomboids",
"synergists": "hamstrings, gluteusmaximus, adductors",
"target": "erectorspinae"},"WaistBBBentKneeGoodMorning":{"id": "4",
"exerciseid": "BBBentKneeGoodMorning",
"musclegroup": "Waist",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Barbell Bent Knee Good-morning",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Position barbell on back of shoulders and grasp bar to sides.",
"execution": "Bend hips to lower torso forward until parallel to floor. Bend knees slightly during descent. Raise torso until hips are extended. Repeat.",
"comments": "Target muscle is exercised isometrically . Begin with very light weight and add additional weight gradually to allow adequate adaptation. Throughout lift, keep back straight. Knees will have to bend more in those with less hamstring flexibility. Knees can be kept bent throughout movement. Also see straight leg Goodmorning, emphasizing Hamstrings.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "quadriceps",
"synergists": "hamstrings, gluteusmaximus, adductors",
"target": "erectorspinae"},"WaistBBDeadlift":{"id": "5",
"exerciseid": "BBDeadlift",
"musclegroup": "Waist",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Barbell Deadlift",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "With feet flat beneath bar, squat down and grasp bar with shoulder width or slightly wider overhand or mixed grip.",
"execution": "Lift bar by extending hips and knees to full extension. Pull shoulders back at top of lift if rounded. Return and repeat.",
"comments": "Target muscle is exercised isometrically. Throughout lift, keep hips low, shoulders high, arms and back straight. Knees should point same direction as feet throughout movement. Keep bar close to body to improve mechanical lev erage. Grip strength and strength endurance often limit ability to perform multiple reps at heavy resistances. Gym chalk, wrist straps, grip work, and mixed grip can be used to enhance grip. Mixed grip indicates one hand holding with overhand grip and other hand holding with underhand grip. Lever barbell jack can be used to lift barbell from floor for easier loading and unload of weight plates. In powerlifting, do not squat down too deep and keep shoulder joint slightly behind bar for optimal leverage and mechanics (think teeter toter). Upper body will move back as weight is pulled upward. On rep training, do not merely tap weight to ground, but instead, let barbell settle to ground each rep to sufficiently train range of motion through initial slack of heavy barbell. Heavy barbell deadlifts significantly engageLatissmus Dorsi. See Deadlift under Gluteus Maximus. Also see Deadlift Analysis and Deadlift Strength Standards.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, rhomboids",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "hamstrings, soleus, gluteusmaximus, adductors, quadriceps",
"target": "erectorspinae"},"WaistBBBlockPull":{"id": "6",
"exerciseid": "BBBlockPull",
"musclegroup": "Waist",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Barbell Block Pull",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "With barbell on blocks, position feet shoulder width or slightly narrower beneath bar. Squat down and grasp bar with shoulder width or slightly wider overhand or mixed grip.",
"execution": "Lift bar by extending hips and knees to full extension. Pull shoulders back at top of lift if rounded. Return and repeat.",
"comments": "Throughout lift, keep hips low, shoulders high, arms and back straight. Knees should point same direction as feet throughout movement. Keep bar close to body to improve mechanical leverage. Grip strength and strength endurance often limit ability to perform multiple reps at heavy resistances. Gym chalk, wrist straps, grip work, and mixed grip can be used to enhance grip. Mixed grip indicates one hand holding with overhand grip and other hand holding with underhand grip. Barbell Block Pull emphasizes mid portion of Deadlift and allows more weight to be used while sparing leg involvement. 2 (5 cm), 4 (10 cm), 6 (15 cm), or higher can be used. Target muscle is exercised isometrically. Heavy barbell deadlifts significantly engages Latissmus Dorsi. Movement can be used interchangeably with Barbell Rack Pull. See Barbell Block Pull under Gluteus Maximus. Also see Deadlift Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, rhomboids",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "hamstrings, soleus, gluteusmaximus, adductors, quadriceps",
"target": "erectorspinae"},"WaistBBDeficitDeadlift":{"id": "7",
"exerciseid": "BBDeficitDeadlift",
"musclegroup": "Waist",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Barbell Deficit Deadlift",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand on weight plate, bumper plate, or shallow elevated platform with loaded bar above feet. Squat down and grasp bar with shoulder width or slightly wider overhand or mixed grip.",
"execution": "Lift bar by extending hips and knees to full extension. Pull shoulders back at top of lift if rounded. Return weights to floor by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Repeat.",
"comments": "Throughout lift, keep hips low, shoulders high, arms and back straight. Knees should point same direction as feet throughout movement. Keep bar close to body to improve mechanical leverage. Grip strength and strength endurance often limit ability to perform multiple reps at heavy resistances. Gym chalk, wrist straps, grip work, and mixed grip can be used to enhance grip. Mixed grip indicates one hand holding with overhand grip and other hand holding with underhand grip. Lever barbell jack can be used to lift barbell from floor for easier loading and unloading of weight plates. Barbell Deficit Deadlift emphasizes building strength through lowest portion of Deadlift. Target muscle is exercised isometrically. Heavy barbell deadlifts significantly engages Latissmus Dorsi. See Barbell Deficit Deadlift under Gluteus Maximus. Also see Deadlift Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, rhomboids",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "hamstrings, soleus, gluteusmaximus, adductors, quadriceps",
"target": "erectorspinae"},"WaistBBRackPull":{"id": "8",
"exerciseid": "BBRackPull",
"musclegroup": "Waist",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Barbell Rack Pull",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "In power rack, with barbell on safety bar in low position, place feet shoulder width or slightly narrower beneath bar. Squat down and grasp bar with shoulder width or slightly wider overhand or mixed grip.",
"execution": "Lift bar by extending hips and knees to full extension. Pull shoulders back at top of lift if rounded. Return and repeat.",
"comments": "Throughout lift, keep hips low, shoulders high, arms and back straight. Knees should point same direction as feet throughout movement. Keep bar close to body to improve mechanical leverage. Grip strength and strength endurance often limit ability to perform multiple reps at heavy resistances. Gym chalk, wrist straps, grip work, and mixed grip can be used to enhance grip. Mixed grip indicates one hand holding with overhand grip and other hand holding with underhand grip. Barbell Rack Pull emphasizes mid portion of Deadlift and allows more weight to be used while sparing leg involvement. Measuring bottom of plates from ground 2 (5 cm), 4 (10 cm), 6 (15 cm), or higher can be used. Target muscle is exercised isometrically. Heavy barbell deadlifts significantly engages Latissmus Dorsi. Movement can be used interchangeably with Barbell Block Pull. See Barbell Rack Pull under Gluteus Maximus. Also see Deadlift Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, rhomboids",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "hamstrings, soleus, gluteusmaximus, adductors, quadriceps",
"target": "erectorspinae"},"WaistBBSumoDeadlift":{"id": "9",
"exerciseid": "BBSumoDeadlift",
"musclegroup": "Waist",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Barbell Sumo Deadlift",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Position feet under bar with very wide stance. Squat down and grasp bar between legs with shoulder width mixed grip. Face forward while positioning shoulders upward with arms straight, chest high, hips low, and back straight.",
"execution": "Pull bar up by driving feet outward while pulling chest up. Extend knees when bar passes knees. At top of lift, when torso is upright, drive shoulders back and chest up. Return weight to floor by bending hips back and knees pointed outward, while keeping chest high and back straight. Repeat.",
"comments": "Target muscle is exercised isometrically. Heavy barbell deadlifts significantly engages Latissmus Dorsi. Use shoulder width grip since narrower than shoulder width grip will make it more difficult to lockout at top. Throughout lift, keep hips low, shoulders high, arms and back straight, and knees pointed out same direction as feet. Also, keep bar close to body to improve mechanical leverage. With wide stance, push feet out to sides and not down to prevent knees from buckling inward. Pushing knees out will allow hips to travel toward bar more quickly while improving leverage. During rep training for powerlifting, do not merely tap weight to ground, but instead, let barbell settle to ground each rep to sufficiently train range of motion through initial slack of heavy barbell. See similar exercises Deadlift and Kettlebell Sumo Deadlift. Also see Sumo Deadlift vs Conventional Deadlift and Deadlift Strength Standards.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, rhomboids",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "quadriceps, soleus, gluteusmaximus, adductors",
"target": "erectorspinae"},"WaistBBSumoBlockPull":{"id": "10",
"exerciseid": "BBSumoBlockPull",
"musclegroup": "Waist",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Barbell Sumo Block Pull",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "With barbell on blocks, position feet under bar with very wide stance. Squat down and grasp bar between legs with shoulder width mixed grip. Face forward while positioning shoulders upward with arms straight, chest high, hips low, and back straight.",
"execution": "Pull bar up by driving feet outward while pulling chest up. Extend knees when bar passes knees. At top of lift, when torso is upright, drive shoulders back and chest up. Return weight to blocks by bending hips back and knees pointed outward, while keeping chest high and back straight. Repeat.",
"comments": "Use shoulder width grip since narrower than shoulder width grip will make it more difficult to lockout at top. Throughout lift, keep hips low, shoulders high, arms and back straight, and knees pointed out same direction as feet. Also, keep bar close to body to improve mechanical leverage. With wide stance, push feet out to sides and not down to prevent knees from buckling inward. Pushing knees out will allow hips to travel toward bar more quickly while improving leverage. Barbell Sumo Block Pull emphasizes mid portion of Sumo Deadlift and allows more weight to be used while sparing leg involvement. 2 (5 cm), 4 (10 cm), 6 (15 cm), or higher can be used. Target muscle is exercised isometrically. Heavy barbell deadlifts significantly engages Latissmus Dorsi. See Barbell Sumo Block Pull under Gluteus Maximus. A lso see Sumo Deadlift vs Conventional Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, rhomboids",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "quadriceps, soleus, gluteusmaximus, adductors",
"target": "erectorspinae"},"WaistBBStiffLegDeadlift":{"id": "11",
"exerciseid": "BBStiffLegDeadlift",
"musclegroup": "Waist",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Barbell Stiff Leg Deadlift",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand with shoulder width or narrower stance on shallow platform with feet flat beneath bar. Bend knees and bend over with lower back straight. Grasp barbell with shoulder width overhand or mixed grip, shoulder width or slightly wider. Lift weight to standing position.",
"execution": "Lower bar to top of feet by bending hips. Bend knees slightly during descent and keep waist straight, flexing only slightly at bottom. With knees bent, lift bar by extending at hips until standing upright. Pull shoulders back slightly if rounded. Extend knees at top if desired. Repeat.",
"comments": "Lower back may bend slightly during full hip flexion. Erector Spinae is exercised isometrically if low back does articulate as with Straight Back Stiff Leg Deadlift (targeting Glutes). Begin with light weight and add additional weight gradually to allow adequate adaptation. Throughout lift keep arms straight. Knee can be kept bent throughout movement. Keep bar over top of feet, close to legs. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings. When finished with set, dismount by lowering weight with knees bent and low back straight. Full range of motion will vary from person to person. Those with less flexibility may have to bend knees more or they may not even need to stand on platform. See Dangerous Exercise Essay. Also see Straight Leg Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, trapeziusmiddle, levatorscapulae, trapeziuslower, rhomboids, quadriceps",
"synergists": "hamstrings, gluteusmaximus, adductors",
"target": "erectorspinae"},"WaistBBStraightLegDeadlift":{"id": "12",
"exerciseid": "BBStraightLegDeadlift",
"musclegroup": "Waist",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Barbell Straight Leg Deadlift",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand with shoulder width or narrower stance on shallow platform with feet flat beneath bar. Bend knees and bend over with lower back straight. Grasp barbell with shoulder width overhand or mixed grip, shoulder width or slightly wider. Lift weight to standing position.",
"execution": "With knees straight, lower bar toward top of feet by bending hips and waist. Lift bar by extending waist and hip until standing upright. Pull shoulders back slightly if rounded. Repeat.",
"comments": "Begin with very light weight and add additional weight gradually to allow lower back adequate adaptation. Throughout lift keep arms and knees straight. Keep bar over top of feet, close to legs. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings and low back. Full range of motion will vary from person to person. Choose platform height that allows contact with floor w ith slight stretch or set to height that allows bar to be lowered only millimeters from floor during warm up. This small reserve allows additional room to accommodate the hips loosen up and the grip to give slightly but not so much that would increase risk of descending too far down, beyond a slight stretch. Those with less flexibility may not even need to stand on platform. When finished with set, dismount by lowering weight with knees bent and low back straight. See Dangerous Exercise Essay. Also see Straight Back Straight Leg Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, trapeziusmiddle, levatorscapulae, trapeziuslower, rhomboids",
"synergists": "hamstrings, gluteusmaximus, adductors",
"target": "erectorspinae"},"WaistTBDeadlift":{"id": "13",
"exerciseid": "TBDeadlift",
"musclegroup": "Waist",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Trap Bar Deadlift",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand with feet shoulder width or narrower in trap bar, weight to each side. Squat down with feet flat, low back taut. Grasp handles to sides.",
"execution": "Lift bar by extending hips and knees to full extension. Pull shoulders back at top of lift if rounded. Return and repeat.",
"comments": "Target muscle is exercised isometrically. Throughout lift, keep hips low, shoulders high, arms and back straight.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, rhomboids",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "quadriceps, soleus, gluteusmaximus, adductors",
"target": "erectorspinae"},"WaistTBStiffLegDeadlift":{"id": "14",
"exerciseid": "TBStiffLegDeadlift",
"musclegroup": "Waist",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Trap Bar Stiff Leg Deadlift",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand on platform under loaded trap bar. Squat down and grasp handles to sides. Squat  Deadlift bar up to standing position.",
"execution": "Lower bar by bending hips. Bend knees slightly during descent and keep waist straight, flexing only slightly at bottom. With knees bent, lift bar by extending at hips until standing upright. Pull shoulders back slightly if rounded. Extend knees at top if desired. Repeat.",
"comments": "Lower back may bend slightly during full hip flexion. Erector Spinae is exercised isometrically if low back does articulate as with Straight Back Stiff Leg Deadlift (targeting Glutes). Begin with light weight and add additional weight gradually to allow adequate adaptation. Throughout lift, keep arms straight. Knee can be kept bent throughout movement. Keep bar over top of feet, close to legs. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings. When finished with set, dismount by lowering weight with knees bent and low back straight. Full range of motion will vary from person to person. Those with less flexibility may have to bend knees more or they may not even need to stand on platform. See Dangerous Exercise Essay. Also see Straight Leg Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, trapeziusmiddle, levatorscapulae, trapeziuslower, rhomboids, quadriceps",
"synergists": "hamstrings, gluteusmaximus, adductors",
"target": "erectorspinae"},"WaistTBStraightLegDeadlift":{"id": "15",
"exerciseid": "TBStraightLegDeadlift",
"musclegroup": "Waist",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Trap Bar Straight Leg Deadlift",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand on platform under loaded trap bar. Squat down and grasp handles to sides. Squat  Deadlift bar up to standing position.",
"execution": "With knees straight, lower bar down by bending hips. After hips can no longer flex, bend waist as weights approach floor. Hands should be lowered near sides of ankles. Set weight on floor. Lift bar by extending waist and hip until standing upright. Pull shoulders back slightly if rounded. Repeat.",
"comments": "Not all trap bar designs may allow for this movement. A squared openended trap bar is used in this demonstration. Begin with very light weight and add additional weight gradually to allow lower back adequate adaptation. Throughout lift, keep arms and knees straight. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings and low back. When finished with set, dismount by lowering weight with knees bent and low back straight. Full range of motion will vary from person to person. Those with less flexibility may need lower platform or may not even need to stand on elevated surface. See Dangerous Exercise Essay. Also see Straight Back Straight Leg Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, trapeziusmiddle, levatorscapulae, trapeziuslower, rhomboids",
"synergists": "hamstrings, gluteusmaximus, adductors",
"target": "erectorspinae"}}