{"ChestDoorway":{"id": "0",
"exerciseid": "Doorway",
"musclegroup": "Chest",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "PectoralisMinor",
"name": "Doorway Modified Chest Stretch",
"preparation": "Stand at end of wall or in doorway facing perpendicular to wall. Place front of shoulder and inside of bent arm on surface of wall. Position bent elbow around same height of shoulder. Position both feet back behind original stance.",
"execution": "Lean into wall allowing shoulder to be pushed back. Turn body away from positioned arm. Hold stretch. Repeat with opposite arm.",
"comments": "None",
"other": "pectoralissternal, pectoralisclavicular",
"target": "pectoralisminor"},"ChestLying":{"id": "1",
"exerciseid": "Lying",
"musclegroup": "Chest",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "PectoralisMinor",
"name": "Lying Shoulder Girdle Stretch",
"preparation": "Lie supine with soles of feet on floor, hips and knees bent. Bend elbows and position back of arms against floor or mat with elbows to sides.",
"execution": "Push shoulders, forearms, and back of hand into floor or mat and slowly move arms toward sides of head. Still pushing shoulders and back of arms into floor, slowly arms toward sides.",
"comments": "This dynamic shoulder girdle stretch exercises rhomboids and trapezius isometrically while stretching pectoralis minor and major. It can be prescribed for protracted shoulder girdle. Continuously push shoulders and back of arms into floor or mat throughout stretch. Although arms move slowly throughout stretch, shoulder blades, elbows, and wrists are continuously pushing back against floor or mat. Position pelvis back so low back remains on floor or mat. See movement in Wall Shoulder Girdle Stretch.",
"other": "deltoidposterior, infraspinatus, pectoralisclavicular, subscapularis, deltoidlateral, pectoralissternal, teresminor",
"target": "trapeziuslower, trapeziusmiddle, pectoralisminor, rhomboids"},"ChestTowel":{"id": "2",
"exerciseid": "Towel",
"musclegroup": "Chest",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "PectoralisMinor",
"name": "Towel Shoulder Girdle Stretch",
"preparation": "Grasp large towel or rope with very wide overhand grip, approximately length of arm to opposite elbow. Raise towel over head.",
"execution": "Pull towel back away from back of head while attempting to pull towel outward on each side.",
"comments": "None.",
"other": "pectoralissternal, pectoralisclavicular, subscapularis",
"target": "pectoralisminor"},"ChestWall":{"id": "3",
"exerciseid": "Wall",
"musclegroup": "Chest",
"equipment": "stretch",
"exercisetype": "Stretches",
"muscleclass": "PectoralisMinor",
"name": "Wall Shoulder Girdle Stretch",
"preparation": "Position back against wall. Place feet away from wall, slightly bending hips and knees. Bend elbows and position back of arms against wall with elbows to sides.",
"execution": "Push shoulders and back of arms and hands into wall and slowly raise arms as high as possible. Still pushing shoulders arms, slowly lower arms to starting position.",
"comments": "This dynamic shoulder girdle stretch exercises rhomboids and trapezius isometrically while stretching pectoralis minor and major. It can be prescribed for protracted shoulder girdle. Keep lower and upper back against wall. Continuously push shoulders blades and arms into wall throughout stretch. Although arms move slowly throughout stretch, shoulders, elbows, and wrists are continuously pushing back against wall.",
"other": "deltoidposterior, infraspinatus, pectoralisclavicular, subscapularis, deltoidlateral, pectoralissternal, teresminor",
"target": "trapeziuslower, trapeziusmiddle, pectoralisminor, rhomboids"}}