{"ChestDBInclineBenchPress":{"id": "0",
"exerciseid": "DBInclineBenchPress",
"musclegroup": "Chest",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralClavicular",
"name": "Dumbbell Incline Bench Press",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit down on incline bench with dumbbells resting on lower thigh. Kick weights to shoulders and lean back. Position dumbbells to sides of chest with upper arm under each dumbbell.",
"execution": "Press dumbbells up with elbows to sides until arms are extended. Lower weight to sides of upper chest until slight stretch is felt in chest or shoulder. Repeat.",
"comments": "Dumbbell should follow slight arch pattern, above upper arm between elbow and chest at bottom, traveling inward over each shoulder at top. See suggested mount  dismount and mount  dismount from special machine rack. Also see elevated foot leg positioning to decrease arch in back and Bench Press Analysis.",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "tricepsbrachii, deltoidanterior",
"target": "pectoralisclavicular"},"ChestDBInclineFly":{"id": "1",
"exerciseid": "DBInclineFly",
"musclegroup": "Chest",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralClavicular",
"name": "Dumbbell Incline Fly",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Grasp two dumbbells. Lie supine on bench. Support dumbbells above upper chest with arms fixed in slightly bent position. Bend elbows slightly and internally rotate shoulders so elbows point out to sides.",
"execution": "Lower dumbbells outward to sides of shoulders. Keep elbows fixed in slightly bent position. When a stretch is felt in chest or shoulders, bring dumbbells back together in hugging motion above upper chest until dumbbells are nearly together. Repeat.",
"comments": "Keep shoulders internally rotated so elbows point downward at bottom position and outward at top position. Shoulder will likely have less range of motion in lower position as compared to Fly on flat bench.",
"stabilizers": "brachialis, wristflexors, bicepsbrachii, tricepsbrachii",
"synergists": "bicepsbrachii, deltoidanterior",
"target": "pectoralisclavicular"}}