{"NeckSTNeckFlexion":{"id": "0",
"exerciseid": "STNeckFlexion",
"musclegroup": "Neck",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "Sternocleidomastoid",
"name": "Suspended Neck Flexion",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Place belt or strap around end of suspension trainer. Face away from suspension trainer with belt in hand. Place belt around head above ears and clamp belt snugly around head by tightly gripping ends close to back of midhead. Step forward untilsuspension trainer is taut.Lean forward at angle against support of belt and suspension trainer by stepping back slightly while keeping head and body straight.",
"execution": "Increase angle of body by bowing head until chin touches upper chest. Lower angle of body by raising head. Repeat.",
"comments": "This exercise can be performed with belt looped on TRX style suspension trainer or adjustable length gymnastics rings. Throughout movement, keep body straight and maintain tightgrip on belt against back of midhead throughout movement. Use neck to pull belt rather than allowing hand to assist. Clamping belt higher up further from base of skull will permit torque throughout fuller range of motion, particularly range of motion nearer full flexion. Woven cotton or cloth belts tend to slip less, particularly on bald head. If belt slips from head, place small towel between belt and head. Belts not made specifically for weight training may cause injury if they fail under load in which they were not designed. Easier Begin with upright position at top position so neck structures have an opportunity to adapt. Standard neck exercises with light weights can also be less intense. Weighted Neck FlexionWeighted Lying Neck Flexion Harder Exercise is more challenging when body is angled further forward.",
"antagonist stabilizers": "erectorspinae",
"stabilizers": "quadriceps, rectusabdominis, obliques",
"synergists": "None",
"target": "sternocleidomastoid"},"NeckSTNeckLateralExtension":{"id": "1",
"exerciseid": "STNeckLateralExtension",
"musclegroup": "Neck",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "Sternocleidomastoid",
"name": "Suspended Lateral Neck Flexion",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Place belt or strap around end of suspension trainer. Holdbelt in hand and stand away from suspension trainer so it hangs to one side. Place beltaround head aboveears and clamp belt snugly around head by tightly gripping ends close to head aboveear closest to suspension trainer. Step further away from suspension trainer until it is taut.Lean away at angle against support of belt and suspension trainer by positioning feet closer to side of suspension trainer while keeping head and body straight.",
"execution": "Lower angle of body by tilting head to side of suspension trainer. Increase angle of body by tilting head away from side of suspension trainer.Repeat and continue in opposite position.",
"comments": "This exercise can be performed with belt looped on TRX style suspension trainer or adjustable length gymnastics rings. Throughout movement, keep body straight and maintain tightgrip on belt against side of head throughout movement. Use neck to pull belt rather than allowing hand to assist. Woven cotton or cloth belts tend to slip less, particularly on bald head. If belt slips from head, place small towel between belt and head. Belts not made specifically for weight training may cause injury if they fail under load in which they were not designed. See all muscle used in Lateral Flexion Atlantoccipical  AntlantoaxialCervical SpineThoracic  Lumbar Spine A degree of Thoracic  Lumbar Spine lateral flexion is typical involved in this movement. See animation of spinal lateral flexionduring neck lateral flexion. Easier Begin with upright position at top position so neck structures have an opportunity to adapt. Standard neck exercises with light weights can also be less intense. Weighted Lateral Neck FlexionCable Lateral Neck Flexion Harder Exercise is more challenging when body is angledfurther to side.",
"synergists": "trapeziusupper, splenius, levatorscapulae, gluteusmedius, tensorfasciaelatae, iliopsoas, gluteusminimus, quadratuslumborum, erectorspinae, obliques",
"target": "sternocleidomastoid"}}