{"WaistBWSitUpX":{"id": "0",
"exerciseid": "BWSitUpX",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Sit-up (arms crossed)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Hook feet under foot brace or secure low overhang. Lie supine on mat or bench with hips bent. Cross arms and place hands in front of shoulders.",
"execution": "Raise torso from mat or bench by bending waist and hips. Raise crossed arms over knees at top. Return until back of shoulders contact mat or bench. Repeat.",
"comments": "If upper back does not come completely down at end of movement, abdominal muscles may only be isometrically involved in exercise. Pectineus, Adductor Longus, and Brevis do not assist in hip flexion since hips are already initially bent. See Spot Reduction Myth. Also see Dangerous Exercise Essay. Easier Movement can be made easier extending arms down to sides of body. It can be made easier further by performing movement on decline board. Situp (arms to sides) Harder Exercise can be made more challenging by placing hands further up near head. See Arm Position During Waist Exercises. Exercise can also be performed on incline board or with additional weight. Incline SitupWeighted Situp",
"stabilizers": "tibialisanterior",
"synergists": "iliopsoas, sartorius, obliques, tensorfasciaelatae, quadriceps",
"target": "rectusabdominis"},"WaistBWCrunchX":{"id": "1",
"exerciseid": "BWCrunchX",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Crunch (arms crossed)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie supine on mat with lower legs on bench. Cross wrists on chest.",
"execution": "Flex waist to raise upper torso from mat. Keep low back on mat and raise torso up as high as possible. Return until back of shoulders contact mat. Repeat.",
"comments": "Leg elevation keeps pelvis tilted back, keeping low back on mat. See Spot Reduction Myth. Easier Movement can be made easier by placing arms further down away from head or extended up above knees. Deconditioned individuals can start on slightly declined board. Crunch (arms down) Harder Exercise can be made more challenging by placing hands further up toward head. See Arm Position During Waist Exercises. Exercise can also be performed on incline board or with additional weight. CrunchWeighted Crunch",
"stabilizers": "No significant stabilizers",
"synergists": "obliques",
"target": "rectusabdominis"},"WaistBWInclineCrunchDown":{"id": "2",
"exerciseid": "BWInclineCrunchDown",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Incline Crunch (arms down)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Hook feet under foot brace and lie supine on incline board with hips bent. Extend arms down to sides or cross arms on chest.",
"execution": "Flex waist to raise upper torso from bench. Keep low back on bench and raise torso up as high as possible. Return until back of shoulders contact incline board. Repeat.",
"comments": "If no knee support is built in to incline board, ball can be placed under legs. Hip and knee flexors may be involved as stabilizers if incline is steep and no calf support is used. See Spot Reduction Myth . Easier To make this movement easier, perform crunches on lower height incline or on flat surface. Crunches (arms down)Crunches (arms on chest) Harder Exercise can be made more challenging by placing hands further up toward head. See Arm Position During Waist Exercises . Exercise can also be performed on higher incline board or with additional weight. Incline Crunch (arms on neck)Weighted Incline Crunch",
"stabilizers": "tibialisanterior",
"synergists": "obliques",
"target": "rectusabdominis"},"WaistBWInclineLegHipRaise":{"id": "3",
"exerciseid": "BWInclineLegHipRaise",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Incline Leg-Hip Raise",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Lie supine on incline board with torso elevated. Grasp feet hooks or sides of board by head for support.",
"execution": "Raise legs by flexing hips and knees until hips are fully flexed. Continue to raise knees toward shoulders by flexing waist, raising hips from board. Return until waist, hips and knees are extended. Repeat.",
"comments": "When raising hips, keep knees fully flexed, so as not to throw weight of lower legs over head. Rectus Abdominis and Obliques dynamically contract only if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only isometrically contract to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible. See Spot Reduction Myth and Lower Ab Myth. Also see Incline Leg Raise. Easier Exercise can be made easier by decreasing decline or lying on horizontal surface. Lying LegHip Raise Harder Exercise can be performed with additional weight. Elevate incline or perform in vertical orientation to increase resistance. Weighted Incline Leghip RaiseVertical Leghip Raise (Boso)Vertical Leghip Raise on parallel barsHanging Leghip Raise",
"stabilizers": "latissimusdorsi, deltoidposterior, teresmajor, tricepsbrachii, pectoralissternal, quadriceps",
"dynamic stabilizers": "quadriceps",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, obliques",
"target": "rectusabdominis"},"WaistBWLegHipRaiseExBall":{"id": "4",
"exerciseid": "BWLegHipRaiseExBall",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Leg-Hip Raise (on stability ball)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Position ball against sturdy support. Lie with back on ball and heels on floor with legs straight. Grasp sturdy bar(s) near head for support.",
"execution": "Raise legs by flexing hips and knees until hips are fully flexed. Continue to raise knees toward shoulders by flexing waist, raising hips from board. Return until waist, hips and knees are extended. Repeat.",
"comments": "When raising hips, keep knees fully flexed, so as not to throw weight of lower legs over head. Rectus Abdominis and Obliques dynamically contract only if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only isometrically contract to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible. See Spot Reduction Myth and Lower Ab Myth. Also Incline LegHip Raise on incline board. Easier Exercise can be made easier by positioning body so it is orientated more horizontally. Alternatively, movement can be performed on bench. Lying Leg Hip Raise Harder For greater difficulty, body can be orientated so torso is at greater elevation. Exercise can be performed with additional weight or movement can be performed in vertical orientation. Weighted Incline Leghip RaiseVertical Leghip Raise (Boso)Vertical Leghip Raise on parallel barsHanging Leghip Raise",
"stabilizers": "latissimusdorsi, deltoidposterior, teresmajor, tricepsbrachii, pectoralissternal, quadriceps",
"dynamic stabilizers": "quadriceps",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, obliques",
"target": "rectusabdominis"},"WaistBWHangingStraightLegHipRaise":{"id": "5",
"exerciseid": "BWHangingStraightLegHipRaise",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Hanging Straight Leg-Hip Raise",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Grasp and hang from high bar.",
"execution": "Raise legs by flexing hips until fully flexed. Continue to raise feet toward bar by flexing waist. Return until waist and hips are extended downward. Repeat.",
"comments": "Attempt to decrease shoulder flexion during movement. Rectus Abdominis and Obliques only dynamically contract if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only isometrically contract to stabilize pelvis and waist during hip flexion. Waist flexion will occur earlier in lift if legs are straighter or Hamstrings are not that flexible. Also known as ToestoBar or  Strict ToestoBar. See Spot Reduction Myth and Lower Ab Myth. Also Weighted Hanging Straight Leg Raise. Easier Movement can be made easier by Bending knees or performing exercise on incline board. Hanging LegHip RaiseIncline LegHip Raise Harder Exercise can be made more challenging by placing weight between ankles, although caution should be practiced not to accidentally drop weight onto head or body.",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps, obliques",
"target": "rectusabdominis"},"WaistBWBallRollout":{"id": "6",
"exerciseid": "BWBallRollout",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Stability Ball Rollout",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Kneel on floor or mat facing stability ball within arms reach. Straighten hips with subtle bend. Also straighten arms with slight bend, down in front of body. Place fists side by side on upper side of ball closest to hips.",
"execution": "Lean forward and roll ridged arms out over ball. Roll forward as far as possible. Raise body back up by pulling arms back until kneeling upright in original position. Repeat.",
"comments": "Try to keep elbows nearly straight throughout exercise. Also known as Stability Ball Kneeling Rollout. Target muscle, Rectus Abdominis practically contracts isometrically since only a small degree of waist flexion occurs under resistance and, with the assistance of the External Oblique, act to stabilize spine. See target muscle of rollout question. Also see Spot Reduction Myth and Lower Ab Myth. Easier Movement can be made slightly easier by performing exercise on a larger ball. Descending only part way down is much easier and can be performed in this way to progress into exercise. For greater stability, arms can be placed slightly further apart and legs can be positioned further apart. Front Plank can be performed to work abdominals in similar manner until greater strength can be developed through shoulders required to execute this exercise. Harder Make sure to roll out until shoulder is fully extended through full range of motion. Exercise can be made slightly more challenging by using smaller stability ball or kneeling on slightly elevated platform, keeping exercise ball on floor. To challenge stability, arms andor legs can be placed closer together.",
"antagonist stabilizers": "erectorspinae",
"dynamic stabilizers": "quadriceps",
"stabilizers": "pectoralisclavicular, tricepsbrachii, tensorfasciaelatae, wristflexors, iliopsoas, sartorius, adductors, pectineus, obliques",
"synergists": "latissimusdorsi, deltoidposterior, pectoralisminor, teresmajor, pectoralissternal, rhomboids",
"target": "rectusabdominis"},"WaistBWLyingLegHipRaise":{"id": "7",
"exerciseid": "BWLyingLegHipRaise",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Lying Leg-Hip Raise",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Lie supine on bench or floor. Grasp sides of bench for support.",
"execution": "Raise legs by flexing hips while flexing knees until hips are fully flexed. Continue to raise knees toward shoulders by flexing waist, raising hips from board. Return until waist, hips and knees are extended. Repeat.",
"comments": "When raising hips, keep knees fully flexed, so as not to throw weight of lower legs over head. Rectus Abdominis and Obliques dynamically contract only if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only isometrically contract to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible. See Spot Reduction Myth and Lower Ab Myth. Easier To decrease intensity, perform exercise on floor and allow heels to make contact with floor each repetition or perform on slightly declined surface. Harder Perform on incline board or exercise ball to increase resistance. Exercise can also be performed with added weight. Incline LegHip RaiseLegHip Raise on Exercise BallWeighted Lying LegHip Raise",
"stabilizers": "latissimusdorsi, deltoidposterior, teresmajor, tricepsbrachii, pectoralissternal, quadriceps",
"dynamic stabilizers": "quadriceps",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, obliques",
"target": "rectusabdominis"},"WaistBWBallCrunchX":{"id": "8",
"exerciseid": "BWBallCrunchX",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Crunch (on stability ball, arms crossed)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on exercise ball. Walk forward on ball and lie back on ball with shoulders and head hanging off and knees and hips bent. Gently hyperextend back on contour of ball. Cross arms on chest.",
"execution": "Flex waist to raise upper torso. Return to original position. Repeat.",
"comments": "Some individuals may experience low back discomfort if hips are not bent so they must use smaller ball size or lower their hip position on ball. See Spot Reduction Myth. Easier Movement can be made easier by positioning hips low on ball or placing arms further down to sides of waist. See Arm Position During Waist Exercises. Harder Exercise can be made more challenging by using positioning ball lower on back and hips higher or placing hands behind neck or beside head. hand behind neck",
"stabilizers": "No significant stabilizers",
"synergists": "obliques",
"target": "rectusabdominis"},"WaistBWVerticalLegHipRaisePB":{"id": "9",
"exerciseid": "BWVerticalLegHipRaisePB",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Vertical Leg-Hip Raise (parallel bars)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand between parallel bars and grip bar on each side with overhand grip. Lift body off floor and balance body upright with arms straight.",
"execution": "Raise legs by flexing hips and knees until hips are fully flexed. Continue to raise knees toward shoulders by flexing waist. Return until waist, hips, and knees are extended. Repeat.",
"comments": "This exercise is alternative to Vertical Leghip Raise when apparatus is not available, or Hanging Leghip Raise when high bar is not available or too low to allow for adequate leg clearance. Rectus Abdominis and Obliques dynamically contract only if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only isometrically contract to stabilize pelvis and waist during hip flexion see Weighted Vertical Leg Raise on parallel bars. It may be necessary to completely flex hips before waist flexion is possible. See Spot Reduction Myth and Lower Ab Myth. Easier Movement can be made easier by performing exercise on incline board. Incline Leg Hip Raise Harder Exercise can be made more challenging placing weight between ankles Weighted Vertical LegHip Raise on Parallel Bars",
"dynamic stabilizers": "quadriceps",
"stabilizers": "latissimusdorsi, deltoidposterior, pectoralisminor, tricepsbrachii, trapeziuslower, pectoralissternal, deltoidanterior",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, obliques",
"target": "rectusabdominis"},"WaistBWVerticalLegHipRaiseBosa":{"id": "10",
"exerciseid": "BWVerticalLegHipRaiseBosa",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Vertical Leg-Hip Raise (Bosu support)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Position forearms on padded parallel bars with hands on handles and back on convexed surface.",
"execution": "Raise legs by flexing hips and knees. As hips approach full flexion, lean back. Continue to raise knees toward shoulders by flexing waist and raising hips and low back from convexed surface. Return until waist, hips, and knees are extended. Repeat.",
"comments": "Rectus Abdominis and Obliques dynamically contract only if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only isometrically contract to stabilize pelvis and waist during hip flexion see Weighted Vertical Leg Raise. It may be necessary to completely flex hips before waist flexion is possible. See Spot Reduction Myth and Lower Ab Myth. Easier Lie on flat surface, incline board, or exercise ball to make this movement less intense. Incline Leg Hip RaiseLegHip Raise (on Exercise Ball)Lying LegHip Raise Harder Exercise can be performed with added weight to increase intensity. Weighted Vertical Leg Hip Raise (Bosa)",
"stabilizers": "latissimusdorsi, trapeziuslower, pectoralisminor, pectoralissternal",
"dynamic stabilizers": "quadriceps",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps, obliques",
"target": "rectusabdominis"},"WaistBWInvertedSitup":{"id": "11",
"exerciseid": "BWInvertedSitup",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Inverted Sit-up",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Hang inverted from high bar with gravity boots on each leg. Lie supine with hands on floor over head.",
"execution": "Raise trunk as high as possible by flexing hips and waist. Return to starting position. Repeat.",
"comments": "See Arm Position During Waist Exercises. Straight knees during this exercise will inhibit hip range of motion via passive insufficiency of hamstring causing waist flexion sooner in the movement. The Rectus Abdominis and Obliques dynamically contract only when actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only isometrically contract to stabilize pelvis and waist during hip flexion. See Spot Reduction Myth and Lower Ab Myth. Easier Movement can be made easier by lowering incline, performing movement on horizontal surface, or placing arms further down away from head. Incline Situp Harder Exercise can be made more challenging by placing arm further along body or even more challenging by placing hands near head or beyond head. See Arm Position During Waist Exercises. Exercise can also be performed with additional weight.",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps, obliques",
"target": "rectusabdominis"},"WaistBWCrunch":{"id": "12",
"exerciseid": "BWCrunch",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Crunch",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie supine on mat with lower legs on bench. Place hands behind neck or head.",
"execution": "Flex waist to raise upper torso from mat. Keep low back on mat and raise torso up as high as possible. Return until back of shoulders contact mat. Repeat.",
"comments": "Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. See Spot Reduction Myth. Easier Movement can be made easier by placing arms further down away from head. Crunch (arms on chest) Harder Exercise can be made more challenging by placing hands further up on head or beyond head. See Arm Position During Waist Exercises. Exercise can also be performed on incline board or with additional weight. Weighted CrunchIncline Crunch",
"stabilizers": "No significant stabilizers",
"synergists": "obliques",
"target": "rectusabdominis"},"WaistBWCrunchUp":{"id": "13",
"exerciseid": "BWCrunchUp",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Crunch Up",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie supine on mat or floor with bent leg and arms pointed up.",
"execution": "Flex waist to raise upper torso from floor. Return until back of shoulders contact padded incline board. Repeat.",
"comments": "Hip may move slightly during exercise. Exercise can be performed with added resistance if needed, by holding weight above. Quadriceps were not listed under stabilizers since they are not under significant resistance. Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. See Arm Position During Waist Exercises and Spot Reduction Myth.",
"stabilizers": "hip#flexion",
"synergists": "obliques",
"target": "rectusabdominis"},"WaistWtJackKnifeSitUp":{"id": "14",
"exerciseid": "WtJackKnifeSitUp",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Jack-knife Sit-up",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Sit on floor or mat. Lie supine with hands to sides.",
"execution": "Simultaneously raise knees and torso until hips and knees are flexed. Return to starting position with waist, hips and knees extended. Repeat.",
"comments": "Begin each repetition with upper back on floor to allow abdominal muscles to work dynamically. The Rectus Abdominis and Obliques dynamically contract only when actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only isometrically contract to stabilize pelvis and waist during hip flexion. See Spot Reduction Myth and Lower Ab Myth.",
"dynamic stabilizers": "quadriceps",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, obliques",
"target": "rectusabdominis"},"WaistWtVUp":{"id": "15",
"exerciseid": "WtVUp",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "V-up",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Sit on floor or mat. Lie supine with hands on floor over head.",
"execution": "Simultaneously raise straight legs and torso. Reach toward raised feet. Return to starting position. Repeat.",
"comments": "Keep knees straight throughout movement. Begin each repetition with upper back on floor to allow abdominal muscles to work dynamically. The Rectus Abdominis and Obliques dynamically contract only when actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only isometrically contract to stabilize pelvis and waist during hip flexion. See Spot Reduction Myth and Lower Ab Myth.",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps, obliques",
"target": "rectusabdominis"},"WaistBWCrunchAD":{"id": "16",
"exerciseid": "BWCrunchAD",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Crunch (arms down)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie supine on mat or bench. Bend knees and hips and place feet on floor. Extend arms down to sides.",
"execution": "Flex waist to raise upper torso from mat or bench. Keep low back on floor or mat and raise torso up as high as possible. Extend hands toward sides of heels. Return until back of shoulders contact mat or bench. Repeat.",
"comments": "Certain individuals may need to keep their neck in neutral position with space between their chin and sternum, particularly if hands are placed behind head. See Spot Reduction Myth. Also see Curlup  Half Situp Test. Easier Deconditioned individuals can start on slightly declined board. Harder Exercise can be made more challenging by placing hands further up toward head. See Arm Position During Waist Exercises. Exercise can also be performed on incline board or with additional weight. Crunch (arms on chest)CrunchIncline Crunch",
"stabilizers": "No significant stabilizers",
"synergists": "obliques",
"target": "rectusabdominis"},"WaistBWInclineSitUpX":{"id": "17",
"exerciseid": "BWInclineSitUpX",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Incline Sit-up (arms crossed)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Hook feet under foot brace and lie supine on incline board with hips bent. Cross arms on chest.",
"execution": "Raise torso from bench by bending waist and hips. Raise crossed arms over knees at top. Return until back of shoulders contact incline board. Repeat.",
"comments": "If no knee support is built in to incline board, ball can be placed under legs. If upper back does not come completely down at end of movement, abdominal muscles may only be isometrically involved in exercise. Pectineus, Adductor Longus, and Brevis do not assist in hip flexion since hips are already initially bent. Knee flexors may be involved as stabilizers if incline is steep and no calf support is used. See Spot Reduction Myth. Also see Dangerous Exercise Essay. Easier Movement can be made easier by lowering incline, performing movement on horizontal surface, or extending arms over legs. Situp Harder Exercise can be made more challenging by placing hands further up near head. See Arm Position During Waist Exercises. Exercise can also be performed on higher incline board or with additional weight. Incline Situp (arms behind neck)Weighted Incline Situp",
"stabilizers": "tibialisanterior",
"synergists": "iliopsoas, sartorius, obliques, tensorfasciaelatae, quadriceps",
"target": "rectusabdominis"},"WaistBWBallCrunch":{"id": "18",
"exerciseid": "BWBallCrunch",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Ball Crunch (on stability ball)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on exercise ball. Walk forward on ball and lie back on ball with shoulders and head hanging off and knees and hips bent. Gently hyperextend back on contour of ball. Place hands behind neck or beside head.",
"execution": "Flex waist to raise upper torso. Return to original position. Repeat.",
"comments": "Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. Some individuals may experience low back discomfort if hips are not bent so they must use smaller ball size or lower their hip position on ball. See Spot Reduction Myth. Easier Movement can be made easier by positioning hips low on ball or placing arms further down away from head. See Arm Position During Waist Exercises. arms crossed Harder Exercise can be made more challenging by using positioning ball lower on back and hips higher or adding additional weight. Weighted Ball Crunch",
"stabilizers": "No significant stabilizers",
"synergists": "obliques",
"target": "rectusabdominis"},"WaistBWVertStraightLegHipRaisePB":{"id": "19",
"exerciseid": "BWVertStraightLegHipRaisePB",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Vertical Straight Leg-Hip Raise (parallel bars)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand between parallel bars and grip bar on each side with overhand grip. Lift body off floor and balance body upright with arms straight.",
"execution": "Raise legs by flexing hips until fully flexed. Continue to raise feet toward bar by flexing waist. Return until waist and hips are extended downward. Repeat.",
"comments": "This exercise is alternative to Hanging Straight LegHip Raise when high bar is not available or too low to allow for adequate leg clearance. Rectus Abdominis and Obliques dynamically contract only if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only isometrically contract to stabilize pelvis and waist during hip flexion see Weighted Vertical Leg Raise on parallel bars. It may be necessary to completely flex hips before waist flexion is possible. Waist flexion will occur earlier in lift if legs are straighter or Hamstrings are not that flexible. See Spot Reduction Myth and Lower Ab Myth. Easier Movement can be made easier by performing exercise with bent knees. Vertical LegHip Raise Harder Exercise can be made more challenging by straightening knees more or placing weight between ankles Weighted Hanging Straight LegHip RaiseWeighted Vertical LegHip Raise",
"stabilizers": "latissimusdorsi, deltoidposterior, pectoralisminor, tricepsbrachii, trapeziuslower, pectoralissternal, deltoidanterior",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps, obliques",
"target": "rectusabdominis"},"WaistBWHangingLegHipRaise":{"id": "20",
"exerciseid": "BWHangingLegHipRaise",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Hanging Leg-Hip Raise",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand below ab straps hanging from high bar. Place upper arms in straps and grasp straps above.",
"execution": "Raise legs by flexing hips and knees until hips are fully flexed. Continue to raise knees toward shoulders by flexing waist. Return until waist, hips, and knees are extended downward. Repeat.",
"comments": "Exercise can be performed without ab straps just by hanging from bar. Rectus Abdominis and Obliques only dynamically contract if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only isometrically contract to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible. See Spot Reduction Myth and Lower Ab Myth. Easier Lie on flat surface or incline to make this exercise less intense. Incline Leg Hip Raise Harder Exercise can be performed with added weight to increase intensity. Weighted Hanging Leg Hip Raise",
"dynamic stabilizers": "quadriceps",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, obliques",
"target": "rectusabdominis"},"WaistBWSitUp":{"id": "21",
"exerciseid": "BWSitUp",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Sit-up",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Hook feet under foot brace or secure low overhang. Lie supine on floor or bench with hips bent. Place hands behind neck or on side of neck.",
"execution": "Raise torso from bench by bending waist and hips. Return until back of shoulders contact incline board. Repeat.",
"comments": "Feet can be held down by partner instead of foot bar. Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. If upper back does not come completely down at end of movement, abdominal muscles may only be isometrically involved in exercise. Pectineus, Adductor Longus, and Brevis do not assist in hip flexion since hips are already initially bent. See Spot Reduction Myth. Also see Dangerous Exercise Essay. Easier Movement can be made easier by placing arms further down away from head. Situp (arms on shoulders) Harder Exercise can be made more challenging by placing hands further up on head or beyond head. See Arm Position During Waist Exercises. Exercise can also be performed on incline board or with additional weight. Incline Situp (Advanced)Weighted Situp",
"stabilizers": "tibialisanterior",
"synergists": "iliopsoas, sartorius, obliques, tensorfasciaelatae, quadriceps",
"target": "rectusabdominis"},"WaistBWVerticalLegHipRaise":{"id": "22",
"exerciseid": "BWVerticalLegHipRaise",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Vertical Leg-Hip Raise",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Position forearms on padded parallel bars with hands on handles, and back on vertical pad.",
"execution": "Raise legs by flexing hips and knees until hips are fully flexed. Continue to raise knees toward shoulders by flexing waist, raising hips from back board. Return until waist, hips, and knees are extended. Repeat.",
"comments": "Rectus Abdominis and Obliques dynamically contract only if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only isometrically contract to stabilize pelvis and waist during hip flexion see Weighted Vertical Leg Raise. It may be necessary to completely flex hips before waist flexion is possible. See Spot Reduction Myth and Lower Ab Myth. Easier Exercise is somewhat easier on Vertical Leg Raise Apparatus with angled back support. Other ways to make this exercise less intense include lying on flat surface, incline board, or exercise ball. Incline LegHip RaiseLegHip Raise (on exercise ball)Lying LegHip Raise Harder Exercise can be performed with added weight or knees and may be kept extended throughout leg raise to increase intensity. Weighted Vertical LegHip RaiseVertical Straight LegHip Raise on parallel bars",
"stabilizers": "latissimusdorsi, trapeziuslower, pectoralisminor, pectoralissternal",
"dynamic stabilizers": "quadriceps",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps, obliques",
"target": "rectusabdominis"},"WaistBWKneelingWheelRollout":{"id": "23",
"exerciseid": "BWKneelingWheelRollout",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Wheel Rollout",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Kneel on floor or mat. Grasp handles on wheel to each side with overhand grip. Position wheel near front of knees and lean over wheel with arms extended downward, supporting upper body.",
"execution": "With arms straight, roll wheel out as far as possible. Lower body gently to floor extending arms forward. Raise body back up by flexing hips and pulling arms back to original position. Return until hips are extended. Repeat.",
"comments": "Keep elbows straight or nearly straight throughout exercise. Also known as Wheel Kneeling Rollout. Rectus Abdominis and Obliques practically contract isometrically since little waist flexion occurs under resistance. With no waist flexion, Rectus Abdominis and External Oblique act to stabilize pelvis and waist during hip flexion. See target muscle of rollout question. Also see Spot Reduction Myth and Lower Ab Myth. Easier Descending only part way down is much easier and can be performed in this way to progress into exercise. Movement can also be made easier by performing exercise up an incline (i.e. end of incline ab board or decline bench) or assisted by cable. Cable Assisted Wheel Rollout Harder Make sure to roll out until shoulder is fully extended through full range of motion. Exercise can be made much more challenging by performing exercise on feet with knees straight, up an incline, progressing to floor.",
"antagonist stabilizers": "erectorspinae",
"dynamic stabilizers": "quadriceps",
"stabilizers": "pectoralisclavicular, tricepsbrachii, wristflexors, rectusabdominis, obliques",
"synergists": "latissimusdorsi, tensorfasciaelatae, pectoralissternal, sartorius, deltoidposterior, teresmajor, adductors, pectineus, pectoralisminor, rhomboids",
"target": "iliopsoas"},"WaistBWInclineSitUp":{"id": "24",
"exerciseid": "BWInclineSitUp",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Incline Sit-up",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Hook feet under support and lie supine on incline bench with hips bent. Place hands behind neck or on side of neck.",
"execution": "Raise torso from bench by bending waist and hips. Return until back of shoulders contact incline board. Repeat.",
"comments": "Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. If no knee support is built in to incline board, ball can be placed under legs. If upper back does not come completely down at end of movement, abdominal muscles may only be isometrically involved in exercise. Pectineus, Adductor Longus, and Brevis do not assist in hip flexion since hips are already initially bent. Knee flexors may be involved as stabilizers if incline is steep and no calf support is used. See Spot Reduction Myth. Also see Dangerous Exercise Essay. Easier Movement can be made easier by lowering incline, performing movement on horizontal surface, or placing arms further down away from head. SitupIncline Situp (arms crossed) Harder Exercise can be made more challenging by placing hands further up on head or beyond head. See Arm Position During Waist Exercises. Exercise can also be performed on higher incline board or with additional weight or inverted with gravity boots. Inverted Situp (with gravity boots)Weighted Incline Situp (Advanced)",
"stabilizers": "tibialisanterior",
"synergists": "iliopsoas, sartorius, obliques, tensorfasciaelatae, quadriceps",
"target": "rectusabdominis"},"WaistBWSitUpAD":{"id": "25",
"exerciseid": "BWSitUpAD",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Sit-up (arms down)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Lie supine on mat or bench with hips bent and feet on floor or bench. Hook feet under foot brace or secure low overhang if required to keep feet down. Extend arms down to sides.",
"execution": "Raise torso from mat or bench by bending waist and hips. Extend hands toward sides of heels. Return until back of shoulders contact mat or bench. Repeat.",
"comments": "If upper back does not come completely down at end of movement, abdominal muscles may only be isometrically involved in exercise. Pectineus, Adductor Longus, and Brevis do not assist in hip flexion since hips are already initially bent. See Spot Reduction Myth. Also see Dangerous Exercise Essay. Easier Movement can be made easier by performing movement on decline board. Harder Exercise can be made more challenging by crossing arms on chest. See Arm Position During Waist Exercises. Situp (arms crossed)",
"stabilizers": "tibialisanterior",
"synergists": "iliopsoas, sartorius, obliques, tensorfasciaelatae, quadriceps",
"target": "rectusabdominis"},"WaistBWInclineCrunch":{"id": "26",
"exerciseid": "BWInclineCrunch",
"musclegroup": "Waist",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Incline Crunch",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Hook feet under foot brace and lie supine on incline board with hips bent. Place hands behind neck or head.",
"execution": "Flex waist to raise upper torso from bench. Keep low back on bench and raise torso up as high as possible. Return until back of shoulders contact incline board. Repeat.",
"comments": "If no knee support is built in to incline board, ball can be placed under legs. Hip and knee flexors may be involved as stabilizers if incline is steep and no calf support is used. Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. See Spot Reduction Myth. Easier To make this movement easier, place arms further down on body. Movement can also be performed on lower height incline or on flat surface. Incline Crunches (arms down)Crunches (hand behind neck) Harder Exercise can be made more challenging by placing hands further up on head. See Arm Position During Waist Exercises. Exercise can also be performed on higher incline board or with additional weight. Weighted Incline Crunch",
"stabilizers": "tibialisanterior",
"synergists": "obliques",
"target": "rectusabdominis"}}