{"BackASChinupBand":{"id": "0",
"exerciseid": "ASChinupBand",
"musclegroup": "Back",
"equipment": "band-assisted",
"exercisetype": "WeightExercises",
"muscleclass": "LatissimusDorsi",
"name": "Band-assisted Chin-up",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Grab each side of hanging exercise band with both hands. Stretch exercise band down and step onto bottom inside of band with one foot. Stretch band down further by extending leg straight down. Reach up and grasp bar with underhand shoulder widthgrip while keeping banded leg straight.",
"execution": "Pull body up until elbows are to sides. Lower body until arms and shoulders are fully extended. Repeat.",
"comments": "Free foot can be placed inside of band (as shown) or on top of foot in band forsafety in case band slips from foot. At conclusion of set, stepdown with free foot at bottom of exercises. Dismount band by grasping each side of exercise band, stretch exercise band down, and step out. Continuing to hold on to each side of band while allowing band to contract to normal length. Easier To decrease difficulty, use thicker band or perform other assisted version of this exercise. Partner Assisted ChinupSelfassisted ChinupMachine Assisted Chinup Harder To increase difficulty, use thinner band or place bent knee onto bottom inside of band. See video Bandassisted Chinup with knee in band. After some time, finally progress to Chinups without assistance.",
"dynamic stabilizers": "bicepsbrachii, tricepsbrachii",
"synergists": "levatorscapulae, brachioradialis, pectoralissternal, brachialis, deltoidposterior, trapeziusmiddle, teresmajor, trapeziuslower, pectoralisminor, rhomboids",
"target": "latissimusdorsi"},"BackASPullupBand":{"id": "1",
"exerciseid": "ASPullupBand",
"musclegroup": "Back",
"equipment": "band-assisted",
"exercisetype": "WeightExercises",
"muscleclass": "LatissimusDorsi",
"name": "Band-assisted Pull-up",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Grab each side of hanging exercise band with both hands. Stretch exercise band down and step onto bottom inside of band with one foot. Stretch band down further by extending leg straight down. Reach up and grasp bar with overhand wide grip while keeping banded leg straight.",
"execution": "Pull body up until chin is above bar. Lower body until arms and shoulders are fully extended. Repeat.",
"comments": "Free foot can be placed on top of foot in band forsafety in case band slips from foot.Range of motion will be compromised if grip is too wide. At conclusion of set, stepdown with free foot at bottom of exercises. Dismount band by grasping each side of exercise band, stretch exercise band down, and step out. Continuing to hold on to each side of band while allowing band to contract to normal length. Easier To decrease difficulty, use thicker band or perform other assisted version of this exercise. Machine Assisted PullupSelfassisted PullupPartner Assisted Pullup Harder To increase difficulty, use thinner band or place bent knee onto bottom inside of band. After some time, finally progress to Pullups without assistance.",
"dynamic stabilizers": "tricepsbrachii",
"synergists": "infraspinatus, rhomboids, levatorscapulae, brachioradialis, bicepsbrachii, deltoidposterior, brachialis, trapeziusmiddle, teresmajor, trapeziuslower, pectoralisminor, teresminor",
"target": "latissimusdorsi"},"BackASNeutralGripPullupFootBand":{"id": "2",
"exerciseid": "ASNeutralGripPullupFootBand",
"musclegroup": "Back",
"equipment": "band-assisted",
"exercisetype": "WeightExercises",
"muscleclass": "LatissimusDorsi",
"name": "Band-assisted Neutral Grip Pull-up",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Grab each side of hanging exercise band with both hands. Stretch exercise band down and step onto bottom inside of band with one foot. Stretch band down further by extending leg straight down. Reach up and grasp bar with neutral grip while keeping banded leg straight.",
"execution": "Pull body up until neck reaches height of hands. Lower body until arms and shoulders are fully extended. Repeat.",
"comments": "Special angled pullup bar assembly is shown. Free foot can be placed on top of foot in band forsafety in case band slips from foot. At conclusion of set, stepdown with free foot at bottom of exercises. Dismount band by grasping each side of exercise band, stretch exercise band down, and step out. Continuing to hold on to each side of band while allowing band to contract to normal length. Easier To decrease difficulty, use thicker band or perform other assisted version of this exercise. Harder To increase difficulty, use thinner band or place bent knee onto bottom inside of band. See videoBandassisted Chinup with knee in band. After some time, finally progress toNeutral Grip Pullupswithout assistance.",
"dynamic stabilizers": "tricepsbrachii",
"synergists": "levatorscapulae, brachioradialis, pectoralissternal, bicepsbrachii, brachialis, teresmajor, trapeziuslower, pectoralisminor, rhomboids",
"target": "latissimusdorsi"},"BackASParallelGripPullupBand":{"id": "3",
"exerciseid": "ASParallelGripPullupBand",
"musclegroup": "Back",
"equipment": "band-assisted",
"exercisetype": "WeightExercises",
"muscleclass": "LatissimusDorsi",
"name": "Band-assisted Parallel Grip Pull-up",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Grab each side of hanging exercise band with both hands. Stretch exercise band down and step onto bottom inside of band with one foot. Stretch band down further by extending leg straight down. Reach up and grasp parallel bars while keeping banded leg straight.",
"execution": "Pull body up until elbow are to sides. Lower body until arms and shoulders are fully extended. Repeat.",
"comments": "Free foot can be placed inside of band (as shown) or on top of foot in band forsafety in case band slips from foot. At conclusion of set, stepdown with free foot at bottom of exercises. Dismount band by grasping each side of exercise band, stretch exercise band down, and step out. Continuing to hold on to each side of band while allowing band to contract to normal length. Easier To decrease difficulty, use thicker band or perform other assisted version of this exercise. Machine Assisted Parallel Grip Pullup Harder To increase difficulty, use thinner band or place bent knee onto bottom inside of band. See video Bandassisted Chinup with knee in band. After some time, finally progress to Parallel Grip Pullup without assistance.",
"dynamic stabilizers": "bicepsbrachii, tricepsbrachii",
"synergists": "levatorscapulae, brachioradialis, pectoralissternal, brachialis, deltoidposterior, trapeziusmiddle, teresmajor, trapeziuslower, pectoralisminor, rhomboids",
"target": "latissimusdorsi"},"BackASRearPullupBand":{"id": "4",
"exerciseid": "ASRearPullupBand",
"musclegroup": "Back",
"equipment": "band-assisted",
"exercisetype": "WeightExercises",
"muscleclass": "LatissimusDorsi",
"name": "Band-assisted Rear Pull-up",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Grasp middle ofhanging exercise band and pull down to side of leg. Lift foot and hook band under heel. Stretch band down further by extending leg straight down. Face perpendicular under pullup bar and position band behind body. Pull band apart and place other foot onto band so both feet are together inside of band. Reach up and grasp pullup bar with overhand wide grip while keepinglegs straight.",
"execution": "Pull body up until bar touches back of neck. Lower body until arms and shoulders are fully extended. Repeat.",
"comments": "Range of motion will be compromised if grip is too wide. At conclusion of set, stepone foot out of band at bottom of exercises. Grasping each side of exercise band from behind and pull down. Transfer body weight onto free leg, bend knee of banded leg, release band from under foot, and step out. Transfer both sides of taut band to one hand behind body. Turn body to side of hand holding band while permitting band to contract to normal length. Easier To decrease difficulty, use thicker band or perform other assisted version of this exercise. Self AssistedPartner Assisted Harder To increase difficulty, use thinner band or place bent knee onto bottom inside of band. After some time, finally progress to Rear Pullups without assistance.",
"dynamic stabilizers": "tricepsbrachii",
"synergists": "levatorscapulae, brachioradialis, pectoralissternal, bicepsbrachii, brachialis, teresmajor, trapeziuslower, pectoralisminor, rhomboids",
"target": "latissimusdorsi"}}