{"ThighsLVLegExtensionH":{"id": "0",
"exerciseid": "LVLegExtensionH",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Leg Extension (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Sit on apparatus with back against padded back support. Place front of lower legs under padded lever. Position knee articulation at same axis as lever fulcrum. Grasp handles to sides for support.",
"execution": "Move lever forward and upward by extending knees until legs are straight. Return lever to original position by bending knees. Repeat.",
"comments": "Stabilizers may be used during heavy resistances to prevent body rising off of seat.",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle",
"synergists": "None",
"target": "quadriceps"},"ThighsLVAlternatingLegExtensionH":{"id": "1",
"exerciseid": "LVAlternatingLegExtensionH",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Alternating Leg Extension (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Sit on apparatus with back against padded back support. Place front of lower legs under padded lever. Position knee articulation at same axis as lever fulcrum. Grasp handles to sides for support.",
"execution": "Move one lever forward and upward by extending one knee until leg is straight. Lower to original position. Repeat with opposite side. Continue to alternate between sides.",
"comments": "Stabilizers may be used during heavy resistances to prevent body rising off of seat. Also see exercise perfomed on bilateral machine.",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle",
"synergists": "None",
"target": "quadriceps"},"ThighsLV45LegPress":{"id": "2",
"exerciseid": "LV45LegPress",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever 45° Leg Press (plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on machine with back on padded support. Place feet on platform. Extend hips and knees. Release dock lever and grasp handles to sides.",
"execution": "Lower platform by flexing hips and knees until hips are completely flexed. Return by extending knees and hips. Repeat.",
"comments": "Adjust safety brace and back support to accommodate near full range of motion without forcing hips to bend at waist. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot. Placing feet slightly high on platform emphasize Gluteus Maximus. Placing feet slightly lower on platform emphasize Quadriceps.Also see Locking Out Knees on Leg Press.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVSingleLeg45LegPress":{"id": "3",
"exerciseid": "LVSingleLeg45LegPress",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Single Leg 45° Leg Press",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on machine with back on padded support. Place one foot mid height to low on platform. Place outside of resting foot on lower surface with knee positioned out for greater clearance. Push platform up by extending hip and knee. Release dock lever and grasp handles to sides.",
"execution": "Lower platform by bending leg until knee is just short of complete flexion. Return by extending knee and hip. Repeat. Continue with opposite leg.",
"comments": "Lower platform enough to achieve full range of motion without forcing pelvis to bend at waist. On exercised leg, keep pointed same direction as foot . Also, do not allow heel to raise off of platform, pushing with both heel and forefoot. For alternative view, see Lever Single Leg 45 Leg Press performed with opposite leg.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVHackPress":{"id": "4",
"exerciseid": "LVHackPress",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Hack Press (plate loaded)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on seat with back of hips against back pad. Place feet on platform shoulder width or slightly wider. Extend hips and knees. Disengage dock lever if it does not automatically disengage.",
"execution": "Lower seat by flexing hips and knees until either is near complete flexion. Raise seat by extending knees and hips. Repeat.",
"comments": "When finished, engage dock lever, and lower seat to starting position. If insufficient, hip flexibility forces pelvis to pull away from back pad at lower portions of movement, only lower sled just short of spinal articulation. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot. Placing feet slightly high on platform emphasizes Gluteus Maximus. Placing feet slightly lower on platform emphasizes Quadriceps. Also see Sled Hack Press.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVLyingLegPressH":{"id": "5",
"exerciseid": "LVLyingLegPressH",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Lying Leg Press (plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Climb up steps to top of machine. Lie supine on horizontal padded platform with shoulders against pad. Place feet equally spaced on platform. Grip handles above shoulder pads.",
"execution": "Push lever platform away by extending hips and knees until knees are straight. Return lever platform by flexing hips and knees until knees are just short of complete flexion or until hips are completely flexed. Repeat.",
"comments": "Adjust shoulder pads to allow for full range of motion without forcing hips to rise at waist. Keep knees pointed same directions as feet. Push with both heel and forefoot and do not allow heels to raise off of platform. Placing feet slightly high on platform emphasizes Gluteus Maximus. Placing feet slightly lower on platform emphasizes Quadriceps.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVLyingLegPress":{"id": "6",
"exerciseid": "LVLyingLegPress",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Lying Leg Press (custom - plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie supine on padded platform. Place hands on bars above head or to sides. Place feet flat on lever platform with hips and knees bent.",
"execution": "Push lever platform by extending hips and knees until knees are straight. Flex hips and knees to descend until knees are just short of complete flexion. Repeat.",
"comments": "Adjust machine to accommodate near full range of motion without forcing hips to rise at waist. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot. Placing feet slightly high on platform emphasizes Gluteus Maximus. Placing feet slightly lower on platform emphasizes Quadriceps. Unique apparatus is designed and built by Tracey Cheuvront.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVSingleLegLyingLegPress":{"id": "7",
"exerciseid": "LVSingleLegLyingLegPress",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Single Leg Lying Leg Press (custom - plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie supine on padded platform. Place hands on bars above head or to sides. Place one foot on platform and other foot on floor below platform.",
"execution": "Push platform away by extending hip and knee. Return by bending leg until knee or hip is just short of complete flexion. Repeat. Continue with opposite leg.",
"comments": "Adjust machine to accommodate near full range of motion without forcing pelvis to bend at waist. Keep knee pointed same direction as foot. Do not allow heel to raise off of platform, pushing with both heel and forefoot. Unique apparatus is designed and built by Tracey Cheuvront.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVSeatedLegPressH":{"id": "8",
"exerciseid": "LVSeatedLegPressH",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Seated Leg Press (plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on machine with back on padded support. Place feet on platform. Grasp handles to sides.",
"execution": "Push platform(s) away by extending knees and hips until knees are fully extended. Return until hips are completely flexed. Repeat.",
"comments": "Adjust seat and back support to accommodate near full range of motion without forcing hips to bend at waist. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot. Placing feet slightly high on platform emphasizes Gluteus Maximus. Placing feet slightly lower on platform emphasizes Quadriceps.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVAlternatingLegPress":{"id": "9",
"exerciseid": "LVAlternatingLegPress",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Alternating Seated Leg Press (plate loaded)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on machine with back on padded support. Place feet on platform. Grasp handles to sides.",
"execution": "Push one platform away by extending knee and hip. Return to original position. Repeat with opposite leg. Continue by alternating between sides.",
"comments": "Adjust seat and back support to accommodate near full range of motion without forcing hips to bend at waist. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot. This exercise may be performed by alternating (as described), simultaneous, or in simultaneousalternating fashion.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVSingleLegPressH":{"id": "10",
"exerciseid": "LVSingleLegPressH",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Single Leg Seated Leg Press (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on machine with back on padded support. Place one foot slightly low on platform and other foot near floor below platform or off to side.",
"execution": "Push platform away by extending hip and knee. Return by bending leg until knee or hip is just short of complete flexion. Repeat. Continue with opposite leg.",
"comments": "Adjust back support back to accommodate near full range of motion without forcing pelvis to bend at waist. Keep knee pointed same direction as foot. Push with both heel and forefoot and do not allow heel to raise off of platform.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVSingleLegStandingLegPress":{"id": "11",
"exerciseid": "LVSingleLegStandingLegPress",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Single Leg Standing Leg Press (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Step on left platform with left foot. Grasp handle bars to each side. Place right foot on highest lever platform.",
"execution": "Push platform down by extending hip and knee until straight. Return leg to original position. Repeat. Continue with opposite leg positions.",
"comments": "With greater resistances, more effort is required to pull on handle bars to keep body from rising upward.",
"antagonist stabilizers": "hamstrings, rectusabdominis",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, obliques",
"synergists": "gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVRearLunge":{"id": "12",
"exerciseid": "LVRearLunge",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Rear Lunge (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between lever handles to sides. Squat down with feet flat on floor and grasp lower handles to sides. Lift lever by extending hips and knees to full extension.",
"execution": "Step back with one leg while bending supporting leg. Plant forefoot far back on floor. Lower body by flexing knee and hip of supporting leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward supporting leg and return rear leg next to supporting leg. Repeat movement with opposite legs alternating between sides.",
"comments": "Keep torso upright during lunge flexible hip flexors are important. Forward knee should point same direction as foot throughout lunge. With forward foot further forward Gluteus Maximus is emphasized, Quadriceps are less emphasized. Also see Lever Rear Lunge on apparatus without platform.",
"stabilizers": "trapeziusupper, levatorscapulae, gluteusmedius, gluteusminimus, quadratuslumborum, erectorspinae, trapeziuslower, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVBBRearLunge":{"id": "13",
"exerciseid": "LVBBRearLunge",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Barbell Rear Lunge (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "With bar upper chest height, position bar on back of shoulders and grasp bar to sides. Place feet under bar. Straighten legs so weight is lifted. Disengage bar by rotating bar back.",
"execution": "Step back with one leg while bending supporting leg. Plant forefoot far back on floor. Lower body by flexing knee and hip of supporting leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward supporting leg and return rear leg next to supporting leg. Repeat movement with opposite legs alternating between sides.",
"comments": "Keep torso upright during lunge flexible hip flexors are important. Forward knee should point same direction as foot throughout lunge. A long lunge with feet slightly forward emphasizes Gluteus Maximus short lunge with feet under the bar emphasizes Quadriceps.",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVSingleLegSplitSquat":{"id": "14",
"exerciseid": "LVSingleLegSplitSquat",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Single Leg Split Squat (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between lever handles to sides. Extend leg back and place top of foot on cross bar. Squat down and grasp handles to sides.",
"execution": "With chest high, lift lever by extending hips and knees to full extension. Return until knee of rear leg is almost in contact with floor. Repeat. Continue with opposite leg.",
"comments": "Keep torso upright during squat flexible hip flexors are important. Keep foot flat on floor. Forward knee should point same direction as foot throughout movement. Position foot just slightly forward to keep equal distribution of force on hip and knee extensors. May also be referred to as Lever Bulgarian Squat.",
"stabilizers": "trapeziusupper, gluteusminimus, erectorspinae, levatorscapulae, trapeziuslower, gluteusmedius",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVBBSingleLegSplitSquat":{"id": "15",
"exerciseid": "LVBBSingleLegSplitSquat",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Barbell Single Leg Split Squat (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Place bench behind smith bar. With bar upper chest height, position bar on back of shoulders and grasp bar to sides. Place foot slightly forward under bar. Extend other leg back and place top of foot on bench. Disengage bar by rotating bar back.",
"execution": "Lower body on leg by flexing knee and hip of front leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward leg. Repeat. Continue with opposite leg.",
"comments": "Keep torso upright during squat flexible hip flexors are important. Position foot very slightly forward to keep equal distribution of force on hip and knee extensors. Keep foot flat on floor. Forward knee should point same direction as foot throughout movement. May also be referred to as Lever Barbell Bulgarian Squat.",
"stabilizers": "gluteusmedius, gluteusminimus, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVSingleLegSquat":{"id": "16",
"exerciseid": "LVSingleLegSquat",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Single Leg Squat (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between handles facing away from fulcrum. Grasp both handles to sides and stand upright. Cross lower leg above knee of supporting leg.",
"execution": "Bend knees forward slightly while allowing hips to bend back behind, keeping back straight and knees pointed same direction as feet. Squat down as low as possible. Extend knee and hip until leg is straight. Return and repeat. Continue with opposite leg.",
"comments": "Range of motion will be improved with greater leg strength and glute flexibility. Supporting knee should point same direction as foot throughout movement.",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVSplitSquat":{"id": "17",
"exerciseid": "LVSplitSquat",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Split Squat (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between lever handles to sides. Place forefoot of one foot on floor to rear and other foot slightly forward. Squat down and grasp handles to sides.",
"execution": "With chest high, lift lever by extending hips and knees to full extension. Return until knee of rear leg is almost in contact with floor. Repeat. Continue with opposite leg.",
"comments": "Keep torso upright during squat flexible hip flexors are important. Keep foot flat on floor. Knees should point same direction as feet throughout movement. Position foot just slightly forward to keep equal distribution of force on hip and knee extensors. With forward foot further forward Gluteus Maximus is emphasized, Quadriceps are less emphasized. Also known as Lever Lunge.",
"stabilizers": "trapeziusupper, gluteusminimus, erectorspinae, levatorscapulae, trapeziuslower, gluteusmedius",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVBBSplitSquat":{"id": "18",
"exerciseid": "LVBBSplitSquat",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Barbell Split Squat (plate loaded)",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "With bar upper chest height, position bar on back of shoulders and grasp bar to sides. Place one foot slightly forward and forefoot of other leg further back. Disengage bar by rotating bar back.",
"execution": "Lower body on other leg by flexing knees and hips of both legs until knee of rear leg is almost in contact with floor. Return to original straddled position by extending hips and knees of both legs. Repeat. Continue with opposite leg.",
"comments": "Keep torso upright during movement flexible hip flexors are important. Knees should point same direction as feet throughout movement. The forward foot further forward will emphasize Gluteus Maximus forward foot closer under bar will emphasize Quadriceps.",
"stabilizers": "erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVSquatPL":{"id": "19",
"exerciseid": "LVSquatPL",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Squat (plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Squat down to place shoulders under padded lever. Place feet shoulder width apart directly under shoulders. Extend knees and hips until legs are straight. Release support lever.",
"execution": "Lower lever by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Lift lever up by extending knees and hips until legs are straight. Repeat.",
"comments": "If available, reengage support lever in extended position before dismounting. Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See rear view and Squat Analysis. Also see exercise on alternative machine.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVSquatPL3":{"id": "20",
"exerciseid": "LVSquatPL3",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Squat (plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Squat down to place shoulders under padded lever. Place feet shoulder width apart directly under shoulders. Extend knees and hips until legs are straight. Release support lever.",
"execution": "Lower lever by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Lift lever up by extending knees and hips until legs are straight. Repeat.",
"comments": "If available, reengage support lever in extended position before dismounting. Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis.Also see exercise performed onclassic Lever Squat machine.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVBBSquat":{"id": "21",
"exerciseid": "LVBBSquat",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Barbell Squat (plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "With bar upper chest height, position bar on back of shoulders and grasp bar to sides. Place feet under bar. Disengage bar by rotating bar back.",
"execution": "Squat down by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Extend knees and hips until legs are straight. Return and repeat.",
"comments": "Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVFrontSquatPL":{"id": "22",
"exerciseid": "LVFrontSquatPL",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Front Squat (plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Step onto platform facing padded levers. Squat down to place shoulders under padded lever. Place feet shoulder width apart on platform. Extend knees and hips until legs are straight. Release support lever if it does not disengage by itself.",
"execution": "Lower lever by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Lift lever up by extending knees and hips until legs are straight. Repeat.",
"comments": "Reengage support lever before dismounting. Model shown uses foot pedal near base of platform to reengage support lever. Keep head facing forward, back straight and feet flat on platform equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVFullSquatPL":{"id": "23",
"exerciseid": "LVFullSquatPL",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Full Squat (plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Squat down to place shoulders under padded lever. Place feet shoulder width apart directly under shoulders. Extend knees and hips until legs are straight. Release support lever.",
"execution": "Squat down by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until knees and hips are fully bent. Lift lever up by extending knees and hips until legs are straight. Repeat.",
"comments": "If available, reengage support lever in extended position before dismounting. Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVHackSquatPL":{"id": "24",
"exerciseid": "LVHackSquatPL",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever Hack Squat (plate loaded)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie supine on back pad with shoulders under shoulder pad. Place feet on platform. Extend hips and knees and release lever.",
"execution": "Lower lever by flexing hips and knees until knees are just short of complete flexion. Raise sled by extending knees and hips. Repeat.",
"comments": "If available, reengage support lever in extended position before dismounting. If insufficient, hip flexibility forces pelvis to pull away from back pad at lower portions of movement, only lower sled just short of spinal articulation. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot. Placing feet slightly high on platform emphasizes Gluteus Maximus. Placing feet slightly lower on platform emphasizes Quadriceps. Also see similar exercise Lever VSquat.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"},"ThighsLVVSquatH":{"id": "25",
"exerciseid": "LVVSquatH",
"musclegroup": "Thighs",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "Quadriceps",
"name": "Lever V-Squat (plate loaded)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Position shoulders under shoulder pads with back against back pad. Place feet on platform, shoulder width apart. Extend hips and knees and release lever.",
"execution": "Lower lever by flexing hips and knees until knees are just short of complete flexion. Raise sled by extending knees and hips. Repeat.",
"comments": "If available, reengage support lever in extended position before dismounting. If insufficient, hip flexibility forces pelvis to pull away from back pad at lower portions of movement, only lower sled just short of spinal articulation. Keep knees pointed same directions as feet. Do not allow heels to raise off of platform, pushing with both heel and forefoot. Placing feet slightly forward on platform emphasizes Gluteus Maximus. Placing feet slightly back on platform emphasizes Quadriceps.",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gluteusmaximus, adductors",
"target": "quadriceps"}}