{"HipsBBBentKneeGoodMorning":{"id": "0",
"exerciseid": "BBBentKneeGoodMorning",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Bent Knee Good-morning",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Position barbell on back of shoulders and grasp bar to sides.",
"execution": "Keeping back straight, bend hips to lower torso forward until parallel to floor. Bend knees slightly during descent. Raise torso until hips are extended. Repeat.",
"comments": "Begin with very light weight and add additional weight gradually to allow adequate adaptation. Throughout lift, keep back straight. Knees will have to bend more with those with less hamstring flexibility. Knees can be kept bent throughout movement. Also see straight leg Goodmorning emphasizing Hamstrings.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "quadriceps, erectorspinae",
"synergists": "hamstrings, adductors",
"target": "gluteusmaximus"},"HipsBBSeatedGoodMorning":{"id": "1",
"exerciseid": "BBSeatedGoodMorning",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Seated Good-morning",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Position barbell on back of shoulders and grasp bar to sides. Sit on end of bench or corner of box secured to floor. Position feet apart on floor with knees slightly bent.",
"execution": "Keeping back straight, bend torso forward as low as possible by bending hips. Raise torso until torso is upright. Repeat.",
"comments": "Begin with very light weight and add additional weight gradually to allow adequate adaptation. Throughout lift, keep back straight. Hamstrings will be emphasized if knees are straight.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"synergists": "hamstrings, adductors",
"target": "gluteusmaximus"},"HipsBBDeadlift":{"id": "2",
"exerciseid": "BBDeadlift",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Deadlift",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "With feet flat beneath bar squat down and grasp bar with shoulder width or slightly wider overhand or mixed grip.",
"execution": "Lift bar by extending hips and knees to full extension. Pull shoulders back at top of lift if rounded. Return weights to floor by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Repeat.",
"comments": "Throughout lift, keep hips low, shoulders high, arms and back straight. Knees should point same direction as feet throughout movement. Keep bar close to body to improve mechanical leverage. Grip strength and strength endurance often limit ability to perform multiple reps at heavy resistances. Gym chalk, wrist straps, grip work, and mixed grip can be used to enhance grip. Mixed grip indicates one hand holding with overhand grip and other hand holding with underhand grip. Lever barbell jack can be used to lift barbell from floor for easier loading and unload of weight plates. In powerlifting, do not squat down too deep and keep shoulder joint slightly behind bar for optimal leverage and mechanics (think teeter toter). Upper body will move back as weight is pulled upward. On rep training, do not merely tap weight to ground, but instead let barbell settle to ground each rep to sufficiently train range of motion through initial slack of heavy barbell. Heavy barbell deadlifts significantly engages Latissmus Dorsi. See Deadlift under Erector Spinae. Also see Deadlift Analysis and Deadlift Strength Standards.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, trapeziusmiddle, erectorspinae, levatorscapulae, rhomboids",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "hamstrings, soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBBBlockPull":{"id": "3",
"exerciseid": "BBBlockPull",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Block Pull",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "With barbell on blocks, position feet shoulder width or slightly narrower beneath bar. Squat down and grasp bar with shoulder width or slightly wider overhand or mixed grip.",
"execution": "Lift bar by extending hips and knees to full extension. Pull shoulders back at top of lift if rounded. Return and repeat.",
"comments": "Throughout lift, keep hips low, shoulders high, arms and back straight. Knees should point same direction as feet throughout movement. Keep bar close to body to improve mechanical leverage. Grip strength and strength endurance often limit ability to perform multiple reps at heavy resistances. Gym chalk, wrist straps, grip work, and mixed grip can be used to enhance grip. Mixed grip indicates one hand holding with overhand grip and other hand holding with underhand grip. Barbell Block Pull emphasizes mid portion of Deadlift and allows more weight to be used while sparing leg involvement. 2 (5 cm), 4 (10 cm), 6 (15 cm), or higher can be used. Heavy barbell deadlifts significantly engages Latissmus Dorsi. Movement can be used interchangeably with Barbell Rack Pull. See Barbell Block Pull under Erector Spinae. Also see Deadlift Analysis and Deadlift Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, trapeziusmiddle, erectorspinae, levatorscapulae, rhomboids",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "hamstrings, soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBBDeficitDeadlift":{"id": "4",
"exerciseid": "BBDeficitDeadlift",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Deficit Deadlift",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand on weight plate or shallow elevated platform with loaded bar above feet. Squat down and grasp bar with shoulder width or slightly wider overhand or mixed grip.",
"execution": "Lift bar by extending hips and knees to full extension. Pull shoulders back at top of lift if rounded. Return weights to floor by bending hips back, while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Repeat.",
"comments": "Throughout lift, keep hips low, shoulders high, arms and back straight. Knees should point same direction as feet throughout movement. Keep bar close to body to improve mechanical leverage. Grip strength and strength endurance often limit ability to perform multiple reps at heavy resistances. Gym chalk, wrist straps, grip work, and mixed grip can be used to enhance grip. Mixed grip indicates one hand holding with overhand grip and other hand holding with underhand grip. Lever barbell jack can be used to lift barbell from floor for easier loading and unloading of weight plates. Barbell Deficit Deadlift emphasizes building strength through lowest portion of Deadlift. Target muscle is exercised isometrically. Heavy barbell deadlifts significantly engages Latissmus Dorsi. See Barbell Deficit Deadlift under Erector Spinae. Also see Deadlift Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, trapeziusmiddle, erectorspinae, levatorscapulae, rhomboids",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "hamstrings, soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBBRackPull":{"id": "5",
"exerciseid": "BBRackPull",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Rack Pull",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "In power rack, with barbell on safety bar in low position, place feet shoulder width or slightly narrower beneath bar. Squat down and grasp bar with shoulder width or slightly wider overhand or mixed grip.",
"execution": "Lift bar by extending hips and knees to full extension. Pull shoulders back at top of lift if rounded. Return and repeat.",
"comments": "Throughout lift, keep hips low, shoulders high, arms and back straight. Knees should point same direction as feet throughout movement. Keep bar close to body to improve mechanical leverage. Grip strength and strength endurance often limit ability to perform multiple reps at heavy resistances. Gym chalk, wrist straps, grip work, and mixed grip can be used to enhance grip. Mixed grip indicates one hand holding with overhand grip and other hand holding with underhand grip. Barbell Rack Pull emphasizes mid portion of Deadlift and allows more weight to be used while sparing leg involvement. Measuring bottom of plates from ground 2 (5 cm), 4 (10 cm), 6 (15 cm), or higher can be used. Heavy barbell deadlifts significantly engages Latissmus Dorsi. Movement can be used interchangeably with Barbell Block Pull. See Barbell Rack Pull under Erector Spinae. Also see Deadlift Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, trapeziusmiddle, erectorspinae, levatorscapulae, rhomboids",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "hamstrings, soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBBSumoDeadlift":{"id": "6",
"exerciseid": "BBSumoDeadlift",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Sumo Deadlift",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Position feet under bar with very wide stance. Squat down and grasp bar between legs with shoulder width mixed grip. Face forward while positioning shoulders upward with arms straight, chest high, hips low, and back straight.",
"execution": "Pull bar up by driving feet outward, while pulling chest up. Extend knees when bar passes knees. At top of lift, when torso is upright, drive shoulders back and chest up. Return weight to floor by bending hips back and knees pointed outward, while keeping chest high and back straight. Repeat.",
"comments": "Use shoulder width grip since narrower than shoulder width grip will make it more difficult to lockout at top. Throughout lift, keep hips low, shoulders high, arms and back straight, and knees pointed out same direction as feet. Also, keep bar close to body to improve mechanical leverage. With wide stance, push feet out to sides and not down to prevent knees from buckling inward. Pushing knees out will allow hips to travel toward bar more quickly while improving leverage. During rep training for powerlifting, do not merely tap weight to ground, but instead let barbell settle to ground each rep to sufficiently train range of motion through initial slack of heavy barbell. Heavy barbell deadlifts significantly engages Latissmus Dorsi. See similar exercises Deadlift and Kettlebell Sumo Deadlift. Also see Sumo Deadlift vs Conventional Deadlift and Deadlift Strength Standards.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, trapeziusmiddle, erectorspinae, levatorscapulae, rhomboids",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBBSumoBlockPull":{"id": "7",
"exerciseid": "BBSumoBlockPull",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Sumo Block Pull",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "With barbell on blocks, position feet under bar with very wide stance. Squat down and grasp bar between legs with shoulder width mixed grip. Face forward while positioning shoulders upward with arms straight, chest high, hips low, and back straight.",
"execution": "Pull bar up by driving feet outward while pulling chest up. Extend knees when bar passes knees. At top of lift, when torso is upright, drive shoulders back and chest up. Return weight to blocks by bending hips back and knees pointed outward, while keeping chest high and back straight. Repeat.",
"comments": "Use shoulder width grip, since narrower than shoulder width grip will make it more difficult to lockout at top. Throughout lift, keep hips low, shoulders high, arms and back straight, and knees pointed out same direction as feet. Also, keep bar close to body to improve mechanical leverage. With wide stance, push feet out to sides and not down to prevent knees from buckling inward. Pushing knees out will allow hips to travel toward bar more quickly while improving lev erage. Barbell Sumo Block Pull emphasizes mid portion of Sumo Deadlift and allows more weight to be used while sparing leg involvement. 2 (5 cm), 4 (10 cm), 6 (15 cm), or higher can be used. Heavy barbell deadlifts significantly engages Latissmus Dorsi. See Barbell Sumo Block Pull under Erector Spinae. Also see Sumo Deadlift vs Conventional Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, trapeziusmiddle, erectorspinae, levatorscapulae, rhomboids",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBBStiffLegDeadlift":{"id": "8",
"exerciseid": "BBStiffLegDeadlift",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Stiff Leg Deadlift",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand with shoulder width or narrower stance on 5 to 8 (1320 cm) platform with feet flat beneath bar. Bend over and grasp barbell with shoulder width or slightly wider overhand or mixed grip.",
"execution": "With knees bent, lift bar by extending at hips until standing upright. Pull shoulders back at top of lift if rounded. Extend knees at top if desired. Lower bar to top of feet by bending hips. Bend knees slightly during descent and keep waist straight, flexing only slightly at bottom. Repeat.",
"comments": "Throughout lift keep arms and back straight. Lower back may bend slightly during full hip flexion. Quadriceps can be kept bent throughout movement. See Dangerous Exercise Essay. Also see Straight Back Stiff Leg Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, trapeziusmiddle, levatorscapulae, trapeziuslower, rhomboids, quadriceps",
"synergists": "hamstrings, adductors, erectorspinae",
"target": "gluteusmaximus"},"HipsBBSingleLegStiffLegDeadlift":{"id": "9",
"exerciseid": "BBSingleLegStiffLegDeadlift",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Single Leg Stiff-leg Deadlift",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Hold barbell down in front, arms straight with shoulder width or slightly wider overhand grip. Stand with feet together. Lift leg slightly so foot is just off floor.",
"execution": "Lower bar to floor while raising lifted leg back behind. Keep back straight and knee of supporting leg slightly bent. Keep hip and knee of lifted leg extended throughout movement. Once stretch is felt or barbell contacts floor, return to original position by raising torso while lowering lifted leg. Straighten knee of supporting leg as torso becomes upright. Repeat.",
"comments": "Throughout lift, keep arms and back straight. Do not lower weight beyond mild stretch throughout hamstrings. Full range of motion will vary from person to person. Those with less flexibility may need to bend knee of supporting leg more so barbell can contact floor. At top of movement, lifted foot can make contact with floor to maintain balance between repetitions.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, obliques, levatorscapulae, gluteusmedius, trapeziusmiddle, gluteusminimus, quadratuslumborum, erectorspinae, gluteusmaximus, trapeziuslower, rhomboids, quadriceps",
"synergists": "hamstrings, adductors",
"target": "gluteusmaximus"},"HipsBBStrBackStiffLegDeadlift":{"id": "10",
"exerciseid": "BBStrBackStiffLegDeadlift",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Straight-back Stiff-leg Deadlift",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp barbell from rack or deadlift from floor with shoulder width or slightly wider overhand or mixed grip. Stand with shoulder width or narrower stance.",
"execution": "With back straight, lower bar to top of feet by bending hips. Bend knees slightly during descent and keep waist straight. Place weight onto floor. With knees still bent, lift bar by straightening hips until standing upright. Pull shoulders back if rounded. Extend knees at top if desired. Repeat.",
"comments": "Throughout lift, keep arms and back straight. Do not lower weight beyond mild stretch throughout hamstrings. Full range of motion will vary from person to person. Stand on shallow platform if weight reaches floor before stretch. Those with less flexibility may have to bend knees more. Knees can be kept bent throughout movement. Also see Stiff Leg Deadlift and Romanian Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, levatorscapulae, trapeziusmiddle, erectorspinae, trapeziuslower, rhomboids, quadriceps",
"synergists": "hamstrings, adductors",
"target": "gluteusmaximus"},"HipsBBHipThrust":{"id": "11",
"exerciseid": "BBHipThrust",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Hip Thrust",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Sit on floor with long side of bench behind back. Roll barbell back and center over hips. Position upper back on corner of bench. Place feet on floor approximately shoulder width with knees bent. Grasp bar to each side.",
"execution": "Raise bar upward by extending hips until straight. Lower and repeat.",
"comments": "Use bench of lower height 16 to 18 (40 to 46 cm) allowing torso to be angled approximately 45. Bench may need to be secured so it does not slide on floor. Bar must be high enough to allow clearance over hips. If 45lb (22kg) plates are too heavy, lighter Olympicstyle bumper plates can be used. Bar should be positioned across upper hip flexors and lower abdomen.. Thick bar padding or balance foam pad may need to be used if pelvis and hip flexor muscles do not over enough natural padding. Find comfortable contact hinge position on bench and avoid sliding. Keep bar from rolling back near top of movement with hands on bar. Movement should occur through hip with torso rigid. Avoid chest arching upward and anterior pelvic tilt, both producing spinal hyperextension.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"dynamic stabilizers": "hamstrings",
"synergists": "quadriceps",
"target": "gluteusmaximus"},"HipsBBLunge":{"id": "12",
"exerciseid": "BBLunge",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Lunge",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Clean bar from floor or dismount bar from rack. From rack with barbell upper chest height, position bar on back of shoulders and grasp barbell to sides.",
"execution": "Lunge forward with first leg. Land on heel, then forefoot. Lower body by flexing knee and hip of front leg until knee of rear leg is almost in contact with floor. Return to original standing position by forcibly extending hip and knee of forward leg. Repeat by alternating lunge with opposite leg.",
"comments": "Keep torso upright during lunge flexible hip flexors are important. Lead knee should point same direction as foot throughout lunge. A long lunge emphasizes Gluteus Maximus short lunge emphasizes Quadriceps.",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, tibialisanterior, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBBRearLunge":{"id": "13",
"exerciseid": "BBRearLunge",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Rear Lunge",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "From rack with barbell upper chest height, position bar on back of shoulders and grasp barbell to sides. Dismount bar from rack.",
"execution": "Step back with one leg while bending supporting leg. Plant forefoot far back on floor. Lower body by flexing knee and hip of supporting leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward supporting leg and return rear leg next to supporting leg. Repeat movement with opposite legs alternating between sides.",
"comments": "Keep torso upright during lunge flexible hip flexors are important. Forward knee should point same direction as foot throughout lunge. A long lunge emphasizes Gluteus Maximus short lunge emphasizes Quadriceps.",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBBSideLunge":{"id": "14",
"exerciseid": "BBSideLunge",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Side Lunge",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Clean bar from floor or dismount bar from rack. From rack with barbell upper chest height, position bar on back of shoulders and grasp barbell to sides.",
"execution": "Lunge to one side with first leg. Land on heel, then on forefoot. Lower body by flexing knee and hip of lead leg, keeping knee pointed same direction of foot. Return to original standing position by forcibly extending hip and knee of lead leg. Repeat by alternating lunge with opposite leg.",
"comments": "Keep torso upright during lunge. Flexible hip adductors will allow fuller range of motion. Lead knee should point same direction as foot throughout lunge. A long lunge emphasizes Gluteus Maximus short lunge emphasizes Quadriceps.",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, tibialisanterior, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBBWalkingLunge":{"id": "15",
"exerciseid": "BBWalkingLunge",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Walking Lunge",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Position barbell on back of shoulders and grasp bar to sides.",
"execution": "Step forward with first leg. Land on heel, then forefoot. Lower body by flexing knee and hip of front leg until knee of rear leg is almost in contact with floor. Stand on forward leg with assistance of rear leg. Lunge forward with opposite leg. Repeat by alternating lunge with opposite legs.",
"comments": "Keep torso upright during lunge flexible hip flexors are important. Lead knee should point same direction as foot throughout lunge. A long lunge emphasizes Gluteus Maximus short lunge emphasizes Quadriceps. Tibialis Anterior is exercised eccentrically during landing on heel.",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, tibialisanterior, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBBSingleLegSplitSquat":{"id": "16",
"exerciseid": "BBSingleLegSplitSquat",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Single Leg Split Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand facing away from bench. Position bar on back of shoulders and grasp barbell to sides. Extend leg back and place top of foot on bench.",
"execution": "Squat down by flexing knee and hip of front leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward leg. Repeat. Continue with opposite leg.",
"comments": "Keep torso upright during squat flexible hip flexors are important. Forward knee should point same direction as foot throughout movement. Also known as Bulgarian Squat.",
"stabilizers": "gluteusmedius, gluteusminimus, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBBSideSplitSquat":{"id": "17",
"exerciseid": "BBSideSplitSquat",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Side Split Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"execution": "Lower body toward side of angled foot by bending knee and hip of lead leg while keeping opposite leg only slightly bent. Return to original standing position by extending hip and knee of lead leg. Repeat.",
"comments": "Keep torso upright and knee of lead leg pointed same direction of foot. Flexible hip adductors and stronger legs will allow fuller range of motion. A wider stance emphasizes Gluteus Maximus slightly narrower straddled stance emphasizes Quadriceps. Do not position feet too close nor too wide.",
"stabilizers": "gluteusmedius, gluteusminimus, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBBSingleLegSquat":{"id": "18",
"exerciseid": "BBSingleLegSquat",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Single Leg Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand with arms extended out in front holding barbell. Balance on one leg with opposite leg extended straight leg forward as high as possible.",
"execution": "Squat down as far as possible while keeping leg elevated off of floor. Keepsupporting knee pointed same direction as foot supporting. Raise body back up to original position until knee and hip of supporting leg is straight. Return and repeat. Continue with opposite leg.",
"comments": "Supporting knee should point same direction as foot throughout movement. Range of motion will be improved with greater leg strength and glute flexibility. Significant spinal flexion occurs at bottom of deep single leg squat to maintain center of gravity over foot. Erector Spinae becomes a stabilizer if spine is kept straight. An easier alternative style is to place barbell on back of shoulders, cross lower leg above knee of supporting leg or wrap one foot around back of supporting leg.",
"stabilizers": "trapeziusupper, levatorscapulae, deltoidanterior, sartorius, trapeziusmiddle, gluteusminimus, deltoidlateral, trapeziuslower, rectusabdominis, pectoralisclavicular, gluteusmedius, tensorfasciaelatae, serratusanterior, wristextensors, iliopsoas, quadratuslumborum, obliques, pectineus, quadriceps",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, erectorspinae, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBBSplitSquat":{"id": "19",
"exerciseid": "BBSplitSquat",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Split Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Position barbell on back of shoulders and grasp barbell to sides. Stand with feet far apart one foot forward and other foot behind.",
"execution": "Squat down by flexing knee and hip of front leg. Allow heel of rear foot to rise up while knee of rear leg bends slightly until it almost makes contact with floor. Return to original standing position by extending hip and knee of forward leg. Repeat. Continue with opposite leg.",
"comments": "Knees should point same direction as feet throughout movement. Heel of rear foot can be kept elevated off floor throughout movement. Keep torso upright during squat flexible hip flexors are important. With feet further apart Gluteus Maximus is emphasized, Quadriceps are less emphasized.",
"stabilizers": "gluteusmedius, gluteusminimus, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBBSquat":{"id": "20",
"exerciseid": "BBSquat",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Squat (low bar)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "From rack with barbell at upper chest height, position bar low on back of shoulders. Grasp barbell to sides. Dismount bar from rack and stand with wide stance.",
"execution": "Squat down by bending hips back while allowing knees to bend forward slightly, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Extend hips and knees until legs are straight. Return and repeat.",
"comments": "Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. At bottom of squat, crease at hips must be lower than top of knee cap. Also see Squat for targeting QuadricepsSquat AnalysisSquat Strength Standards Grip variations Narrow gripWide grip Spotting Technique PositioningAssistance",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBBBoxSquat":{"id": "21",
"exerciseid": "BBBoxSquat",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Box Squat",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "From rack with barbell at upper chest height, position bar on back of shoulders. Grasp barbell to sides. Dismount bar from rack and back up until contact is made with box immediately behind. Stand with wide stance with feet flared out slightly.",
"execution": "Sit back onto box by bending hips back while bending knees, keeping shins nearly perpendicular or knees slightly behind ankles. Lower rear end back onto box in controlled manner. Rock torso back slightly. Once torso rocks forward, immediately stand back up rapidly by driving hips upward, keeping knees above ankles and chest high until legs are straight. Return and repeat.",
"comments": "Try to keep knees from traveling forward while reaching rear end back onto squat box. Ideally, knees could be behind ankles. In this position, greater stretch reflex can be created through hips (via hamstrings) once torso rocks forward just before squat. However, other hip extensors can engage in stretchshortening cycle (although to lesser extend in this position) in lieu of hamstrings optimized involvement. Box Squat is said to build explosive strength by breaking eccentricconcentric chain as experienced in Barbell Squat. However, stretchshortening cycle still occurs through altered exercise mechanics as explained above. Adjustable safety bars on power rack should be portioned slightly below lowest position of barbell in case of fail. Boxs height could allow pivot point of hips to travel slightly lower than pivot point of knee, however, programmed partials can be performed on higher box. Rubber mats can be stacked on top of box to adjust to intended height. Box can be orientated diagonally so corners can be straddled, so box is more directly under hips in standing position. Do not fall on to or bounce off of box. Keep head facing forward, back straight and feet flat on floor. Keep knees apart so thighs point same direction as feet throughout movement. Inv olvement of Quadriceps and Soleus are limited since shin is kept nearly vertical. During 1960s, Box squats (then called Rocking Box Squats) were first popularized by Olympic hammer thrower and power lifter George Frenn (Boyle 2010). Box Squats were later popularized by Louie Simmons. Dozens of variations are used by powerlifters and athletes using Louie Simons Westside Barbell Program.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBBFrontSquat":{"id": "22",
"exerciseid": "BBFrontSquat",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Front Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "From rack with barbell upper chest height, position bar in front of shoulders. Cross arms and place hands on top of barbell with upper arms parallel to floor. Dismount bar from rack.",
"execution": "Squat down by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel. Extend knees and hips until legs are straight. Return and repeat.",
"comments": "Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis. Also see weightlifting style Front Squat.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, erectorspinae, pectoralisclavicular, levatorscapulae, serratusanterior, supraspinatus, trapeziusmiddle, deltoidlateral, deltoidanterior, trapeziuslower",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBBFullSquat":{"id": "23",
"exerciseid": "BBFullSquat",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Full Squat",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "From rack with barbell upper chest height, position barbell on back of shoulders and grasp bar to sides. Dismount bar from rack.",
"execution": "Squat down by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until knees and hips are fully bent. Extend knees and hips until legs are straight. Return and repeat.",
"comments": "Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. Hip and ankle flexibility is important for both execution and safety in this movement. See Full Squat Flexibility. Certain knee and low back problems may be aggravated by this exercise. See Full Squat Analysis and Deep Squat Test. See spotting technique and spotting assistance.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBBHackSquat":{"id": "24",
"exerciseid": "BBHackSquat",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Hack Squat",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Position barbell just behind legs. With feet flat on floor, squat down and grasp barbell from behind with overhand grip.",
"execution": "Lift bar by extending hips and knees to full extension. Squat down by bending knees forward while allowing hips to bend back behind, keeping back straight and knees pointed same direction as feet. Descend until thighs are close to parallel to floor and bar is behind lower leg. Repeat.",
"comments": "Throughout lift, keep hips low, shoulders high, arms and back straight. Knees should point same direction as feet throughout movement. See flawed demonstration showing depth of hack squat that is NOT sufficient and knees are NOT pointed same angle as feet. Individuals with short arm to torso ratio or protracted shoulder posture, may find this exercise very difficult to perform. See Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSBSquat":{"id": "25",
"exerciseid": "SBSquat",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Safety Barbell Squat",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Standing facing safety barbell on rack upper chest height. Position head in yoke with padded bar around shoulders. Hands can be placed on ends of yoke (as shown) or on safety bar out to sides. Dismount bar from rack and step back.",
"execution": "Squat down by bending hips back while allowing knees to bend slightly forward, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Stand by extending hips and knees until legs are straight. Repeat.",
"comments": "Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. Exercise can also be performed holding onto supports or with long handled safety bar. Also see Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSBSquatHandles":{"id": "26",
"exerciseid": "SBSquatHandles",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Safety Barbell Squat (long handles)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Standing facing safety barbell on rack upper chest height. Position head in yoke with padded bar around shoulders. Grasp ends of handles. Dismount bar from rack and step back.",
"execution": "Squat down by bending hips back while allowing knees to bend slightly forward, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Stand with or without assistance of arms, extending knees and hips until legs are straight. Repeat.",
"comments": "Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. Exercise can also be performed holding onto supports or with safety bar without bar handles. Also see Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsSBSquatSelfSpot":{"id": "27",
"exerciseid": "SBSquatSelfSpot",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Safety Barbell Squat (self-spotting)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand facing safety barbell on rack upper chest height. Place hands vertical rack supports. Position head in yoke with padded bar around shoulders. Dismount bar from rack and step back so body is upright at arms length from supports.",
"execution": "Squat down by bending hips back while allowing knees to bend forward slightly, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Stand with or without assistance of arms, extending hips and knees until legs are straight. Repeat.",
"comments": "Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. If handles are not available, horizontal bars on rack can be used for assistance if needed. Exercise can also be performed without holding onto supports. Also see Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusmiddle, tricepsbrachii, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "latissimusdorsi, pectoralisclavicular, tricepsbrachii, levatorscapulae, deltoidposterior, soleus, teresmajor, adductors, rhomboids, quadriceps",
"target": "gluteusmaximus"},"HipsTBSquat":{"id": "28",
"exerciseid": "TBSquat",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Trap Bar Squat",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand on platform under loaded trap bar. Squat down until thighs are just past parallel to floor with knees pointed same direction as feet and feet flat on platform. Grasp handles to sides. Posture chest up with back arched tightly.",
"execution": "Lift weight upward by extending knees and hips until straight. Pull shoulders back at top of lift if rounded. Return weight to floor by bending hips back, while allowing knees to bend forward slightly, keeping back straight and knees pointed same direction as feet. Repeat.",
"comments": "An inverted squared openended trap bar is used in this demonstration. Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis. Also see Trap Bar Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBBSquatChains":{"id": "29",
"exerciseid": "BBSquatChains",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Squat (with chains)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand facing barbell, racked upper chest height, with thick chains hanging to floor on each side. Position bar low on back of shoulders. Grasp barbell to sides and position elbows back. Dismount bar from rack and stand with wide stance.",
"execution": "Squat down by bending hips back while allowing knees to bend forward slightly, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Extend hips and knees until legs are straight. Return and repeat.",
"comments": "Chains provide increasing resistance as barbell moves away from floor. Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See spotting technique and spotting assistance. See Squat for targeting Quadriceps and Squat Analysis. Also see Squat Strength Standards.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBBZercherSquat":{"id": "30",
"exerciseid": "BBZercherSquat",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Zercher Squat",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "From rack with barbell upper waist height position, forearms under bar and in front of bar with elbows shoulder width apart. Cross wrists and pull bar in, close against body. Lift barbell from rack. Step back with wide stance, feet pointing out 2030.",
"execution": "Squat down by bending hips back while allowing knees to bend forward, keeping back straight, hands close to body, and knees pointed same direction as feet. Descend until thighs are near parallel. Extend knees and hips until legs are straight. Return and repeat.",
"comments": "Turning knuckles up places bar more on Brachioradialis rather than more sensitive crook of elbow. Keep head facing forward, back straight and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. Also see rear side view. Zercher Squat was created by Ed Zercher, a strongman from 1930s. This style of squat removes axial loading and instead, places load in front of body, allowing more upright torso position. Louie Simmons commits on the benefits of Zercher Squats It teaches you exactly how to squat. It teaches you to push your knees apart. Push your chest up. Push your buttocks out. The whole nine yards. The Zercher Squat also has carryover to activities of first responders, laborers, and strongman movements (1) Atlas Stone Event, (2) Africa Stone Carry, and (3) Yoke Carry.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, erectorspinae, pectoralisclavicular, levatorscapulae, brachioradialis, serratusanterior, pectoralissternal, bicepsbrachii, brachialis, supraspinatus, trapeziusmiddle, deltoidlateral, deltoidanterior, trapeziuslower",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBBStepUp":{"id": "31",
"exerciseid": "BBStepUp",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Step-up",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand facing side of bench. Position bar on back of shoulders and grasp barbell to sides.",
"execution": "Place foot of first leg on bench. Stand on bench by extending hip and knee of first leg and place foot of second leg on bench. Step down with second leg by flexing hip and knee of first leg. Return to original standing position by placing foot of first leg to floor. Repeat first step with opposite leg alternating first steps between legs.",
"comments": "Keep torso upright during exercise. Forward knee should point same direction as foot throughout movement. Stepping distance from bench emphasizes Gluteus Maximus stepping close to bench emphasizes Quadriceps.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gastrocnemius, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsBBLateralStepUp":{"id": "32",
"exerciseid": "BBLateralStepUp",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Barbell Lateral Step-up",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between two benches, one to each side. Position bar on back of shoulders and grasp barbell to sides.",
"execution": "Lift leg and place foot on bench to side and forward of straight knee. Stand on bench by straightening leg and pushing body upward. Step down returning feet to original position. Repeat with opposite leg, alternating between legs.",
"comments": "Keep torso upright during exercise. Stepping knee should point same direction as foot. A modest degree of knee rotation occurs during this movement. See Controversial Exercises and Rotary Force in Squat Analysis.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, obliques",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, gastrocnemius, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsTBDeadlift":{"id": "33",
"exerciseid": "TBDeadlift",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Trap Bar Deadlift",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand with feet shoulder width or narrower in trap bar, weight to each side. Squat down with feet flat and grasp handles to sides.",
"execution": "Lift bar by extending hips and knees to full extension. Pull shoulders back at top of lift if rounded. Return weight to floor by bending hips back while allowing knees to bend forward slightly, keeping back straight and knees pointed same direction as feet. Repeat.",
"comments": "Throughout lift, keep hips low, shoulders high, arms and back straight. Knees should point same direction as feet throughout movement. See Squat Analysis. Also see Trap Bar Squat.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, trapeziusmiddle, erectorspinae, levatorscapulae, rhomboids",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "soleus, adductors, quadriceps",
"target": "gluteusmaximus"},"HipsTBStiffLegDeadlift":{"id": "34",
"exerciseid": "TBStiffLegDeadlift",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Trap Bar Stiff Leg Deadlift",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand on platform under loaded trap bar. Squat down and grasp handles to sides. Squat  Deadlift bar up to standing position.",
"execution": "Lower bar by bending hips. Bend knees slightly during descent and keep waist straight, flexing only slightly at bottom. With knees bent, lift bar by extending at hips until standing upright. Pull shoulders back slightly if rounded. Extend knees at top if desired. Repeat.",
"comments": "Lower back may bend slightly during full hip flexion. Target muscle is exercised isometrically if lower back does not bend. Begin with light weight and add additional weight gradually to allow adequate adaptation. Throughout lift, keep arms straight. Knee can be kept bent throughout movement. Keep bar over top of feet, close to legs. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings. When finished with set, dismount by lowering weight with knees bent and low back straight. Full range of motion will vary from person to person. Those with less flexibility may have to bend knees more or they may not even need to stand on platform. See Dangerous Exercise Essay . Also see Straight Leg Deadlift . Also see Straight Back Stiff Leg Deadlift .",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, trapeziusmiddle, levatorscapulae, trapeziuslower, rhomboids, quadriceps",
"synergists": "hamstrings, adductors, erectorspinae",
"target": "gluteusmaximus"},"HipsTBStrBackStiffLegDeadlift":{"id": "35",
"exerciseid": "TBStrBackStiffLegDeadlift",
"musclegroup": "Hips",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "GluteusMaximus",
"name": "Trap Bar Straight-back Stiff-leg Deadlift",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand with feet shoulder width or narrower in trap bar, weight to each side. Squat down with feet flat and grasp handles to sides. Deadlift from floor.",
"execution": "With back straight, lower bar toward floor by bending at hips. Bend knees slightly during descent and keep waist straight. Place weight onto floor. With knees still bent, lift bar by extending at hips until standing upright. Pull shoulders back if rounded. Extend knees at top if desired. Repeat.",
"comments": "Not all trap bar designs may allow for this movement. A squared openended trap bar is used in this demonstration. Throughout lift, keep arms and back straight. Do not lower weight beyond mild stretch throughout hamstrings. Full range of motion will vary from person to person. Those with less flexibility may have to bend knees more. Knees can be kept bent throughout movement.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, levatorscapulae, trapeziusmiddle, erectorspinae, trapeziuslower, rhomboids, quadriceps",
"synergists": "hamstrings, adductors",
"target": "gluteusmaximus"}}