{"UpperArmsBWBenchDip":{"id": "0",
"exerciseid": "BWBenchDip",
"musclegroup": "UpperArms",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Bench Dip",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on inside of one of two benches placed parallel, slightly less than legs length away. Place hands on edge of bench, straighten arms, slide rear end off of bench, and position heels on adjacent bench with legs straight.",
"execution": "Lower body by bending arms until slight stretch is felt in chest or shoulder, or rear end touches floor. Raise body and repeat.",
"comments": "Bench height should allow for full range of motion. Easier Resistance can be reduced by placing heels on floor. Heels on Floor Harder Weight can be placed on lap to increase resistance or movement can be performed on parallel bars. Weighted Bench DipTriceps Dip",
"stabilizers": "trapeziuslower",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "latissimusdorsi, pectoralisminor, pectoralisclavicular, deltoidanterior, levatorscapulae, pectoralissternal, rhomboids",
"target": "tricepsbrachii"},"UpperArmsBWBenchDipBentKnee":{"id": "1",
"exerciseid": "BWBenchDipBentKnee",
"musclegroup": "UpperArms",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Bench Dip (knees bent)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on side of bench. Place hands on edge of bench. Place feet on floor away from bench. Straighten arms, slide rear end off of edge of bench, and position feet on floor with knees bent.",
"execution": "Lower body by bending arms until slight stretch is felt in chest or shoulder, or rear end touches floor. Raise body and repeat.",
"comments": "Bench height should allow for full range of motion. Easier To make the exercise easier, heighten bench or place feet closer to bench allowing space for full range of motion. Harder To increase resistance, feet can be placed further away from bench or straightened. Legs Extended",
"stabilizers": "trapeziuslower",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "latissimusdorsi, pectoralisminor, pectoralisclavicular, deltoidanterior, levatorscapulae, pectoralissternal, rhomboids",
"target": "tricepsbrachii"},"UpperArmsBWBenchDipFloor":{"id": "2",
"exerciseid": "BWBenchDipFloor",
"musclegroup": "UpperArms",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Bench Dip (heels on floor)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on side of bench. Place hands on edge of bench. Position feet away from bench. Straighten arms, slide rear end off of edge of bench, and rest heels on floor with legs straight.",
"execution": "Lower body by bending arms until slight stretch is felt in chest or shoulder, or rear end touches floor. Raise body and repeat.",
"comments": "Bench height should allow for full range of motion. Easier Knees can be bent to make exercise easier. Knees Bent Harder Feet can be elevated on other bench to increase resistance. Feet on Bench",
"stabilizers": "trapeziuslower",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "latissimusdorsi, pectoralisminor, pectoralisclavicular, deltoidanterior, levatorscapulae, pectoralissternal, rhomboids",
"target": "tricepsbrachii"},"UpperArmsBWCloseGripPushup":{"id": "3",
"exerciseid": "BWCloseGripPushup",
"musclegroup": "UpperArms",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Close Grip Push-up",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie prone on floor with hands under shoulders or slightly narrower. Position body up off floor with extended arms and body straight.",
"execution": "Keeping body straight, lower body to floor by bending arms. Push body up until arms are extended. Repeat.",
"comments": "Both upper and lower body must be kept straight throughout movement. See wider grip pushup. Easier Resistance can be reduced by performing pushups with knees bent on floor or placing hands on elevated horizontal bar or edge of elevated surface. Bent kneeIncline Harder For greater challenge, elevate feet or perform Triceps Dips on parallel bars. Triceps Dip",
"stabilizers": "quadriceps, rectusabdominis, obliques",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "pectoralissternal, pectoralisclavicular, deltoidanterior",
"target": "tricepsbrachii"},"UpperArmsBWCloseGripPushupKnees":{"id": "4",
"exerciseid": "BWCloseGripPushupKnees",
"musclegroup": "UpperArms",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Close Grip Push-up (on knees)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie prone on floor with hands under shoulders or slightly narrower. Position body up off floor with extended arms and body straight.",
"execution": "Keeping body straight, lower body to floor by bending arms. Push body up until arms are extended. Repeat.",
"comments": "Both upper and lower body must be kept straight throughout movement. Forefeet can remain on floor as long as body is pivoting on knees. Also see close grip variation and wider grip pushups on knees. Easier Resistance can be reduced by placing hands on horizontal bar or edge of elevated surface (knee to chest high). Incline Pushups Harder For greater challenge perform Close Grip Pushups. Close Grip Pushups",
"stabilizers": "rectusabdominis, obliques",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "pectoralissternal, pectoralisclavicular, deltoidanterior",
"target": "tricepsbrachii"},"UpperArmsBWCloseGripPushupMB":{"id": "5",
"exerciseid": "BWCloseGripPushupMB",
"musclegroup": "UpperArms",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Close Grip Push-up (on medicine ball)",
"utility": "Specialized",
"mechanics": "Compound",
"force": "Push",
"preparation": "Kneel before medicine ball. Place hands on upper part of ball on each side. Balance upper body above ball with arms extended. Straighten body and place forefeet back, away from ball on floor shoulder width apart.",
"execution": "Keeping body straight, lower body by bending arms until chest touches ball. Push body up until arms are extended. Repeat.",
"comments": "Both upper and lower body must be kept straight throughout movement. Also see close grip pushup on floor. Easier Resistance can be reduced by performing pushups with knees bent on floor or placing medicine ball on higher platform. Balance can be made less challenging by placing feet further apart. Harder Elevate feet for greater intensity or to vary angle of exercise. Balance can be made more challenging by placing feet closer together.",
"stabilizers": "quadriceps, rectusabdominis, obliques",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "pectoralissternal, pectoralisclavicular, deltoidanterior",
"target": "tricepsbrachii"},"UpperArmsBWCloseGripInclinePushupBar":{"id": "6",
"exerciseid": "BWCloseGripInclinePushupBar",
"musclegroup": "UpperArms",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Close Grip Incline Push-up (on bar)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Grasp horizontal bar (lower than chest height) with hands shoulder width or slightly narrower. Position forefeet back from bar with arms and body straight. Arms should be perpendicular to body.",
"execution": "Keeping body straight, lower chest to bar by bending arms. Push body up until arms are extended. Repeat.",
"comments": "Both upper and lower body must be kept straight throughout movement. Height of bar affects difficulty of movement. See Gravity Vectors for greater understanding of how body angle influences resistance. Also see wider grip pushup. Easier Resistance can be reduced by performing exercise on higher bar or edge of platform. Harder Resistance can be increased by lowering bar or eventually performing close grip pushups. Close Grip Pushup",
"stabilizers": "soleus, quadriceps, gastrocnemius, rectusabdominis, obliques",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "pectoralissternal, pectoralisclavicular, deltoidanterior",
"target": "tricepsbrachii"},"UpperArmsBWSuspendedTricepsExtension":{"id": "7",
"exerciseid": "BWSuspendedTricepsExtension",
"musclegroup": "UpperArms",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Suspended Triceps Extension (with rope)",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Grasp triceps rope hanging from secured bar (chest height or lower). Position forefeet on floor, back from bar with body straight. Elbows can be either be completely bent or straight during mount with upper arms somewhat perpendicular with body.",
"execution": "Keeping body straight, raise body up and back up until arms are extended. Lower body by bending elbows, allowing head to travel between ends of rope. Repeat.",
"comments": "Instead of 1 Triceps Rope (as shown), 2 ab slings or 2 nyloncloth Stirrups with long straps can also be used (see how to loop cable stirrup onto bar) with overhand grip. Both upper and lower body must be kept straight throughout movement. Height of bar affects difficulty of movement. See Gravity Vectors for greater understanding of how body angle influences resistance. Also see Suspended Triceps Extension with Suspension Trainer. Easier Resistance can be reduced by performing exercise on higher bar with feet positioned slightly more forward. Harder Resistance can be increased by lowering bar and positioning feet further back so body is closer to horizontal. with bar slightly lower",
"stabilizers": "latissimusdorsi, pectoralisclavicular, rectusabdominis, wristflexors, serratusanterior, pectoralissternal, wristextensors, deltoidposterior, quadriceps, gastrocnemius, pectoralisminor, teresminor, obliques",
"target": "tricepsbrachii"},"UpperArmsBWTriDip":{"id": "8",
"exerciseid": "BWTriDip",
"musclegroup": "UpperArms",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Triceps Dip",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Mount shoulder width dip bar, arms straight with shoulders above hands. Keep hips straight.",
"execution": "Lower body until slight stretch is felt in shoulders. Push body up until arms are straight. Repeat.",
"comments": "Also see Chest Dips. Easier To decrease difficulty, use assistance from machine or training partner. Also consider Triceps Dip between benches or Selfassisted dips by placing feet on bench or elevation. Between benchesMachine assistedSelfassistedBandassisted Harder Added weight can be placed on dip belt or dumbbell can be placed between ankles to increase intensity. Weighted",
"stabilizers": "trapeziuslower",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "latissimusdorsi, pectoralisminor, pectoralisclavicular, deltoidanterior, levatorscapulae, pectoralissternal, rhomboids",
"target": "tricepsbrachii"},"UpperArmsBWTriDipBenches":{"id": "9",
"exerciseid": "BWTriDipBenches",
"musclegroup": "UpperArms",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Triceps Dip (between benches)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between ends of two benches. Place hands on ends of benches with fingers off end of benches. Grip should be somewhat narrow. Position feet out in front with legs straight, heels on floor, and torso upright.",
"execution": "Lower body by bending arms, allowing elbows to point back. When slight stretch is felt in chest or shoulders, push body up until arms are straight. Repeat.",
"comments": "In above clip, hands are positioned at ends of main segments of benches with fingers between gaps. On standard benches, hands should be placed near ends of benches. Perform on higher benches if slight stretch is not felt. Also see Bench Dip and Chest Dip (between benches). Easier Bend knees to decrease difficulty. Bent knees Harder Intensity can be added by (a) placing heels on third adjacent bench, (b) placing weight on lap, or (c) performing Triceps Dips on parallel or dip bars. Triceps Dip",
"stabilizers": "trapeziuslower",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "latissimusdorsi, pectoralisminor, pectoralisclavicular, deltoidanterior, levatorscapulae, pectoralissternal, rhomboids",
"target": "tricepsbrachii"},"UpperArmsBWTriDipBenchesBentKnees":{"id": "10",
"exerciseid": "BWTriDipBenchesBentKnees",
"musclegroup": "UpperArms",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Triceps Dip (bent knees between benches)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between ends of two benches. Place hands on ends of benches with fingers off ends of benches. Grip should be somewhat narrow. Position feet in front with legs bent and torso upright.",
"execution": "Lower body by bending arms, allowing elbows to point back. When slight stretch is felt in chest or shoulders, push body up until arms are straight. Repeat.",
"comments": "In above clip, hands are positioned at ends of main segments of benches with fingers between gaps. On standard benches, hands should be placed near ends of benches. Perform on higher benches if slight stretch is not felt. Also see Bench Dip (bent knee) and Chest Dip (bent knees between benches). Easier Bend knees more to decrease difficulty. Harder Straightening knees will make the exercise more challenging. Straight legs",
"stabilizers": "trapeziuslower",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "latissimusdorsi, pectoralisminor, pectoralisclavicular, deltoidanterior, levatorscapulae, pectoralissternal, rhomboids",
"target": "tricepsbrachii"}}