{"WaistWtCrunch":{"id": "0",
"exerciseid": "WtCrunch",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Weighted Crunch",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie supine on bench with head hanging off and knees and hips bent. Hold plate behind neck.",
"execution": "Flex waist to raise upper torso from bench. Keep low back on bench and raise torso up as high as possible. Return until back of shoulders contact padded incline board. Repeat.",
"comments": "Exercise can be performed without added weight until more resistance is needed. Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. See Arm Position During Waist Exercises and Spot Reduction Myth.",
"stabilizers": "No significant stabilizers",
"synergists": "obliques",
"target": "rectusabdominis"},"WaistWtCrunchX":{"id": "1",
"exerciseid": "WtCrunchX",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Weighted Crunch (plate on chest)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie supine on mat with lower legs on bench. Hold plate on chest with both hands.",
"execution": "Flex waist to raise upper torso from mat. Keep low back on mat and raise torso up as high as possible. Return until back of shoulders contact mat. Repeat.",
"comments": "Exercise can be performed without added weight until more resistance is needed. Leg elevation keeps pelvis tilted back keeping low back on mat. See Arm Position During Waist Exercises and Spot Reduction Myth.",
"stabilizers": "No significant stabilizers",
"synergists": "obliques",
"target": "rectusabdominis"},"WaistWtBallCrunch":{"id": "2",
"exerciseid": "WtBallCrunch",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Weighted Crunch (on stability ball)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on exercise ball. Walk forward on ball and lie back on ball with shoulders and head hanging off and knees and hips bent. Gently hyperextend back to contour of ball. Hold plate behind neck or on chest with both hands or use no weight.",
"execution": "Flex waist to raise upper torso. Return to original position. Repeat.",
"comments": "Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. Exercise can be performed without added weight until more resistance is needed. Movement can be made easier by positioning hips low on ball. In contrast, exercise can be made more challenging by using positioning ball lower on back and hips higher. Some individuals may experience low back discomfort if hips are not bent so they must use smaller ball size or lower their hip position on ball. See Arm Position During Waist Exercises and Spot Reduction Myth.",
"stabilizers": "No significant stabilizers",
"synergists": "obliques",
"target": "rectusabdominis"},"WaistWtOverheadBallCrunch":{"id": "3",
"exerciseid": "WtOverheadBallCrunch",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Weighted Overhead Crunch (on stability ball)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on exercise ball with medicine ball in hands. Walk forward on ball and lie back on ball with shoulders and head hanging off and knees and hips bent. Gently hyperextend back to contour of ball. Position medicine ball over upper chest with arms extended.",
"execution": "Keeping arms extended and medicine ball over upper chest, flex waist to raise upper torso. Return to original position. Repeat.",
"comments": "If ball is positioned lower than upper chest (eg over waist), effective resistance dramatically diminishes. See how length of lever arm affects resistance. Movement can be made easier by positioning hips low on ball. In contrast, exercise can be made more challenging by using positioning ball lower on back and hips higher. Some individuals may experience low back discomfort if hips are not bent so they must use smaller ball size or lower their hip position on ball. See Arm Position During Waist Exercises and Spot Reduction Myth.",
"stabilizers": "No significant stabilizers",
"synergists": "obliques",
"target": "rectusabdominis"},"WaistWtInclineCrunch":{"id": "4",
"exerciseid": "WtInclineCrunch",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Weighted Incline Crunch",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Hook feet under support and lie supine on incline bench with hips bent. Hold plate behind neck or clasp hands behind neck with no weight.",
"execution": "Flex waist to raise upper torso from bench. Keep low back on bench and raise torso up as high as possible. Return until back of shoulders contact padded incline board. Repeat.",
"comments": "Exercise can be performed without added weight until more resistance is needed. Elevate incline to increase resistance. See Arm Position During Waist Exercises. Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. Hip and knee flexors may be involved as stabilizers if incline is steep and no calf support is used. Also see intermediate technique. See Spot Reduction Myth.",
"stabilizers": "tibialisanterior",
"synergists": "obliques",
"target": "rectusabdominis"},"WaistWtInclineCrunchX":{"id": "5",
"exerciseid": "WtInclineCrunchX",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Weighted Incline Crunch (arms crossed)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Hook feet under foot brace and lie supine on incline board with hips bent. Hold plate on chest with both hands or use no weight.",
"execution": "Flex waist to raise upper torso from bench. Keep low back on bench and raise torso up as high as possible. Return until back of shoulders contact padded incline board. Repeat.",
"comments": "Exercise can be performed without added weight until more resistance is needed. Elevate incline to increase resistance. See Arm Position During Waist Exercises. If no knee support is built in to incline board, ball can be placed under legs as illustrated. Hip and knee flexors may be involved as stabilizers if incline is steep and no calf support is used. See advanced technique and Spot Reduction Myth.",
"stabilizers": "tibialisanterior",
"synergists": "obliques",
"target": "rectusabdominis"},"WaistWtInclineSitUp":{"id": "6",
"exerciseid": "WtInclineSitUp",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Weighted Incline Sit-up",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Hook feet under support and lie supine on incline bench with hips bent. Hold plate behind neck or clasp hands behind neck with no weight.",
"execution": "Raise torso from bench by bending waist and hips. Return until back of shoulders contact padded incline board. Repeat.",
"comments": "Exercise can be performed without added weight until more resistance is needed. Incline can also be elevated to increase resistance. See Arm Position During Waist Exercises. Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. If upper back does not come completely down at end of movement, abdominal muscles may only be isometrically involved in exercise. Pectineus, Adductor Longus, and Brevis do not assist in hip flexion since hips are already initially bent. Knee flexors may be involved as stabilizers if incline is steep and no calf support is used. See Spot Reduction Myth. Also see Dangerous Exercise Essay.",
"stabilizers": "tibialisanterior",
"synergists": "iliopsoas, sartorius, obliques, tensorfasciaelatae, quadriceps",
"target": "rectusabdominis"},"WaistWtInclineSitUpX":{"id": "7",
"exerciseid": "WtInclineSitUpX",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Weighted Incline Sit-up (arms crossed)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Hook feet under foot brace and lie supine on incline board with hips bent. Hold plate on chest with both hands or use no weight.",
"execution": "Raise torso from bench by bending waist and hips. Return until back of shoulders contact padded incline board. Repeat.",
"comments": "Exercise can be performed without added weight until more resistance is needed. Elevate incline to increase resistance. Elbows can also raise up over knees during each Situp to increase range of motion. Also see Arm Position During Waist Exercises. If no knee support is built in to incline board, ball can be placed under legs as illustrated. If upper back does not come completely down at end of movement, abdominal muscles may only be isometrically involved in exercise. Pectineus, Adductor Longus, and Brevis do not assist in hip flexion since hips are already initially bent. Knee flexors may be involved as stabilizers if incline is steep and no calf support is used. See Spot Reduction Myth. Also see Dangerous Exercise Essay.",
"stabilizers": "tibialisanterior",
"synergists": "iliopsoas, sartorius, obliques, tensorfasciaelatae, quadriceps",
"target": "rectusabdominis"},"WaistMBSitUp":{"id": "8",
"exerciseid": "MBSitUp",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Medicine Ball Overhead Throw Sit-up (machine)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Position feet under support with knees bent. With two medicine balls at bottom of chute, grasp closest medicine ball with both hands.",
"execution": "With ball in both hands, lie down onto back support while lowering medicine ball behind head. Raise torso from back support by bending waist and hips while raising ball overhead. Immediately throw ball into target and grasp other medicine ball at bottom of chute. Repeat movement.",
"comments": "Intensity can be increased by using heavier medicine ball or by performing movement faster. Movement can be made easier by using chest throw motion. If upper back does not come completely down at end of movement, abdominal muscles may only be isometrically involved in exercise. See similar plyometric movement Medicine Ball Situp (with partner). See Spot Reduction Myth and Dangerous Exercise Essay.",
"stabilizers": "tibialisanterior",
"synergists": "latissimusdorsi, obliques, tricepsbrachii, levatorscapulae, tensorfasciaelatae, pectoralissternal, iliopsoas, sartorius, deltoidposterior, teresmajor, adductors, pectineus, pectoralisminor, rhomboids, quadriceps",
"target": "rectusabdominis"},"WaistMBSitUpChest":{"id": "9",
"exerciseid": "MBSitUpChest",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Medicine Ball Chest Throw Sit-up (machine)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Position feet under support with knees bent. With two medicine balls at bottom of chute, grasp closest medicine ball with both hands.",
"execution": "With ball in both hands, lie down onto back support while lowering medicine ball to chest. Raise torso from back support by bending waist and hips while pushing ball away from chest. Immediately throw ball into target and grasp other medicine ball at bottom of chute. Repeat movement.",
"comments": "Intensity can be increased by using heavier medicine ball, by performing movement faster, using overhead throwing motion. If upper back does not come completely down at end of movement, abdominal muscles may only be isometrically involved in exercise. See similar plyometric movement Medicine Ball Situp (with partner). See Spot Reduction Myth and Dangerous Exercise Essay.",
"stabilizers": "tibialisanterior",
"synergists": "obliques, pectoralisclavicular, tricepsbrachii, tensorfasciaelatae, pectoralissternal, deltoidanterior, iliopsoas, sartorius, adductors, pectineus, quadriceps",
"target": "rectusabdominis"},"WaistWtSitUp":{"id": "10",
"exerciseid": "WtSitUp",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Weighted Sit-up",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Hook feet under support and lie supine on floor or mat with hips bent. Hold plate behind neck.",
"execution": "Raise torso from floor by bending waist and hips. Return until back of shoulders contact with floor or mat. Repeat.",
"comments": "Feet can be held down by partner instead of foot bar. Exercise can be performed without added weight until more resistance is needed. Exercise can be performed on incline board to increase resistance or decline board to decrease resistance. See Arm Position During Waist Exercises. Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. If upper back does not come completely down at end of movement, abdominal muscles may only be isometrically involved in exercise. Pectineus, Adductor Longus, and Brevis do not assist in hip flexion since hips are already initially bent. See Spot Reduction Myth. Also see Dangerous Exercise Essay.",
"stabilizers": "tibialisanterior",
"synergists": "iliopsoas, sartorius, obliques, tensorfasciaelatae, quadriceps",
"target": "rectusabdominis"},"WaistWtSitUpX":{"id": "11",
"exerciseid": "WtSitUpX",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Weighted Sit-up (arms crossed)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Hook feet under support and lie supine on floor or mat with hips and knees bent. With both hands, hold plate on chest with forearms crossed or use no weight.",
"execution": "Raise torso from floor by bending waist and hips. Return until back of shoulders contact with floor or mat. Repeat.",
"comments": "If feet are close to hips, bent arms can be lifted above knees, allowing for complete range of motion resulting in a more bell shaped resistance curve (ie lessened resistance at top of movement) due to more varying force vectors against gravity. The same can be accomplished by placing feet slightly further away from hips, requiring no need to lift arms above knees (as shown). Exercise can be performed without added weight until more resistance is needed. Exercise can be performed on incline board to increase resistance or decline board to decrease resistance. See Arm Position During Waist Exercises and movement performed with weight behind head. If upper back does not come completely down at end of movement, abdominal muscles may only be isometrically involved in exercise. Pectineus, Adductor Longus, and Brevis do not assist in hip flexion since hips are already initially bent. See Spot Reduction Myth. Also see Dangerous Exercise Essay.",
"stabilizers": "tibialisanterior",
"synergists": "iliopsoas, sartorius, obliques, tensorfasciaelatae, quadriceps",
"target": "rectusabdominis"},"WaistWtHangingLegHipRaise":{"id": "12",
"exerciseid": "WtHangingLegHipRaise",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Weighted Hanging Leg-Hip Raise",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Place weight between ankles or use no weight. Grasp and hang from high bar.",
"execution": "Raise legs by flexing hips and knees until hips are fully flexed. Continue to raise knees toward shoulders by flexing waist. Return until waist, hips, and knees are extended. Repeat.",
"comments": "Exercise can be performed without added weight until more resistance is needed. Also see Hanging Leg Hip Raise with Ab Straps. Rectus Abdominis and Obliques dynamically contract only if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only isometrically contract to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible. See Spot Reduction Myth and Lower Ab Myth. Also Weighted Hanging Leg Raise.",
"dynamic stabilizers": "quadriceps",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, obliques",
"target": "rectusabdominis"},"WaistWtInclineLegHipRaise":{"id": "13",
"exerciseid": "WtInclineLegHipRaise",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Weighted Incline Leg-Hip Raise",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Sit on incline board. Place weight between ankles or use no weight. Lie supine on incline board with torso elevated. Grasp feet hooks or sides of board by head for support.",
"execution": "Raise legs by flexing hips while flexing knees until hips are fully flexed. Continue to raise knees toward shoulders by flexing waist, raising hips from board. Return until waist, hips and knees are extended. Repeat.",
"comments": "Exercise can be performed without added weight until more resistance is needed. Elevate incline to increase resistance. When raising hips, keep knees fully flexed, so as not to throw weight of lower legs over head. Rectus Abdominis and Obliques dynamically contract only if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only isometrically contract to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible. See Spot Reduction Myth and Lower Ab Myth. Also see Weighted Incline Leg Raise.",
"stabilizers": "latissimusdorsi, deltoidposterior, teresmajor, tricepsbrachii, pectoralissternal, quadriceps",
"dynamic stabilizers": "quadriceps",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, obliques",
"target": "rectusabdominis"},"WaistWtLegHipRaise":{"id": "14",
"exerciseid": "WtLegHipRaise",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Weighted Lying Leg-Hip Raise",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Place weight between ankles or use no weight. Lie supine on bench or floor. Grasp sides of bench for support.",
"execution": "Raise legs by flexing hips while flexing knees until hips are fully flexed. Continue to raise knees toward shoulders by flexing waist, raising hips from board. Return until waist, hips and knees are extended. Repeat.",
"comments": "Exercise can be performed without added weight until more resistance is needed. When raising hips, keep knees fully flexed, so as not to throw weight of lower legs over head. Rectus Abdominis and Obliques dynamically contract only if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only isometrically contract to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible. See Spot Reduction Myth and Lower Ab Myth. Also see Weighted Incline Leg Raise.",
"stabilizers": "latissimusdorsi, deltoidposterior, teresmajor, tricepsbrachii, pectoralissternal, quadriceps",
"dynamic stabilizers": "quadriceps",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, obliques",
"target": "rectusabdominis"},"WaistWtVerticalLegHipRaise":{"id": "15",
"exerciseid": "WtVerticalLegHipRaise",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Weighted Vertical Leg-Hip Raise",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Place weight between ankles or use no weight. Position forearms on padded parallel bars with hands on handles and back on vertical pad.",
"execution": "Raise legs by flexing hips and knees until hips are fully flexed. Continue to raise knees toward shoulders by flexing waist, raising hips from back board. Return until waist, hips, and knees are extended. Repeat.",
"comments": "Exercise can be performed without added weight until more resistance is needed. Rectus Abdominis and Obliques dynamically contract only if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only isometrically contract to stabilize pelvis and waist during hip flexion see Weighted Vertical Leg Raise. It may be necessary to completely flex hips before waist flexion is possible. See Spot Reduction Myth and Lower Ab Myth.",
"stabilizers": "latissimusdorsi, trapeziuslower, pectoralisminor, pectoralissternal",
"dynamic stabilizers": "quadriceps",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps, obliques",
"target": "rectusabdominis"},"WaistWTVerticalLegHipRaiseBosa":{"id": "16",
"exerciseid": "WTVerticalLegHipRaiseBosa",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Weighted Vertical Leg-Hip Raise (Bosu support)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Place weight between ankles. Position forearms on padded parallel bars with hands on handles and back on convexed surface.",
"execution": "Raise legs by flexing hips and knees. As hips approach full flexion, lean back. Continue to raise knees toward shoulders by flexing waist and raising hips and low back from convexed surface. Return until waist, hips, and knees are extended. Repeat.",
"comments": "Exercise can be performed without added weight until more resistance is needed. Rectus Abdominis and Obliques dynamically contract only if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only isometrically contract to stabilize pelvis and waist during hip flexion see Weighted Vertical Leg Raise. It may be necessary to completely flex hips before waist flexion is possible. See Spot Reduction Myth and Lower Ab Myth.",
"stabilizers": "latissimusdorsi, trapeziuslower, pectoralisminor, pectoralissternal",
"dynamic stabilizers": "quadriceps",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, quadriceps, obliques",
"target": "rectusabdominis"},"WaistWtVerticalLegHipRaisePB":{"id": "17",
"exerciseid": "WtVerticalLegHipRaisePB",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Weighted Vertical Leg-Hip Raise (on parallel bars)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Place weight between ankles. Stand between parallel bars and grip bar on each side with overhand grip. Lift body off floor and balance body upright with arms straight.",
"execution": "Raise legs by flexing hips and knees until hips are fully flexed. Continue to raise knees toward shoulders by flexing waist. Return until waist, hips, and knees are extended. Repeat.",
"comments": "This exercise is alternative to Vertical Leghip Raise when apparatus is not available, or Hanging Leghip Raise when high bar is not available or too low to allow for adequate leg clearance. Exercise can be performed without added weight until more resistance is needed. Rectus Abdominis and Obliques dynamically contract only if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only isometrically contract to stabilize pelvis and waist during hip flexion see Weighted Vertical Leg Raise on parallel bars. It may be necessary to completely flex hips before waist flexion is possible. See Spot Reduction Myth and Lower Ab Myth.",
"dynamic stabilizers": "quadriceps",
"stabilizers": "latissimusdorsi, deltoidposterior, pectoralisminor, tricepsbrachii, trapeziuslower, pectoralissternal, deltoidanterior",
"synergists": "iliopsoas, sartorius, adductors, pectineus, tensorfasciaelatae, obliques",
"target": "rectusabdominis"}}