{"HipsLVHipFlexion":{"id": "0",
"exerciseid": "LVHipFlexion",
"musclegroup": "Hips",
"equipment": "lever",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Lever Hip Flexion",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand on platform facing to one side and grasp bar for support. Position front of leg nearest to machine against padded roller while standing on other leg.",
"execution": "Raise lever by flexing hip until knee is higher than hip. Return until hip is extended. Repeat. Continue with opposite leg.",
"comments": "Machine must be adjusted to align hip with lever fulcrum. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. Conversely, it may be necessary to completely flex hips before waist flexion is possible, which is not practical with the opposite leg supporting body. See Spot Reduction Myth and Lower Ab Myth.",
"stabilizers": "gluteusminimus, quadratuslumborum, gluteusmedius, rectusabdominis, obliques",
"dynamic stabilizers": "quadriceps",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsLVLyingLegRaiseN":{"id": "1",
"exerciseid": "LVLyingLegRaiseN",
"musclegroup": "Hips",
"equipment": "lever",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Lever Lying Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on end of bench with both legs over padded lever and hips aligned with fulcrum. Strap legs onto padded lever. Lie supine on bench. Grasp handles near head.",
"execution": "Raise legs by flexing hips until they are completely flexed. Lower legs until hips are extended. Repeat.",
"comments": "Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. Also see Spot Reduction Myth and Lower Ab Myth.",
"dynamic stabilizers": "quadriceps",
"stabilizers": "quadriceps, rectusabdominis, obliques",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"},"HipsLVVerticalLegRaise":{"id": "2",
"exerciseid": "LVVerticalLegRaise",
"musclegroup": "Hips",
"equipment": "lever",
"exercisetype": "WeightExercises",
"muscleclass": "HipFlexors",
"name": "Lever Vertical Leg Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp handles slightly to front and stand on foot bar with knees slightly bent and hips against pad.",
"execution": "With back straight, raise legs as high as possible by flexing hips. Return and repeat.",
"comments": "Exercise is typically performed without added resistance. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique will only act to stabilize pelvis and waist during hip flexion. It is necessary to raise legs higher than what is shown before waist flexion occurs see Lever Vertical LegHip Raise. Also see Spot Reduction Myth and Lower Ab Myth.",
"stabilizers": "pectoralissternal, pectoralisminor, obliques, tricepsbrachii, rectusabdominis, deltoidanterior",
"synergists": "pectineus, sartorius, tensorfasciaelatae, adductors",
"target": "iliopsoas"}}