{"ThighsCBBentOverLegCurl":{"id": "0",
"exerciseid": "CBBentOverLegCurl",
"musclegroup": "Thighs",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Cable Bent-over Leg Curl",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Attach ankle cuff to low pulley. With cuff on one ankle, grasp ballet bar with both hands and step far back with other foot. Elbows remain straight to support body leaning forward. Attached foot is stretched off floor.",
"execution": "Pull cable attachment back and up slightly by flexing knee. Raise knee slightly by flexing hip until knee is fully flexed. Return by straightening knee and lowering knee slightly to original position. Repeat. Continue with opposite leg.",
"comments": "Raise knee very slightly as knee is flexing and return as weight is lowered. Keep hip from sagging or from being pulled forward. Heavier resistances can tear apart standard leather ankle cuffs. Heavier resistances can tear apart leather ankle strap. A cable rope attachment over a towel (side view  rear view) can be used when heavy duty ankle or leg cuff or foot harness is not available. Keep in mind that this piece of equipment has not been designed for purpose, so we are obligated to warn you that using a cable rope attachment in this manner can result in serious injury including but not limited to loss of limb or death. Dorsal flexion of ankle reduces active insufficiency of Gastrocnemius allowing it to assist in knee flexion. Also see Cable Standing Leg Curl.",
"antagonist stabilizers": "tibialisanterior",
"stabilizers": "gluteusmedius, gluteusminimus",
"dynamic stabilizers": "quadriceps",
"synergists": "popliteus, sartorius, gracilis, iliopsoas, tensorfasciaelatae, gastrocnemius",
"target": "hamstrings"},"ThighsCBLyingLegCurl":{"id": "1",
"exerciseid": "CBLyingLegCurl",
"musclegroup": "Thighs",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Cable Lying Leg Curl",
"utility": "Basic",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Attach two ankle cuffs to low pulley attachment. With cuffs on both ankles lie prone on flat bench with knees just beyond edge of bench. Grip under side or base of bench for support.",
"execution": "Raise ankles to glutes by flexing knees. Lower ankles until knees are straight. Repeat.",
"comments": "Keep torso on bench to reduce hyperextension of lower back. Dorsal flexion of ankle reduces active insufficiency of Gastrocnemius allowing it to assist in knee flexion.",
"antagonist stabilizers": "tibialisanterior, quadriceps",
"synergists": "sartorius, popliteus, gracilis, gastrocnemius",
"target": "hamstrings"},"ThighsCBStandingLegCurl":{"id": "2",
"exerciseid": "CBStandingLegCurl",
"musclegroup": "Thighs",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Cable Standing Leg Curl",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Attach foot harness to low pulley. With foot harness on one ankle, grasp support bar with both hands and step back with other foot. Elbows remain straight to support body. Attached foot is slightly off floor.",
"execution": "Pull cable attachment back by flexing knee until knee is fully flexed. Return by straightening knee to original position and repeat. Continue with opposite leg.",
"comments": "Keep hip from sagging or from being pulled forward. Dorsal flexion of ankle reduces active insufficiency of Gastrocnemius allowing it to assist in knee flexion. Also see Cable Bentover Leg Curl.",
"antagonist stabilizers": "tibialisanterior",
"stabilizers": "gluteusmedius, gluteusminimus, quadratuslumborum, obliques",
"synergists": "sartorius, popliteus, gracilis, gastrocnemius",
"target": "hamstrings"},"ThighsCBStraightLegDeadlift":{"id": "3",
"exerciseid": "CBStraightLegDeadlift",
"musclegroup": "Thighs",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Cable Straight Leg Deadlift",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand between two very low pulleys with shoulder width or narrower stance. Squat down and grasp stirrup attachments to each side. Stand upright with arms straight down to sides.",
"execution": "With knees straight, bow forward by bending hips. Bend waist as stirrups approach lowest position. Lift stirrups by extending hips and waist until standing upright. Pull shoulders back slightly if rounded. Repeat.",
"comments": "Begin with very light weight and add additional weight gradually to allow lower back adequate adaptation. Throughout lift, keep arms and knees straight. Do not stand behind pulleys. Do not pause or bounce at bottom of lift. Lower back may bend slightly during full hip flexion phase. Do not lower weight beyond mild stretch throughout hamstrings and low back. Full range of motion will vary from person to person depending on flexibility. See Dangerous Exercise Essay. Also see Straight Back Straight Leg Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, trapeziusmiddle, levatorscapulae, trapeziuslower, rhomboids",
"synergists": "gluteusmaximus, adductors, erectorspinae",
"target": "hamstrings"},"ThighsCBStrBackStrLegDeadlift":{"id": "4",
"exerciseid": "CBStrBackStrLegDeadlift",
"musclegroup": "Thighs",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Cable Straight-back Straight-leg Deadlift",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand between two very low pulleys with shoulder width or narrower stance. Squat down and grasp stirrup attachments to each side. Stand upright with arms straight down to sides.",
"execution": "With knees and back straight, bow forward by bending hips until hamstrings are tight, or just before lower back bends. Raise body upright by extending hips until standing. Pull shoulders back slightly at top of lift if rounded. Repeat.",
"comments": "Throughout lift, keep arms, knees, and back straight. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch. Full range of motion will vary from person to person depending on flexibility. Also see Straight Leg Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziusupper, trapeziusmiddle, erectorspinae, levatorscapulae, trapeziuslower, rhomboids",
"synergists": "gluteusmaximus, adductors",
"target": "hamstrings"}}