{"ThighsSTLegCurl":{"id": "0",
"exerciseid": "STLegCurl",
"musclegroup": "Thighs",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Suspended Leg Curl",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on floor facing suspension trainer loops in low position. Grasp bottom of loops, then lay supine. Raise legs and place heels in loops with soles contacting handles. Extend legs out and place arms on floor off to sides. Straighten low back, knees, and hips, raising back and hips off of floor.",
"execution": "Pull heels toward rear end by bending knees and hips simultaneously. Lower body to original position by straightening knees and hips. Repeat.",
"comments": "This exercise can be performed on TRX style suspension trainer. See Suspended Supine Feet MountDismount. Keep low back straight, maintaining approximate height from floor throughout movement. Hamstrings seemingly acts as a dynamic stabilizer, since it shortens through knee, while it lengthens through hip. However, net contraction actually appears to occur, since hip flexes only about 50, while knee flexes nearly 100, allowing hamstrings to remain in a mechanically strong position throughout movement.  Dorsal flexion of ankle reduces active insufficiency of Gastrocnemius, allowing it to assist in knee flexion. Apart from Sartorius involvement, flexion of hips is largely passive and is accomplished by eccentric contraction of glutes during concentric contraction of hamstrings, even when lying far away from suspension anchor. Easier Movement can be made easier by lying closer under anchor of suspension trainer. Harder Movement can be made more challenging by lying further back, away horizontally from anchor of suspension trainer. Alternatively, hips can be kept straight during knee flexion increasing active insufficiency of hamstrings. Suspended Straight Leg Curl",
"dynamic stabilizers": "quadriceps",
"antagonist stabilizers": "tibialisanterior, rectusabdominis, obliques",
"stabilizers": "gluteusmaximus, erectorspinae",
"synergists": "sartorius, popliteus, gracilis, gastrocnemius",
"target": "hamstrings"},"ThighsSTStraightHipLegCurl":{"id": "1",
"exerciseid": "STStraightHipLegCurl",
"musclegroup": "Thighs",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Suspended Straight Hip Leg Curl",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on floor facing suspension trainer loops in low position. Grasp bottom of loops, then lay supine. Raise legs and place heels in loops with soles contacting handles. Extend legs out and place arms on floor off to sides. Straighten low back, knees, and hips, raising back and hips off of floor.",
"execution": "Bend knees, pulling heels toward rear end while keeping hips and low back straight. Raise up until lower legs are vertical or fully flexed. Lower body to original position by straightening knees, maintaining straight hip position. Repeat.",
"comments": "This exercise can be performed on TRX style suspension trainer. See Suspended Supine Feet MountDismount. Keep hips straight throughout movement. With hips fully extended, Hamstrings enter active insufficiency near complete knee flexion. Dorsal flexion of ankle reduces active insufficiency of Gastrocnemius, allowing it to assist in knee flexion. Easier Movement can be made easier by lying closer under anchor of suspension trainer. Positioning loops higher could also make movement somewhat easier, however, greater cervical spinal and neck flexion flexibility would be required at top of movement. Alternatively, hips can articulate during knee flexion to decrease intensity. Suspended Leg Curl (bending hips) Harder Movement can be made more challenging by lying further back, away horizontally from anchor of suspension trainer. Suspending feet nearer to ground will also increase difficulty since body would be positioned more horizontal moving more directly against gravity.",
"antagonist stabilizers": "tibialisanterior, rectusabdominis, obliques",
"stabilizers": "gluteusmaximus, erectorspinae",
"synergists": "sartorius, popliteus, gracilis, gastrocnemius",
"target": "hamstrings"},"ThighsSTHamstringRunner":{"id": "2",
"exerciseid": "STHamstringRunner",
"musclegroup": "Thighs",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Suspended Hamstring Runner",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on floor facing suspension trainer loops in low position. Grasp bottom of loops, then lay supine. Raise legs and place heels in loops with soles contacting handles. Extend one leg out straight, keep other leg bent so knee is pointing up. Place arms on floor off to sides. Lift low back and hips off of floor so one leg is straight with back and other leg bent, so foot of bent leg is close to knee of straight leg.",
"execution": "Simultaneously alternate leg positions by straightening bent leg while bending straight knee. Repeat.",
"comments": "This exercise can be performed on TRX style suspension trainer. See Suspended Supine Feet MountDismount. Keep low back straight, maintaining approximate height from floor throughout movement. On most popular suspension trainers, keep lower body weight equally distributed on each side to prevent slippage. Some makes of suspension trainers do not have this slack in their design, so one leg can relax momentarily in straight position, while bent side bears most of resistance, allowing for a more dynamic contraction in this specific movement. Hamstrings seemingly acts as a dynamic stabilizer, since it shortens through knee while it lengthens through hip. However, net contraction actually appears to occur, since hip flexes only about 50, while knee flexes nearly 100, allowing hamstring to remain in a mechanically strong position throughout movement. Dorsal flexion of ankle reduces active insufficiency of Gastrocnemius, allowing it to assist in knee flexion. Apart from Sartorius involvement, flexion of hip is largely passive and is accomplished by eccentric contraction of glutes during concentric contraction of hamstrings, even when lying far away from suspension anchor. Easier Movement can be made easier by lying closer under anchor of suspension trainer. Harder Movement can be made more challenging by lying further back, away horizontally from anchor of suspension trainer.",
"dynamic stabilizers": "quadriceps",
"antagonist stabilizers": "tibialisanterior, rectusabdominis, obliques",
"stabilizers": "gluteusmaximus, erectorspinae",
"synergists": "sartorius, popliteus, gracilis, gastrocnemius",
"target": "hamstrings"},"ThighsSTHangingLegCurl":{"id": "3",
"exerciseid": "STHangingLegCurl",
"musclegroup": "Thighs",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Suspended Hanging Leg Curl",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lay supine under suspension trainer and grasp handles. Straighten and raise body off of floor keeping heelson floor.",
"execution": "Pull body toward feet by bending knees and hips. Roll onto feet until knees are fully flexed. Return body to original position by extending knees and hips. Repeat.",
"comments": "This exercise can be performed on TRX style suspension trainer or adjustable length gymnastics rings. Positioned handles so back is slightly above floor once grip is established. Keep low back straight, maintaining approximate height from floor throughout movement. Hamstrings seemingly acts as a dynamic stabilizer, since it shortens through knee, while it lengthens through hip. However, net contraction actually appears to occur, since hip flexes only about 50, while knee flexes nearly 100, allowing hamstrings to remain in a mechanically strong position throughout movement.  Dorsal flexion of ankle reduces active insufficiency of Gastrocnemius, allowing it to assist in knee flexion. Apart from Sartorius involvement, flexion of hips is largely passive and is accomplished by eccentric contraction of glutes during concentric contraction of hamstrings. Easier Movement can be made easier by positioning feet closer under anchor of suspension trainer. Harder Movement can be made more challenging by positioning feet further away from under anchor of suspension trainer. Alternatively, hips can be kept straight during knee flexion increasing active insufficiency of hamstrings. Suspended Hanging Straight Leg Curl",
"dynamic stabilizers": "quadriceps",
"antagonist stabilizers": "tibialisanterior, rectusabdominis, obliques",
"stabilizers": "trapeziusmiddle, gluteusmaximus, erectorspinae, trapeziuslower, rhomboids",
"synergists": "sartorius, popliteus, gracilis, gastrocnemius",
"target": "hamstrings"},"ThighsSTHangingStraightHipLegCurl":{"id": "4",
"exerciseid": "STHangingStraightHipLegCurl",
"musclegroup": "Thighs",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Suspended Hanging Straight Hip Leg Curl",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lay supine under suspension trainer and grasp handles. Straighten and raise body off of floor keeping heelson floor.",
"execution": "Pull body toward feet by bending knees while keeping hips and back straight. Roll onto feet until knees are fully flexed. Return body to original position by extending knees maintaining straight hip position. Repeat.",
"comments": "This exercise can be performed on TRX style suspension trainer or adjustable length gymnastics rings. Positioned handles so back is slightly above floor once grip is established. Keep low back and hips straight throughout movement. With hips fully extended, Hamstrings enter active insufficiency near complete knee flexion. Dorsal flexion of ankle reduces active insufficiency of Gastrocnemius, allowing it to assist in knee flexion. Easier Movement can be made easier by positioning feet closer under anchor of suspension trainer. Alternatively, hips can articulate during knee flexion to decrease intensity. Suspended Hanging Leg Curl (bending hips) Harder Movement can be made more challenging by positioning feet further away from under anchor of suspension trainer.",
"antagonist stabilizers": "tibialisanterior, rectusabdominis, obliques",
"stabilizers": "trapeziusmiddle, gluteusmaximus, erectorspinae, trapeziuslower, rhomboids",
"synergists": "sartorius, popliteus, gracilis, gastrocnemius",
"target": "hamstrings"},"ThighsSTHyperextension":{"id": "5",
"exerciseid": "STHyperextension",
"musclegroup": "Thighs",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Suspended Hyperextension",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Grasp suspension handles and momentarily step back until arms are extended forward and straight. While keeping arms straight and shoulders back, step forward so body reclines back behind suspension handles. Fold at hips onto heels, allowing rear end to fall far back with arms and shoulders stretched forward.",
"execution": "Drive hips forward until hips are straight, while keeping arms and shoulders straight. Near top of motion, reach back with arms over head and hyperextend spine. While keeping arms over head, lower body with hips falling back down to starting position and repeat.",
"comments": "An alternative mount involves stepping back with suspension handles in hands until arms are pulled forward about 45 (give or take) from resting position. At this point, recline body back, then fold at hips, allowing rear end to fall far back with arms and shoulders stretched forward. Dismounting can be achieved by walking backward until body is upright. This exercise can be performed on TRX style suspension trainer or adjustable length gymnastics rings. Easier Resistance is least when body is positioned upright at top of exercise. Movement can be made easier with staggered foot position by placing one foot slightly back. Harder This movement can be made more challenging by placing feet more forward, thereby angling body back at initiation of movement. See Gravity Vectors for greater understanding of how body angle influences resistance.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "supraspinatus, trapeziusmiddle, deltoidlateral, tricepsbrachii, trapeziuslower, serratusanterior, deltoidanterior",
"synergists": "gluteusmaximus, adductors, erectorspinae",
"target": "hamstrings"}}