{"ThighsBWGluteHamRaiseHead":{"id": "0",
"exerciseid": "BWGluteHamRaiseHead",
"musclegroup": "Thighs",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Glute-Ham Raise (hands behind neck)",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"execution": "From upright position, lower body by straightening knees until body is horizontal. Continue to lower torso by bending hips until body is upside down. Raise torso by extending hips until fully extended. Continue to raise body by flexing knees until body is upright. Repeat.",
"comments": "Easier Movement can be made easier by placing arms further down away from head. GluteHam Raise (hands behind hips) Harder Exercise can be made more challenging by placing hands further up on head or beyond head. See Arm Position During Waist Exercises. Exercise can also be performed with additional weight. Weighted GluteHam RaiseBarbell GluteHam RaiseHamstring Raise",
"antagonist stabilizers": "tibialisanterior, rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"synergists": "popliteus, sartorius, gracilis, gluteusmaximus, adductors, gastrocnemius",
"target": "hamstrings"},"ThighsBWGluteHamRaiseHips":{"id": "1",
"exerciseid": "BWGluteHamRaiseHips",
"musclegroup": "Thighs",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Glute-Ham Raise (hands behind hips)",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"execution": "From upright position, lower body by straightening knees until body is horizontal. Continue to lower torso by bending hips until body is upside down. Raise torso by extending hips until fully extended. Continue to raise body by flexing knees until body is upright. Repeat.",
"comments": "Easier Movement can be made easier by having partner assist in raise by pulling up on shoulders (from front) or chest (from side). Harder Exercise can be made more challenging by placing hands further up toward neck or head. See Arm Position During Waist Exercises. Also consider performing Hamstring Raise. GluteHam Raise (hands on neck)Hamstring Raise",
"antagonist stabilizers": "tibialisanterior, rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"synergists": "popliteus, sartorius, gracilis, gluteusmaximus, adductors, gastrocnemius",
"target": "hamstrings"},"ThighsBWHangingHamstringBridge":{"id": "2",
"exerciseid": "BWHangingHamstringBridge",
"musclegroup": "Thighs",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Hanging Hamstring Bridge",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand behind bar facing elevated platform positioned slightly away on other side of bar. Grasp bar with slightly wider than shoulder width grip. Walk body under bar and position back of heels on elevated platform. With legs extended forward, hang under bar with arms straight and hips bent just above floor.",
"execution": "Raise hips up as high as possible by extending hips. Lower hips to original position just above floor. Repeat.",
"comments": "Platform should be high enough to allow hips to flex without buttocks contacting floor. Full range of motion will vary from person to person. Adductor Magnus may only assist at initial phase hip extension depending on degree of hip flexion at bottom of movement.  Also see Hanging Hyperextension forErector Spinae performed with fuller range of movement. Easier Movement can be made easier by positioning bar higher. Harder Exercise is most difficult when bar is positioned in lower position, yet not allowing bottocks to contact floor while platform is elevated up to the point where hips travel more vertical. Performing movement with only one leg will greatly increase difficulty. Single Leg Hanging Hamstring Bridge",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "trapeziuslower, trapeziusmiddle, rhomboids, erectorspinae",
"synergists": "latissimusdorsi, tricepsbrachii, levatorscapulae, pectoralissternal, deltoidposterior, gluteusmaximus, teresmajor, adductors, pectoralisminor, rhomboids",
"target": "hamstrings"},"ThighsBWSingleLegHangingHamstringBridge":{"id": "3",
"exerciseid": "BWSingleLegHangingHamstringBridge",
"musclegroup": "Thighs",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Single Leg Hanging Hamstring Bridge",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand behind bar facing elevated platform positioned slightly away on other side of bar. Grasp bar with slightly wider than shoulder width grip. Walk body under bar. Position back of heelon elevated platform. Place other foot on or just over floor so leg is bent. Hang under bar with arms straight and hips bent just above floor.",
"execution": "Raise hips up as high as possible by extending hipand spine. Maintain bent position of lower leg allowing it to rise with hips. Lower hips along with bent lower leg to original position and repeat.Continue with legs in opposite position.",
"comments": "Platform should be high enough to allow hipto flex without buttocks contacting floor. Full range of motion will vary from person to person. Adductor Magnus may only assist at initial phase hip extension depending on degree of hip flexion at bottom of movement. Easier Movement can be made easier by positioning bar higher.Performing movement with bothlegs will make movement much easier. Hanging Hamstring Bridge Harder Exercise is most difficult when bar is positioned in lower position, yet not allowing bottocks to contact floor while platform is elevated up to the point where hips travel more vertical.",
"stabilizers": "trapeziuslower, trapeziusmiddle, rhomboids",
"synergists": "latissimusdorsi, tricepsbrachii, levatorscapulae, pectoralissternal, deltoidposterior, hamstrings, gluteusmaximus, teresmajor, adductors, pectoralisminor, rhomboids",
"target": "erectorspinae"},"ThighsBWHangingHamstringBridgeCurl":{"id": "4",
"exerciseid": "BWHangingHamstringBridgeCurl",
"musclegroup": "Thighs",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Hanging Hamstring Bridge Curl",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"execution": "Raise hipsby extending hips. Before full hip extension, pull body toward feet by bending knees and hips. Roll onto feet until knees are fully flexed. Return body to original position by extending knees, then lowering hips to original position just above floor. Repeat.",
"comments": "Platform should be high enough to allow hips to flex without buttocks contacting floor. Full range of motion will vary from person to person. Adductor Magnus may only assist at initial phase hip extension depending on degree of hip flexion at bottom of movement. Preventing full extension of hipallows hamstrings to remain in a mechanically strong position as it approaches full flexion by reducing active insufficiency.Dorsal flexion of ankle also reduces active insufficiency of Gastrocnemius, allowing it to assist in knee flexion. Easier Movement can be made easier by positioning platform and feet closer to bar. bar higher while keeping platform as low as possible without allowing buttocks to contact floor. Harder Exercise can be made more difficult by positioning platform and feet further away from bar.bar in lower position, yet not allowing bottocks to contact floor.platform higher.hips straight afterhip raise phase Performing movement with only one leg will greatly increase difficulty. Single LegHanging Hamstring Bridge Curl",
"dynamic stabilizers": "quadriceps",
"antagonist stabilizers": "tibialisanterior, rectusabdominis, obliques",
"stabilizers": "trapeziuslower, trapeziusmiddle, rhomboids, erectorspinae",
"synergists": "latissimusdorsi, popliteus, gracilis, tricepsbrachii, levatorscapulae, pectoralissternal, deltoidposterior, sartorius, gluteusmaximus, teresmajor, adductors, gastrocnemius, pectoralisminor, rhomboids",
"target": "hamstrings"},"ThighsBWSingleLegHangingHamstringBridgeCurl":{"id": "5",
"exerciseid": "BWSingleLegHangingHamstringBridgeCurl",
"musclegroup": "Thighs",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Single Leg Hanging Hamstring Bridge Curl",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"execution": "Raise hip and bent lower leg up by extending hip of elevated leg. Maintain bent position of lower leg allowing it to rise with hips. Before full hip extension, pull body toward foot by bending knee and hip of elevated leg. Roll onto foot until knee is fully flexed. Return body to original position by extending knee, then lowering hips and bent lower leg to original position just above floor. Repeat. Continue with opposite leg position.",
"comments": "Platform should be high enough to allow hip to flex without buttocks contacting floor. Full range of motion will vary from person to person. Adductor Magnus may only assist at initial phase hip extension depending on degree of hip flexion at bottom of movement. Preventing full extension of hipallows hamstrings to remain in a mechanically strong position as it approaches full flexion by reducing active insufficiency.Dorsal flexion of ankle also reduces active insufficiency of Gastrocnemius, allowing it to assist in knee flexion. Easier Movement can be made easier by positioning platform and elevated foot closer to bar.bar higher while keeping platform as low as possible without allowing buttocks to contact floor. Performing movement with both legs elevated will greatly decrease difficulty. Hanging Hamstring Bridge Curl Harder Exercise can be made more difficult by positioning platform and elevated foot further away from bar.bar in lower position, yet not allowing bottocks to contact floor.platform higher.hip of elevated leg straight afterhip raise phase.",
"dynamic stabilizers": "quadriceps",
"antagonist stabilizers": "tibialisanterior, rectusabdominis, obliques",
"stabilizers": "trapeziuslower, trapeziusmiddle, rhomboids, erectorspinae",
"synergists": "latissimusdorsi, popliteus, gracilis, tricepsbrachii, levatorscapulae, pectoralissternal, deltoidposterior, sartorius, gluteusmaximus, teresmajor, adductors, gastrocnemius, pectoralisminor, rhomboids",
"target": "hamstrings"},"ThighsBWHangingLegCurl":{"id": "6",
"exerciseid": "BWHangingLegCurl",
"musclegroup": "Thighs",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Hanging Leg Curl",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lay supine under fixed horizontal bar. Grasp bar with wide overhand grip. Straighten and raise body off of floor keeping heelson floor.",
"execution": "Pull body toward feet by bending knees and hips. Roll onto feet until knees are fully flexed. Return body to original position by extending knees and hips. Repeat.",
"comments": "Positioned bar so back is slightly above floor once grip is established. Keep low back straight, maintaining approximate height from floor throughout movement. Hamstrings seemingly acts as a dynamic stabilizer, since it shortens through knee, while it lengthens through hip. However, net contraction actually appears to occur, since hip flexes only slightly, while knee flexes nearly 100, allowing hamstrings to remain in a mechanically strong position throughout movement. Dorsal flexion of ankle reduces active insufficiency of Gastrocnemius, allowing it to assist in knee flexion. Apart from Sartorius involvement, flexion of hips is largely passive and is accomplished by eccentric contraction of glutes during concentric contraction of hamstrings. Easier Movement can be made easier by positioning feet closer to bar. Harder Movement can be made more challenging by positioning feet further away from bar. Alternatively, hips can be kept straight during knee flexion increasing active insufficiency of hamstrings. Hanging Straight Leg Curl",
"dynamic stabilizers": "quadriceps",
"antagonist stabilizers": "tibialisanterior, rectusabdominis, obliques",
"stabilizers": "trapeziusmiddle, gluteusmaximus, erectorspinae, trapeziuslower, rhomboids",
"synergists": "sartorius, popliteus, gracilis, gastrocnemius",
"target": "hamstrings"},"ThighsBWHangingStraightHipLegCurl":{"id": "7",
"exerciseid": "BWHangingStraightHipLegCurl",
"musclegroup": "Thighs",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Hanging Straight Hip Leg Curl",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lay supine under fixed horizontal bar. Grasp bar with wide overhand grip. Straighten and raise body off of floor keeping heelson floor.",
"execution": "Pull body toward feet by bending knees while keeping hips straight. Roll onto feet until knees are fully flexed. Return body to original position by extending knees. Repeat.",
"comments": "Positioned bar so back is slightly above floor once grip is established. Keep low back and hips straight throughout movement. With hips fully extended, Hamstrings enter active insufficiency near complete knee flexion. Dorsal flexion of ankle reduces active insufficiency of Gastrocnemius, allowing it to assist in knee flexion. Easier Movement can be made easier by positioning feet closer to bar.Alternatively, hips can be allowed to bend during knee flexion thereby largely avoiding active insufficiency of hamstrings. Hanging Leg Curl Harder Movement can be made more challenging by positioning feet further away from bar.",
"antagonist stabilizers": "tibialisanterior, rectusabdominis, obliques",
"stabilizers": "trapeziusmiddle, gluteusmaximus, erectorspinae, trapeziuslower, rhomboids",
"synergists": "sartorius, popliteus, gracilis, gastrocnemius",
"target": "hamstrings"},"ThighsBWHamstringRaise":{"id": "8",
"exerciseid": "BWHamstringRaise",
"musclegroup": "Thighs",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Inverse Leg Curl",
"utility": "Basic",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Adjust padded supports and kneel upright in apparatus. Position knees on nearupper side of padded hump, ankles between padded supports, and feet on platform. Place arms behind back, across chest, or bent beside head depending on desired intensity.",
"execution": "Lower body until horizontal by straightening knees. Raise body by flexing knees only allowing hips to bend slightly. Repeat.",
"comments": "This is an advanced exercise performed on Glute Ham Raise Apparatus. This movement is also known as Hamstring Raise. Dorsal flexion of ankle reduces active insufficiency of Gastrocnemius allowing it to assist in knee flexion. Also see Inverse Leg Curl comments. Easier Movement is easiest with hands behind hips as shown and when knees are positioned slightly further down on hump. Also consider the GluteHam Raise or performing selfassisted version. Selfassisted Inverse Leg CurlBandassisted Inverse Leg CurlGluteHam Raise Harder Exercise can be made more challenging by placing arms across chest or even harder by placing hands on head or beyond head. See Arm Position During Waist Exercises. Movement is also harder with knees positioned slightly higher on hump. Exercise can also be performed with additional weight. Weighted Inverse Leg CurlBarbell Inverse Leg Curl",
"antagonist stabilizers": "tibialisanterior, quadriceps, rectusabdominis, obliques",
"stabilizers": "erectorspinae, gluteusmaximus, adductors",
"synergists": "sartorius, popliteus, gracilis, gastrocnemius",
"target": "hamstrings"},"ThighsBWBallLegCurl":{"id": "9",
"exerciseid": "BWBallLegCurl",
"musclegroup": "Thighs",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Leg Curl (on stability ball)",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie supine on floor with lower legs on exercise ball. Extended arms out to sides. Straighten low back, knees, and hips, raising back and hips off of floor.",
"execution": "Keeping hips and low back straight, bend knees, pulling heels toward rear end. Allow feet to rollup on to ball. Lower to original position by straightening knees. Repeat.",
"comments": "Keep hips straight throughout movement. Dorsal flexion of ankle reduces active insufficiency of Gastrocnemius allowing it to assist in knee flexion.",
"antagonist stabilizers": "tibialisanterior, rectusabdominis, obliques",
"stabilizers": "gluteusmaximus, erectorspinae",
"synergists": "sartorius, popliteus, gracilis, gastrocnemius",
"target": "hamstrings"},"ThighsBWWheelLegCurl":{"id": "10",
"exerciseid": "BWWheelLegCurl",
"musclegroup": "Thighs",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Leg Curl (on power wheel)",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie supine on floor with feet strapped onto power wheel. Extended arms out to sides. Straighten knees and hips.",
"execution": "Keeping hips and low back straight, bend knees, pulling heels toward rear end. Raise up until lower legs are vertical. Lower to original position by straightening knees. Repeat.",
"comments": "Keep hips straight throughout movement.With hips fully extended, Hamstrings enter active insufficiency near complete knee flexion.Dorsal flexion of ankle reduces active insufficiency of Gastrocnemius, allowing it to assist in knee flexion.",
"antagonist stabilizers": "tibialisanterior, rectusabdominis, obliques",
"stabilizers": "gluteusmaximus, erectorspinae",
"synergists": "sartorius, popliteus, gracilis, gastrocnemius",
"target": "hamstrings"},"ThighsBWSingleLeg45Hyperextension":{"id": "11",
"exerciseid": "BWSingleLeg45Hyperextension",
"musclegroup": "Thighs",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "Hamstrings",
"name": "Single Leg 45° Hyperextension",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"execution": "Raise upper body until hips and waist are fully extended. Lower body by bending hips and waist until fully flexed. Repeat. Continue with opposite leg.",
"comments": "Easier Movement can be made easier by placing arms further down to sides, away from head or performing exercise with both legs. Hyperextension45 Hyperextension Harder Exercise can be made more challenging by placing hands further up on head or beyond head. See Arm Position During Waist Exercises. Exercise can also be performed with additional weight.",
"synergists": "gluteusmaximus, adductors, erectorspinae",
"target": "hamstrings"}}