{"HipsBentoverLungeHipFlexor":{"id": "0",
"exerciseid": "BentoverLungeHipFlexor",
"musclegroup": "Hips",
"equipment": "stretch(iliopsoas)",
"exercisetype": "Stretches",
"muscleclass": "HipFlexors",
"name": "Bent-over Lunging Hip Flexor Stretch",
"preparation": "Kneel down and position one leg extended behind. Balancing with hands positioned on floor to sides. Rear knee is extended off floor. Body weight is supported on both forefeet.",
"execution": "Straighten hip of rear leg by pushing hips down and forward. Hold stretch. Repeat with opposite side.",
"comments": "Gluteus Maximus and Adductor Magnus may be mildly stretched if hip of forward leg is fully flexed. Soleus of opposite leg may be stretched if ankle is fully dorsal flexed.",
"other": "soleus, gluteusmaximus, adductors",
"target": "iliopsoas"},"HipsKneelingHipFlexor":{"id": "1",
"exerciseid": "KneelingHipFlexor",
"musclegroup": "Hips",
"equipment": "stretch(iliopsoas)",
"exercisetype": "Stretches",
"muscleclass": "HipFlexors",
"name": "Kneeling Hip Flexor Stretch",
"preparation": "Lunge forward with knee on padded mat. Position foot beyond forward knee. Place hands on knee.",
"execution": "Straighten hip of rear leg by pushing hips forward. Hold stretch. Repeat with opposite side.",
"comments": "Position foot further beyond knee if stretch is felt in Adductor Magnus of forward thigh.",
"other": "gluteusmaximus, adductors",
"target": "iliopsoas"},"HipsPCHipFlexor":{"id": "2",
"exerciseid": "PCHipFlexor",
"musclegroup": "Hips",
"equipment": "stretch(iliopsoas)",
"exercisetype": "Stretches",
"muscleclass": "HipFlexors",
"name": "Lever Hip Flexor Stretch",
"preparation": "Flip seat all way back. Stand facing bar with supporting foot slightly forward under, or near apparatus. Grasp handle bars for support. Place top of other foot back on top edge of shin pad.",
"execution": "Squat down with back straight while straightening hip of rear leg by pushing hips forward. Hold stretch. Repeat with opposite side.",
"comments": "Keep foot away from fully extended hip to keep emphasis on Iliopsoas. See Lever Quadriceps Stretch for similar movement.",
"other": "soleus, quadriceps",
"target": "iliopsoas"},"HipsLungingHipFlexor":{"id": "3",
"exerciseid": "LungingHipFlexor",
"musclegroup": "Hips",
"equipment": "stretch(iliopsoas)",
"exercisetype": "Stretches",
"muscleclass": "HipFlexors",
"name": "Lunging Hip Flexor Stretch",
"preparation": "Lunge with one foot far behind other foot.",
"execution": "Squat down with chest high, straightening hip of rear leg by pushing hips down and forward. Hold stretch. Repeat with opposite side.",
"comments": "Feet should be far enough apart to keep knee from traveling too far beyond forward foot. Keep torso upright, close to vertical. Keep forward foot flat on floor and rear foot pointed forward. Soleus of opposite leg may be stretched if ankle is fully dorsal flexed.",
"other": "soleus",
"target": "iliopsoas"},"HipsLyingHipFlexor":{"id": "4",
"exerciseid": "LyingHipFlexor",
"musclegroup": "Hips",
"equipment": "stretch(iliopsoas)",
"exercisetype": "Stretches",
"muscleclass": "HipFlexors",
"name": "Lying Hip Flexor Stretch",
"preparation": "Lie on tall bench with thigh hanging down off end or side of bench. Raise opposite thigh toward side of torso. Hook hand around inside of upper thigh. Grasp elbow with opposite hand and keep arms close to body.",
"execution": "Allow lower thigh to drop toward floor. Hold stretch. Repeat with opposite side.",
"comments": "Alternatively, both hands can anchor upper thigh, on hand inside and other on out side of thigh. The leg may also hang from side of bench if body is positioned slightly diagonal. If stretch is not felt, pull upper thigh closer to side of torso with both hands or use taller bench if heal touches floor.",
"other": "gluteusmaximus, adductors",
"target": "iliopsoas"},"HipsSLLungingHipFlexor":{"id": "5",
"exerciseid": "SLLungingHipFlexor",
"musclegroup": "Hips",
"equipment": "stretch(iliopsoas)",
"exercisetype": "Stretches",
"muscleclass": "HipFlexors",
"name": "Sled Kneeling Hip Flexor Stretch",
"preparation": "Straddle machine and grasp handles for support. Place foot on lower platform under podium and other lower leg on padded support behind.",
"execution": "Squeeze release grips and slide padded leg support back until mild stretch is felt. Hold stretch. Repeat with opposite side.",
"comments": "Torso can be bent slightly forward with forearms on padded podium. If padded lower leg support is angled up, Rectus Femoris may also be stretched.",
"target": "iliopsoas"},"HipsStanding":{"id": "6",
"exerciseid": "Standing",
"musclegroup": "Hips",
"equipment": "stretch(iliopsoas)",
"exercisetype": "Stretches",
"muscleclass": "HipFlexors",
"name": "Standing Hip Flexor Stretch",
"preparation": "Stand facing bench or elevated platform, approximately legs length away. Place one foot on bench or platform.",
"execution": "Slowly lunge forward by bending forward leg. With chest high, straighten hip of rear leg by pushing hips forward. Hold stretch. Repeat with opposite side.",
"comments": "Keep torso upright, close to vertical. Soleus of opposite leg may be stretched if foot is positioned forward and ankle is fully dorsal flexed.",
"other": "soleus",
"target": "iliopsoas"}}