{"UpperArmsSTTriDip":{"id": "0",
"exerciseid": "STTriDip",
"musclegroup": "UpperArms",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Suspended Triceps Dip",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between two suspension handles and grasp handles on each side of torso. Hold position firmly and lift feet from floor.",
"execution": "Push body up until arms are straight. Lower body until slight stretch is felt in shoulders. Repeat.",
"comments": "This exercise can be performed on adjustable length gymnastics rings or a dual anchored suspension trainer. To emphasize triceps, position body more upright than demonstrated by positioning hips straighter. Also see Chest Dips. Easier To decrease difficulty, position handles so legs can assist. Selfassisted Suspended Dip Harder Added weight can be placed on dip belt or dumbbell can be placed between ankles to increase intensity.",
"stabilizers": "trapeziuslower",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "latissimusdorsi, pectoralisminor, pectoralisclavicular, deltoidanterior, levatorscapulae, pectoralissternal, rhomboids",
"target": "tricepsbrachii"},"UpperArmsSTSelfAssistedTricepsDip":{"id": "1",
"exerciseid": "STSelfAssistedTricepsDip",
"musclegroup": "UpperArms",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Suspended Self-assisted Triceps Dip",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between two suspension handles, approximately midthigh height. Grasp handles on each side and straighten arms with shoulders above hands. Holding position firmly and place bodyweight on handles. Place toes on floor behind with knees bent and feet back.",
"execution": "Lower body by bending arms back. If necessary, use minimal assistance of lower body to control descent, allowing knees to bend, keeping toes in contact with floor. When slight stretch is felt in chest or shoulders, push body up back up until arms are straight. Repeat with minimal assistance from legs.",
"comments": "If lower body is used for assistance, Quadriceps are utilized. Hips are kept straighter and body more upright, as compared to Assisted Chest Dip. This exercise can be performed on adjustable length gymnastics rings or a dual anchored suspension trainer. Easier Resistance can be reduced by pushing with legs more. Harder Suspended Triceps Dip can be performed with no assistance for greater challenge.",
"stabilizers": "trapeziuslower",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "latissimusdorsi, pectoralisminor, pectoralisclavicular, deltoidanterior, levatorscapulae, pectoralissternal, rhomboids",
"target": "tricepsbrachii"},"UpperArmsSTTricepsExtension":{"id": "2",
"exerciseid": "STTricepsExtension",
"musclegroup": "UpperArms",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Suspended Triceps Extension",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Grasp handles and step forward between suspension trainers. Position arms downward and slightly forward, nearly parallel with suspension straps. Lean forward, placing upper body weight onto handles with arms straight, while stepping back onto forefeet so body is leaning forward at desired angle. Straighten body, so torso is inline with legs.",
"execution": "Lower body by bending elbows, allowing head to travel between suspension handles. Raise body up and back up until arms are extended. Repeat.",
"comments": "Both upper and lower body should be kept straight throughout movement. Angle of body affects difficulty of movement. See Gravity Vectors for greater understanding of how body angle influences resistance. Also see Suspended Triceps Extension with Triceps Rope. This exercise can be performed on TRX style suspension trainer or adjustable length gymnastics rings. Easier Resistance is least when body is positioned upright, at top of exercise. Movement can also be made easier with staggered foot position by placing one foot slightly forward. Harder This movement can be made more challenging by positioning body more horizontal at lowest position. This can be achieved by placing feet further back and having handles positioned further down nearer ground.",
"stabilizers": "latissimusdorsi, pectoralisclavicular, rectusabdominis, wristflexors, serratusanterior, pectoralissternal, deltoidposterior, quadriceps, gastrocnemius, pectoralisminor, teresminor, obliques",
"target": "tricepsbrachii"},"UpperArmsBWSuspendedTricepsExtension":{"id": "3",
"exerciseid": "BWSuspendedTricepsExtension",
"musclegroup": "UpperArms",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Suspended Triceps Extension (with rope)",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Grasp triceps rope hanging from secured bar (chest height or lower). Position forefeet on floor, back from bar with body straight. Elbows can be either be completely bent or straight during mount with upper arms somewhat perpendicular with body.",
"execution": "Keeping body straight, raise body up and back up until arms are extended. Lower body by bending elbows, allowing head to travel between ends of rope. Repeat.",
"comments": "Instead of 1 Triceps Rope (as shown), 2 ab slings or 2 nyloncloth Stirrups with long straps can also be used (see how to loop cable stirrup onto bar) with overhand grip. Both upper and lower body must be kept straight throughout movement. Height of bar affects difficulty of movement. See Gravity Vectors for greater understanding of how body angle influences resistance. Also see Suspended Triceps Extension with Suspension Trainer. Easier Resistance can be reduced by performing exercise on higher bar with feet positioned slightly more forward. Harder Resistance can be increased by lowering bar and positioning feet further back so body is closer to horizontal. with bar slightly lower",
"stabilizers": "latissimusdorsi, pectoralisclavicular, rectusabdominis, wristflexors, serratusanterior, pectoralissternal, wristextensors, deltoidposterior, quadriceps, gastrocnemius, pectoralisminor, teresminor, obliques",
"target": "tricepsbrachii"}}