{"ShouldersLVLyingRearLateralRaise":{"id": "0",
"exerciseid": "LVLyingRearLateralRaise",
"musclegroup": "Shoulders",
"equipment": "lever(selectorized)",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Lever Lying Rear Lateral Raise",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie on machine with chest against padding. Position arms between padded lever arms with elbows below shoulders.",
"execution": "Pull arms up until elbows are beyond back. Lower and repeat.",
"comments": "Upper arm should travel in perpendicular path to torso. At lower portion of exercise, keep elbows pointed outward below shoulders. At upper portion of exercise, keep elbows pointed outward to sides of shoulders. Legs may be kept together, extending off end, or bent straddling bench as demonstrated.",
"stabilizers": "No significant stabilizers",
"synergists": "infraspinatus, trapeziusmiddle, rhomboids, trapeziuslower, teresminor",
"target": "deltoidposterior"},"ShouldersLVRearLateralRaiseOnLatRsMch":{"id": "1",
"exerciseid": "LVRearLateralRaiseOnLatRsMch",
"musclegroup": "Shoulders",
"equipment": "lever(selectorized)",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Lever Rear Lateral Raise (on lateral raise machine)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand on platform facing lateral raise machine. Bend knees and bend over at hips with back flat close to horizontal. With elbows bent under shoulders, position back of upper arms against arm pads.",
"execution": "Maintaining torso position, raise upper arms to sides until elbows are shoulder height. Lower and repeat.",
"comments": "Platform height should allow pivot point of shoulders to be aligned with lever fulcrum. Upper arm should travel in perpendicular path to torso. At lower portion of exercise, keep elbows pointed outward below shoulders. At upper portion of exercise, keep elbows pointed outward to sides of shoulders. Knees are bent in effort to keep low back straight (See Hamstring Inflexibility).",
"stabilizers": "hamstrings, gluteusmaximus, erectorspinae, adductors, quadriceps",
"synergists": "infraspinatus, trapeziusmiddle, rhomboids, trapeziuslower, teresminor",
"target": "deltoidposterior"},"ShouldersLVRearLateralRaiseOnExtArmLatRsMch":{"id": "2",
"exerciseid": "LVRearLateralRaiseOnExtArmLatRsMch",
"musclegroup": "Shoulders",
"equipment": "lever(selectorized)",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Lever Rear Lateral Raise (on extended arm kneeling lateral raise machine)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Stand on platform facing lateral raise machine. Bend knees and bend over at hips with back flat close to horizontal. With arms straight or slightly bent, grasp lever handles with each hand.",
"execution": "Maintaining torso position, raise handles to sides until upper arm is shoulder height. Lower and repeat.",
"comments": "Platform height should allow pivot point of shoulders to be aligned with lever fulcrum. Upper arm should travel in perpendicular path to torso to minimize relatively powerful latissimus dorsi involvement. At top of movement, elbows (not necessarily dumbbells) should be directly lateral to shoulders since elbows are slightly bent forward. To exercise posterior deltoid and not lateral deltoid, keep torso close to horizontal. Positioning torso at 45 is not sufficient angle to target rear deltoids. Knees are bent in effort to keep low back straight (See Hamstring Inflexibility). Apparatus was originally designed to be used for Extended Arm Kneeling Lateral Raise. Also see Rear View Angle.",
"stabilizers": "wristextensors, hamstrings, gluteusmaximus, erectorspinae, adductors, tricepsbrachii",
"synergists": "infraspinatus, trapeziusmiddle, rhomboids, trapeziuslower, teresminor",
"target": "deltoidposterior"},"ShouldersLVRearDeltRow":{"id": "3",
"exerciseid": "LVRearDeltRow",
"musclegroup": "Shoulders",
"equipment": "lever(selectorized)",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Lever Seated Rear Delt Row",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Place seat at low position. Sit on seat with chest against pad and grasp upper handles.",
"execution": "Pull lever with elbows up out to sides until upper arms are just beyond parallel, keeping upper arm horizontal, perpendicular to torso. Return and repeat.",
"comments": "If upper arm travels closer than perpendicular to trunk, latissimus dorsi becomes involved. Elbows should be kept same height as shoulders. Also see exercise performed on alternative lever row machine. Much lighter resistance is required as compared to Lever Seated Row.",
"stabilizers": "deltoidlateral",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "latissimusdorsi, infraspinatus, brachioradialis, brachialis, trapeziusmiddle, trapeziuslower, teresminor, rhomboids",
"target": "deltoidposterior"},"ShouldersLVRearLateralRaise":{"id": "4",
"exerciseid": "LVRearLateralRaise",
"musclegroup": "Shoulders",
"equipment": "lever(selectorized)",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Lever Seated Reverse Fly (parallel grip)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on machine with chest against pad. Grasp parallel handles with thumbs up at shoulder height. Slightly bend elbows and internally rotate shoulders so elbows are also at height of shoulders.",
"execution": "Keeping elbows pointed high, pull handles apart and to rear until elbows are just behind back. Return and repeat.",
"comments": "Keep elbows raised at same height of shoulders to minimize Latissimus Dorsi involvement. Thumbs down grip may be used so shoulders more naturally assume height of shoulders. Some machines allow for a more neutral overhand grip.",
"stabilizers": "wristextensors, tricepsbrachii",
"synergists": "infraspinatus, trapeziusmiddle, deltoidlateral, trapeziuslower, teresminor, rhomboids",
"target": "deltoidposterior"},"ShouldersLVSeatedRearDeltFly":{"id": "5",
"exerciseid": "LVSeatedRearDeltFly",
"musclegroup": "Shoulders",
"equipment": "lever(selectorized)",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Lever Seated Reverse Fly (gripless)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on machine with back against vertical pad and roller pads in front of body. Place feet forward on foot bars. Cross both arms in front of body situated between roller pads. Position arms one on top of another, shoulder height.",
"execution": "Pull arms apart and back until elbows are slightly beyond back. Return to starting position and repeat.",
"comments": "To maintain hips and back against pad during lift, legs must push into foot bar while keeping spine ridged. If apparatus is unavailable, a similar movement can be performed on certain pec deck machines with adequate ranges of motion.",
"stabilizers": "quadriceps, gluteusmaximus, erectorspinae",
"synergists": "infraspinatus, trapeziusmiddle, rhomboids, trapeziuslower, teresminor",
"target": "deltoidposterior"},"ShouldersLVRearDeltFlyGriplessPecDeck":{"id": "6",
"exerciseid": "LVRearDeltFlyGriplessPecDeck",
"musclegroup": "Shoulders",
"equipment": "lever(selectorized)",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Lever Seated Reverse Fly (on pec deck)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on machine with chest against vertical pad. Position arms against padded lever arms at height of shoulders.",
"execution": "Pull arms back until elbows are beyond back. Return and repeat.",
"comments": "Can be performed on certain pec deck machines as shown if their range of motion and design are adequate, although Gripless Lever Seated Reverse Fly machine is typically better suited for this exercise.",
"stabilizers": "No significant stabilizers",
"synergists": "infraspinatus, trapeziusmiddle, rhomboids, trapeziuslower, teresminor",
"target": "deltoidposterior"},"ShouldersLVReverseFlyOverhand":{"id": "7",
"exerciseid": "LVReverseFlyOverhand",
"musclegroup": "Shoulders",
"equipment": "lever(selectorized)",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Lever Seated Reverse Fly (overhand grip)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on machine with chest against pad. Grasp horizontal handles with overhand grip at shoulder height. Internally rotate shoulders so elbows are also at height of shoulders.",
"execution": "Keeping elbows pointed high, pull handles apart and to rear until elbows are just behind back Return and repeat.",
"comments": "Keep elbows raised at same height of shoulders to minimize Latissimus Dorsi involvement. Exercise can also be performed with parallel grip, either with thumbs up or thumbs down positioning.",
"stabilizers": "wristextensors, tricepsbrachii",
"synergists": "infraspinatus, trapeziusmiddle, deltoidlateral, trapeziuslower, teresminor, rhomboids",
"target": "deltoidposterior"},"ShouldersLVReverseFlyPronated":{"id": "8",
"exerciseid": "LVReverseFlyPronated",
"musclegroup": "Shoulders",
"equipment": "lever(selectorized)",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Lever Seated Reverse Fly (pronated parallel grip)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit in machine with chest against pad. Grasp parallel handles from inside with thumbs down at shoulder height.",
"execution": "Keeping elbows pointed high, pull handles apart and to rear until elbows are just behind back. Return and repeat.",
"comments": "Pronated grip will internally rotate shoulders so elbows are kept at height of shoulders. Preventing elbows from dropping below shoulders will minimize Latissimus Dorsi involvement. With thumbs down grip, shoulder must be deliberately internally rotated to keep elbow at proper height. Some machines allow for a more neutral overhand grip.",
"stabilizers": "wristextensors, tricepsbrachii",
"synergists": "infraspinatus, trapeziusmiddle, deltoidlateral, trapeziuslower, teresminor, rhomboids",
"target": "deltoidposterior"}}