{
  "BackAsUnderhandChinupPartner": {
    "id": "0",
    "exerciseid": "AsUnderhandChinupPartner",
    "musclegroup": "Back",
    "equipment": "assisted(partner)",
    "exercisetype": "WeightExercises",
    "muscleclass": "LatissimusDorsi",
    "name": "Partner-assisted Chin-up",
    "utility": "Basic",
    "mechanics": "Compound",
    "force": "Pull",
    "preparation": "Step up and grasp bar with underhand shoulder width grip. Bend knees so partner can assist from behind.",
    "execution": "Pull body up until elbows are to sides or chin is just above bar. Lower body until arms and shoulders are fully extended. Repeat.",
    "comments": "Partner can assist as needed by pulling ankles or top feet up from behind. Also see selfassisted technique.",
    "dynamic stabilizers": "bicepsbrachii, tricepsbrachii",
    "synergists": "levatorscapulae, brachioradialis, pectoralissternal, brachialis, deltoidposterior, trapeziusmiddle, teresmajor, trapeziuslower, pectoralisminor, rhomboids",
    "target": "latissimusdorsi"
  },
  "BackAsChinupPartner": {
    "id": "1",
    "exerciseid": "AsChinupPartner",
    "musclegroup": "Back",
    "equipment": "assisted(partner)",
    "exercisetype": "WeightExercises",
    "muscleclass": "LatissimusDorsi",
    "name": "Partner-assisted Pull-up",
    "utility": "Basic",
    "mechanics": "Compound",
    "force": "Pull",
    "preparation": "Step up and grasp bar with wide overhand grip. Bend knees so partner can assist from behind.",
    "execution": "Pull body up until chin is just above bar. Lower body until arms and shoulders are fully extended. Repeat.",
    "comments": "Partner can assist as needed by pulling ankles or top feet up from behind. Exercise can be used until Pullups can be performed. Range of motion will be compromised if grip is too wide .",
    "dynamic stabilizers": "tricepsbrachii",
    "synergists": "infraspinatus, rhomboids, levatorscapulae, brachioradialis, bicepsbrachii, deltoidposterior, brachialis, trapeziusmiddle, teresmajor, trapeziuslower, pectoralisminor, teresminor",
    "target": "latissimusdorsi"
  },
  "BackAsRearPullupPartner": {
    "id": "2",
    "exerciseid": "AsRearPullupPartner",
    "musclegroup": "Back",
    "equipment": "assisted(partner)",
    "exercisetype": "WeightExercises",
    "muscleclass": "LatissimusDorsi",
    "name": "Partner-assisted Rear Pull-up",
    "utility": "Basic",
    "mechanics": "Compound",
    "force": "Pull",
    "preparation": "Step up and grasp bar with overhand wide grip. Bend knees so partner can assist from behind.",
    "execution": "Pull body up until bar touches back of neck. Lower body until arms and shoulders are fully extended. Repeat.",
    "comments": "Partner can assist as needed by pulling ankles or top feet up from behind. Range of motion will be compromised if grip is too wide.",
    "dynamic stabilizers": "tricepsbrachii",
    "synergists": "levatorscapulae, brachioradialis, pectoralissternal, bicepsbrachii, brachialis, teresmajor, trapeziuslower, pectoralisminor, rhomboids",
    "target": "latissimusdorsi"
  }
}
