{"ShouldersBWHandstandPressBench":{"id": "0",
"exerciseid": "BWHandstandPressBench",
"musclegroup": "Shoulders",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidAnterior",
"name": "Handstand Shoulder Press (between benches)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand facing wall between two benches positioned side by side, slightly apart, and slightly away and perpendicular to wall. Place hands on ends of benches closest to wall. Place forefeet on bench and kick lower body up to handstand position with arms and legs straight. Maintain balance with lower body against wall.",
"execution": "Lower head between ends of benches by bending arms. Push body back up to original position by extending arms. Repeat.",
"comments": "Benches must be secured to prevent sliding on floor. Also, each benches base of support should be under edge of bench where hand is placed to prevent bench toppling under body weight. Falling from an inverted position may result in very serious injury. Also known as Elevated Handstand Pushup. Easier Resistance can be reduced by performing exercise with feet positioned on incline bench in pike position. Alternatively exercises can be performed on floor. As strength improves, hands can be placed on very short elevations such as a book on each side of head. Eventually, progressively taller platforms can be used. Decline Pike PressOn Floor with progressive elevation. Harder For greater challenge, perform exercise without assistance of wall. A spotter may assist initially and progressively offer less assistance over time.",
"stabilizers": "levatorscapulae, trapeziusupper",
"dynamic stabilizers": "bicepsbrachii, tricepsbrachii",
"synergists": "trapeziusmiddle, pectoralisclavicular, tricepsbrachii, deltoidlateral, trapeziuslower, serratusanterior",
"target": "deltoidanterior"},"ShouldersBWPikePress":{"id": "1",
"exerciseid": "BWPikePress",
"musclegroup": "Shoulders",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidAnterior",
"name": "Pike Press",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Kneel on two benches positioned side by side slightly apart at end nearest head. Place hands on ends of benches. With forefeet on opposite ends of bench, raise rear end high up with arms, back, and knees straight. Adjust feet so they are somewhat close to hands while keeping back and legs straight.",
"execution": "Lower head between ends of benches by bending arms. Push body back up to original position by extending arms. Repeat.",
"comments": "Pike Press (for front delts) differs from Pike Pushup (for upper chest) in that, feet are at closer distance to hands so body is more inverted in lowest position. Keep knees and back straight. A slight curve (spinal flexion) is acceptable if hamstrings are tight. Easier Resistance can be reduced by performing exercise on bench or apparatus with hands positioned higher than feet. Keep in mind, this specialized movement may not be necessary since front delts can be utilized somewhat during pushup and dip movements, particularly with elbows positioned inward Decline PushupPushupClose Grip PushupDipsBench Dips Harder For greater challenge, elevate feet. Decline Pike Press (on incline benches)",
"stabilizers": "trapeziusupper, levatorscapulae, tensorfasciaelatae, iliopsoas, sartorius, obliques, rectusabdominis, quadriceps",
"dynamic stabilizers": "bicepsbrachii, tricepsbrachii",
"synergists": "trapeziusmiddle, pectoralisclavicular, tricepsbrachii, deltoidlateral, trapeziuslower, serratusanterior",
"target": "deltoidanterior"},"ShouldersBWDeclinePikePress":{"id": "2",
"exerciseid": "BWDeclinePikePress",
"musclegroup": "Shoulders",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidAnterior",
"name": "Decline Pike Press",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between two incline benches positioned side by side slightly apart at end nearest head. Place hands on ends of benches and straighten arms. Position forefeet on opposite ends of bench. Raise rear end high up with arms, back, and knees straight.",
"execution": "Lower head between ends of benches by bending arms. Push body back up to original position by extending arms. Repeat.",
"comments": "Keep knees and back straight. A slight curve (spinal flexion) is acceptable if hamstrings are tight. Easier Resistance can be reduced by performing exercise on flat bench or apparatus with hands positioned same height as feet. Pike Press (on flat benches) Harder For greater challenge, heighten foot elevation or perform movement with entire body inverted with feet against wall. Handstand Press (between benches)",
"stabilizers": "trapeziusupper, levatorscapulae, tensorfasciaelatae, iliopsoas, sartorius, obliques, rectusabdominis, quadriceps",
"dynamic stabilizers": "bicepsbrachii, tricepsbrachii",
"synergists": "trapeziusmiddle, pectoralisclavicular, tricepsbrachii, deltoidlateral, trapeziuslower, serratusanterior",
"target": "deltoidanterior"}}