{"WaistLVDeadlift":{"id": "0",
"exerciseid": "LVDeadlift",
"musclegroup": "Waist",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Lever Deadlift (plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand in between lever handles. Squat down with feet flat and grasp handles to sides.",
"execution": "Lift lever by extending hips and knees to full extension. Pull shoulders back at top of lift if rounded. Return and repeat.",
"comments": "Target muscle is exercised isometrically. Throughout lift, keep hips low, shoulders high, arms and back straight. Exercise can also be performed facing opposite direction toward fulcrum.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, rhomboids",
"dynamic stabilizers": "hamstrings, gastrocnemius",
"synergists": "quadriceps, soleus, gluteusmaximus, adductors",
"target": "erectorspinae"},"WaistLVStiffLegDeadlift":{"id": "1",
"exerciseid": "LVStiffLegDeadlift",
"musclegroup": "Waist",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Lever Stiff Leg Deadlift (plate loaded)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand between lever handles with shoulder width or narrower stance. Squat down and grasp handles to each side. Stand upright with arms straight down to sides.",
"execution": "Bow forward by bending hips. Bend knees slightly during descent and keep waist straight, flexing low back at bottom. With knees slightly bent, raise torso by extending at waist, then hips, gradually extending knees until standing upright. Pull shoulders back slightly if rounded. Repeat.",
"comments": "Lower back may bend slightly during hip flexion phase. Erector Spinae is exercised isometrically if low back does articulate as with Straight Back Stiff Leg Deadlift (targeting Glutes). Begin with light weight and add additional weight gradually to allow adequate adaptation. Throughout lift, keep arms straight. Knee can be kept bent throughout movement. Do not stand behind lever handles. Do not pause or bounce at bottom of lift. Do not lower weight beyond mild stretch throughout hamstrings and back When finished with set, dismount by lowering weight with knees bent and low back straight. Full range of motion will vary from person to person. Those with less flexibility may have to bend knees more or they may not even need to stand on platform. See Dangerous Exercise Essay.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, trapeziusmiddle, levatorscapulae, trapeziuslower, rhomboids, quadriceps",
"synergists": "hamstrings, gluteusmaximus, adductors",
"target": "erectorspinae"},"WaistLVStraightLegDeadlift":{"id": "2",
"exerciseid": "LVStraightLegDeadlift",
"musclegroup": "Waist",
"equipment": "lever(plateloaded)",
"exercisetype": "WeightExercises",
"muscleclass": "ErectorSpinae",
"name": "Lever Straight Leg Deadlift (plate loaded)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand between lever handles with shoulder width or narrower stance. Squat down and grasp handles to each side. Stand upright with arms straight down to sides.",
"execution": "With knees straight, bow forward by bending hips. Bend waist as stirrups approach lowest position. Lift lever by extending hips and waist until standing upright. Pull shoulders back slightly if rounded. Repeat.",
"comments": "Begin with very light weight and add additional weight gradually to allow lower back adequate adaptation. Throughout lift, keep arms and knees straight. Do not stand behind pulleys. Do not pause or bounce at bottom of lift. Lower back may bend slightly during full hip flexion phase. Do not lower weight beyond mild stretch throughout hamstrings and low back. Full range of motion will vary from person to person depending on flexibility. See Dangerous Exercise Essay. Also see Straight Back Straight Leg Deadlift.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "latissimusdorsi, trapeziusupper, trapeziusmiddle, levatorscapulae, trapeziuslower, rhomboids",
"synergists": "hamstrings, gluteusmaximus, adductors",
"target": "erectorspinae"}}