{"UpperArmsDBKickback":{"id": "0",
"exerciseid": "DBKickback",
"musclegroup": "UpperArms",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Dumbbell Kickback",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Kneel over bench with arm supporting body. Grasp dumbbell. Position upper arm parallel to floor.",
"execution": "Extend arm until it is straight. Return and repeat. Continue with opposite arm.",
"comments": "For greater range of motion, upper arm can be positioned with elbow slightly higher than shoulder. Also see Triceps Kickback Errors.",
"stabilizers": "latissimusdorsi, wristextensors, deltoidposterior, trapeziusmiddle, trapeziuslower, wristflexors, rhomboids",
"synergists": "None",
"target": "tricepsbrachii"},"UpperArmsDBLyingTriExt":{"id": "1",
"exerciseid": "DBLyingTriExt",
"musclegroup": "UpperArms",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Dumbbell Lying Triceps Extension",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Lie on bench and position dumbbells over head with arms extended.",
"execution": "Lower dumbbells by bending elbow until they are to sides of head. Extend arm. Repeat.",
"comments": "With arms fully extended, dumbbells can be brought to upper chest between repetitions as needed to allow for relative release of tension in muscles.",
"stabilizers": "latissimusdorsi, pectoralisclavicular, wristflexors, pectoralissternal, wristextensors, deltoidposterior, teresmajor, deltoidanterior",
"synergists": "None",
"target": "tricepsbrachii"},"UpperArmsDBDeclineTriExt":{"id": "2",
"exerciseid": "DBDeclineTriExt",
"musclegroup": "UpperArms",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Dumbbell Decline Triceps Extension",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Lie on decline bench and position dumbbells over shoulders with arms extended.",
"execution": "Lower dumbbells by bending elbow until they are to sides of head dumbbells touch shoulder. Extend arm. Repeat.",
"comments": "Keep elbows pointed up or just slightly back throughout movement.",
"stabilizers": "latissimusdorsi, wristextensors, deltoidposterior, teresmajor, deltoidanterior, wristflexors, pectoralissternal",
"synergists": "None",
"target": "tricepsbrachii"},"UpperArmsDBInclineTricepsExt":{"id": "3",
"exerciseid": "DBInclineTricepsExt",
"musclegroup": "UpperArms",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Dumbbell Incline Triceps Extension",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Lie supine on incline bench with back of head on upper corner of bench. Position dumbbells over head with arms extended.",
"execution": "Lower dumbbells by bending elbow until they are to sides of head. Extend arm and repeat.",
"comments": "Movement can also be performed on old fashioned incline bench without seat.",
"stabilizers": "latissimusdorsi, pectoralisclavicular, wristflexors, pectoralissternal, wristextensors, deltoidposterior, teresmajor, deltoidanterior",
"synergists": "None",
"target": "tricepsbrachii"},"UpperArmsDBOneArmTriExt":{"id": "4",
"exerciseid": "DBOneArmTriExt",
"musclegroup": "UpperArms",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Dumbbell One Arm Triceps Extension",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Sit on seat with back support just below shoulder height. Position dumbbell over head with arm straight up or slightly back.",
"execution": "Lower dumbbell behind neck or shoulder while maintaining upper arms vertical position throughout exercise. Extend arm until straight. Return and repeat. Continue with opposite arm.",
"comments": "Let dumbbell pull back arm slightly to maintain full shoulder flexion. Keep elbow in so movement does not turn into overhead press. Back support sho uld not be so high that it interferes with dumbbell being completely lowered (i.e. full range of motion). See rear view. Exercise may be performed on bench without back support.",
"stabilizers": "wristextensors, wristflexors",
"synergists": "None",
"target": "tricepsbrachii"},"UpperArmsDBOneArmTriExtBench":{"id": "5",
"exerciseid": "DBOneArmTriExtBench",
"musclegroup": "UpperArms",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Dumbbell One Arm Triceps Extension (on bench)",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Position dumbbell behind neck with elbow positioned upward.",
"execution": "Extend arm until straight while maintaining upper arms vertical position throughout exercise. Return until dumbbell is behind neck or shoulder and repeat. Continue with opposite arm.",
"comments": "Let dumbbell pull back arm to maintain full shoulder flexion. Consider using seat with back support.",
"stabilizers": "wristextensors, wristflexors",
"synergists": "None",
"target": "tricepsbrachii"},"UpperArmsDBTriExt":{"id": "6",
"exerciseid": "DBTriExt",
"musclegroup": "UpperArms",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Triceps",
"name": "Dumbbell Triceps Extension",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Position one dumbbell over head with both hands under inner plate (heart shaped grip).",
"execution": "With elbows over head, lower forearm behind upper arm by flexing elbows. Flex wrists at bottom to avoid hitting dumbbell on back of neck. Raise dumbbell over head by extending elbows while hyperextending wrists. Return and repeat.",
"comments": "Position wrists closer together to keep elbows from pointing out too much. Let dumbbell pull back arm to maintain full shoulder flexion. Consider using seat with back support as illustrated. Back support should not be so high that it interferes with dumbbell being completely lowered (i.e. full range of motion). If shoulder flexion flexibility is not adequate, position hips slightly forward (as illustrated) so elbows are positioned upward. Position body more upright if shoulder flexion flexibility is adequate. See suggested mount  dismount.",
"stabilizers": "wristflexors, pectoralisclavicular, deltoidanterior",
"synergists": "None",
"target": "tricepsbrachii"}}