{
  "ThighsDBLunge": {
    "id": "0",
    "exerciseid": "DBLunge",
    "musclegroup": "Thighs",
    "equipment": "dumbbell",
    "exercisetype": "WeightExercises",
    "muscleclass": "Quadriceps",
    "name": "Dumbbell Lunge",
    "utility": "Auxiliary",
    "mechanics": "Compound",
    "force": "Push",
    "preparation": "Stand with dumbbells grasped to sides.",
    "execution": "Lunge forward with first leg. Land on heel, then forefoot. Lower body by flexing knee and hip of front leg until knee of rear leg is almost in contact with floor. Return to original standing position by forcibly extending hip and knee of forward leg. Repeat by alternating lunge with opposite leg.",
    "comments": "Keep torso upright during lunge flexible hip flexors are important. Lead knee should point same direction as foot throughout lunge. A long lunge emphasizes Gluteus Maximus short lunge emphasizes Quadriceps.",
    "stabilizers": "trapeziusupper, levatorscapulae, tibialisanterior, gluteusmedius, gluteusminimus, quadratuslumborum, erectorspinae, trapeziuslower, obliques",
    "dynamic stabilizers": "hamstrings, gastrocnemius",
    "synergists": "soleus, gluteusmaximus, adductors",
    "target": "quadriceps"
  },
  "ThighsDBSideLunge": {
    "id": "1",
    "exerciseid": "DBSideLunge",
    "musclegroup": "Thighs",
    "equipment": "dumbbell",
    "exercisetype": "WeightExercises",
    "muscleclass": "Quadriceps",
    "name": "Dumbbell Alternating Side Lunge",
    "utility": "Auxiliary",
    "mechanics": "Compound",
    "force": "Push",
    "preparation": "Stand with dumbbells grasped to sides.",
    "execution": "Lunge to one side with first leg. Position closest dumbbell behind thigh and opposite dumbbell to front. Land on heel, then forefoot. Lower body by flexing knee and hip of lead leg, keeping knee pointed same direction of foot. Return to original standing position by forcibly extending hip and knee of lead leg. Repeat by alternating lunge with opposite leg.",
    "comments": "Keep torso upright during lunge. Flexible hip adductors will allow fuller range of motion. Forward knee should point same direction as foot throughout lunge. A long lunge emphasizes Gluteus Maximus short lunge emphasizes Quadriceps. Dumbbells may be positioned  one to front and other to back.",
    "stabilizers": "trapeziusupper, levatorscapulae, tibialisanterior, gluteusmedius, trapeziusmiddle, gluteusminimus, quadratuslumborum, erectorspinae, obliques",
    "dynamic stabilizers": "hamstrings, gastrocnemius",
    "synergists": "soleus, gluteusmaximus, adductors",
    "target": "quadriceps"
  },
  "ThighsDBRearLunge": {
    "id": "2",
    "exerciseid": "DBRearLunge",
    "musclegroup": "Thighs",
    "equipment": "dumbbell",
    "exercisetype": "WeightExercises",
    "muscleclass": "Quadriceps",
    "name": "Dumbbell Rear Lunge",
    "utility": "Auxiliary",
    "mechanics": "Compound",
    "force": "Push",
    "preparation": "Stand with dumbbells grasped to sides.",
    "execution": "Step back with one leg while bending supporting leg. Plant forefoot far back on floor. Lower body by flexing knee and hip of supporting leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward supporting leg and return rear leg next to supporting leg. Repeat movement with opposite legs alternating between sides.",
    "comments": "Keep torso upright during lunge flexible hip flexors are important. Forward knee should point same direction as foot throughout lunge. A long lunge emphasizes Gluteus Maximus short lunge emphasizes Quadriceps.",
    "stabilizers": "trapeziusupper, levatorscapulae, gluteusmedius, gluteusminimus, quadratuslumborum, erectorspinae, trapeziuslower, obliques",
    "dynamic stabilizers": "hamstrings, gastrocnemius",
    "synergists": "soleus, gluteusmaximus, adductors",
    "target": "quadriceps"
  },
  "ThighsDBSideLunge2": {
    "id": "3",
    "exerciseid": "DBSideLunge2",
    "musclegroup": "Thighs",
    "equipment": "dumbbell",
    "exercisetype": "WeightExercises",
    "muscleclass": "GluteusMaximus",
    "name": "Dumbbell Side Lunge",
    "utility": "Auxiliary",
    "mechanics": "Compound",
    "force": "Push",
    "preparation": "Stand with dumbbells grasped to sides.",
    "execution": "Lunge to one side with first leg. Position closest dumbbell behind thigh and opposite dumbbell to front. Land on heel then forefoot. Lower body by flexing knee and hip of lead leg, keeping knee pointed same direction of foot. Return to original standing position by forcibly extending hip and knee of lead leg. Repeat by alternating lunge with opposite leg.",
    "comments": "Keep torso upright during lunge. Flexible hip adductors will allow fuller range of motion. Lead knee should point same direction as foot throughout lunge. A long lunge emphasizes Gluteus Maximus short lunge emphasizes Quadriceps. Dumbbells may be positioned  one to front and other to back.",
    "stabilizers": "trapeziusupper, trapeziusmiddle, gluteusminimus, erectorspinae, levatorscapulae, tibialisanterior, gluteusmedius",
    "dynamic stabilizers": "hamstrings, gastrocnemius",
    "synergists": "soleus, adductors, quadriceps",
    "target": "gluteusmaximus"
  },
  "ThighsDBWalkingLunge": {
    "id": "4",
    "exerciseid": "DBWalkingLunge",
    "musclegroup": "Thighs",
    "equipment": "dumbbell",
    "exercisetype": "WeightExercises",
    "muscleclass": "Quadriceps",
    "name": "Dumbbell Walking Lunge",
    "utility": "Auxiliary",
    "mechanics": "Compound",
    "force": "Push",
    "preparation": "Stand with dumbbells grasped to sides.",
    "execution": "Step forward with first leg. Land on heel, then forefoot. Lower body by flexing knee and hip of front leg until knee of rear leg is almost in contact with floor. Stand on forward leg with assistance of rear leg. Lunge forward with opposite leg. Repeat by alternating lunge with opposite legs.",
    "comments": "Keep torso upright during lunge flexible hip flexors are important. Lead knee should point same direction as foot throughout lunge. A long lunge emphasizes Gluteus Maximus short lunge emphasizes Quadriceps. Tibialis Anterior is exercised eccentrically during landing on heel.",
    "stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, tibialisanterior, gluteusmedius, obliques",
    "dynamic stabilizers": "hamstrings, gastrocnemius",
    "synergists": "soleus, gluteusmaximus, adductors",
    "target": "quadriceps"
  },
  "ThighsDBSingleLegSplitSquat": {
    "id": "5",
    "exerciseid": "DBSingleLegSplitSquat",
    "musclegroup": "Thighs",
    "equipment": "dumbbell",
    "exercisetype": "WeightExercises",
    "muscleclass": "Quadriceps",
    "name": "Dumbbell Single Leg Split Squat",
    "utility": "Auxiliary",
    "mechanics": "Compound",
    "force": "Push",
    "preparation": "Stand with dumbbells grasped to sides facing away from bench. Extend leg back and place top of foot on bench.",
    "execution": "Squat down by flexing knee and hip of front leg until knee of rear leg is almost in contact with floor. Return to original standing position by extending hip and knee of forward leg and repeat. Continue with opposite leg.",
    "comments": "Keep torso upright during squat flexible hip flexors are important. Forward knee should point same direction as foot throughout movement. May also be referred to as Dumbbell Bulgarian Squat.",
    "stabilizers": "gluteusmedius, gluteusminimus",
    "dynamic stabilizers": "hamstrings, gastrocnemius",
    "synergists": "soleus, gluteusmaximus, adductors",
    "target": "quadriceps"
  },
  "ThighsDBSingleLegSquat": {
    "id": "6",
    "exerciseid": "DBSingleLegSquat",
    "musclegroup": "Thighs",
    "equipment": "dumbbell",
    "exercisetype": "WeightExercises",
    "muscleclass": "Quadriceps",
    "name": "Dumbbell Single Leg Squat",
    "utility": "Auxiliary",
    "mechanics": "Compound",
    "force": "Push",
    "preparation": "Stand with dumbbells grasped to sides. Balance on one leg with opposite leg extended straight leg forward as high as possible.",
    "execution": "Squat down as far as possible while keeping leg elevated off of floor. Keep supporting knee pointed same direction as foot supporting. Raise body back up to original position until knee and hip of supporting leg is straight. Return and repeat. Continue with opposite leg.",
    "comments": "Supporting knee should point same direction as foot throughout movement. Range of motion will be improved with greater leg strength and glute flexibility. Significant spinal flexion occurs at bottom of deep single leg squat to maintain center of gravity over foot. Erector Spinae becomes a stabilizer if spine is kept straight. An easier alternative style is to cross lower leg above knee of supporting leg or wrap one foot around back of supporting leg.",
    "stabilizers": "gluteusmedius, tensorfasciaelatae, iliopsoas, sartorius, gluteusminimus, quadratuslumborum, pectineus, quadriceps, rectusabdominis, obliques",
    "dynamic stabilizers": "hamstrings, gastrocnemius",
    "synergists": "erectorspinae, soleus, gluteusmaximus, adductors",
    "target": "quadriceps"
  },
  "ThighsDBSplitSquat": {
    "id": "7",
    "exerciseid": "DBSplitSquat",
    "musclegroup": "Thighs",
    "equipment": "dumbbell",
    "exercisetype": "WeightExercises",
    "muscleclass": "Quadriceps",
    "name": "Dumbbell Split Squat",
    "utility": "Auxiliary",
    "mechanics": "Compound",
    "force": "Push",
    "preparation": "Stand with dumbbells grasped to sides. Position feet far apart one foot forward and other foot behind.",
    "execution": "Squat down by flexing knee and hip of front leg. Allow heel of rear foot to rise up while knee of rear leg bends slightly until it almost makes contact with floor. Return to original standing position by extending hip and knee of forward leg. Repeat. Continue with opposite leg.",
    "comments": "Knees should point same direction as feet throughout movement. Heel of rear foot can be kept elevated off floor throughout movement as shown. Keep torso upright during squat flexible hip flexors are important. With feet further apart Gluteus Maximus is emphasized, Quadriceps are less emphasized.",
    "stabilizers": "gluteusmedius, gluteusminimus, erectorspinae",
    "dynamic stabilizers": "hamstrings, gastrocnemius",
    "synergists": "soleus, gluteusmaximus, adductors",
    "target": "quadriceps"
  },
  "ThighsDBSquat": {
    "id": "8",
    "exerciseid": "DBSquat",
    "musclegroup": "Thighs",
    "equipment": "dumbbell",
    "exercisetype": "WeightExercises",
    "muscleclass": "Quadriceps",
    "name": "Dumbbell Squat",
    "utility": "Basic or Auxiliary",
    "mechanics": "Compound",
    "force": "Push",
    "preparation": "Stand with dumbbells grasped to sides.",
    "execution": "Squat down by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Extend knees and hips until legs are straight. Return and repeat.",
    "comments": "Keep head facing forward, back straight, chest high, arms straight to sides, and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis.",
    "antagonist stabilizers": "rectusabdominis, obliques",
    "stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, erectorspinae",
    "dynamic stabilizers": "hamstrings, gastrocnemius",
    "synergists": "soleus, gluteusmaximus, adductors",
    "target": "quadriceps"
  },
  "ThighsDBFrontSquat": {
    "id": "9",
    "exerciseid": "DBFrontSquat",
    "musclegroup": "Thighs",
    "equipment": "dumbbell",
    "exercisetype": "WeightExercises",
    "muscleclass": "Quadriceps",
    "name": "Dumbbell Front Squat",
    "utility": "Basic or Auxiliary",
    "mechanics": "Compound",
    "force": "Push",
    "preparation": "Stand with dumbbells grasped to sides. Clean dumbbells up to shoulders so side of each dumbbell rests on top of each shoulder. Balance dumbbells on shoulder by holding on to dumbbells with elbows flaring outward.Position feet shoulder width or slightly narrower apart.",
    "execution": "Squat down by bending hips back while allowing knees to bend forward, keeping back straight and knees pointed same direction as feet. Descend until thighs are just past parallel to floor. Extend knees and hips until legs are straight. Return and repeat.",
    "comments": "Keep head facing forward, back straight, chest high, and feet flat on floor equal distribution of weight through forefoot and heel. Knees should point same direction as feet throughout movement. See Squat Analysis. Also see Kettlebell Front Squat.",
    "antagonist stabilizers": "rectusabdominis, obliques",
    "stabilizers": "levatorscapulae, trapeziusupper, trapeziusmiddle, erectorspinae",
    "dynamic stabilizers": "hamstrings, gastrocnemius",
    "synergists": "soleus, gluteusmaximus, adductors",
    "target": "quadriceps"
  },
  "ThighsDBStepUp": {
    "id": "10",
    "exerciseid": "DBStepUp",
    "musclegroup": "Thighs",
    "equipment": "dumbbell",
    "exercisetype": "WeightExercises",
    "muscleclass": "Quadriceps",
    "name": "Dumbbell Step-up",
    "utility": "Basic or Auxiliary",
    "mechanics": "Compound",
    "force": "Push",
    "preparation": "Stand with dumbbells grasped to sides facing side of bench.",
    "execution": "Place foot of first leg on bench. Stand on bench by extending hip and knee of first leg and place foot of second leg on bench. Step down with second leg by flexing hip and knee of first leg. Return to original standing position by placing foot of first leg to floor. Repeat first step with opposite leg alternating first steps between legs.",
    "comments": "Keep torso upright during exercise. Lead knee should point same direction as foot throughout movement. Stepping distance from bench emphasizes Gluteus Maximus stepping close to bench emphasizes Quadriceps.",
    "antagonist stabilizers": "rectusabdominis, obliques",
    "stabilizers": "trapeziusupper, levatorscapulae, gluteusmedius, trapeziusmiddle, gluteusminimus, quadratuslumborum, erectorspinae, obliques",
    "dynamic stabilizers": "hamstrings, gastrocnemius",
    "synergists": "soleus, gastrocnemius, gluteusmaximus, adductors",
    "target": "quadriceps"
  },
  "ThighsDBLateralStepUp": {
    "id": "11",
    "exerciseid": "DBLateralStepUp",
    "musclegroup": "Thighs",
    "equipment": "dumbbell",
    "exercisetype": "WeightExercises",
    "muscleclass": "Quadriceps",
    "name": "Dumbbell Lateral Step-up",
    "utility": "Auxiliary",
    "mechanics": "Compound",
    "force": "Push",
    "preparation": "Stand between two benches, one to each side. Hold dumbbells in each hand down to sides",
    "execution": "Lift leg and place foot on bench to side slightly forward of straight knee. Stand on bench by straightening leg and pushing body upward. Step down returning feet to original position. Repeat with opposite leg alternating between legs.",
    "comments": "Keep torso upright during exercise. Stepping knee should point same direction as foot. A modest degree of knee rotation occurs during this movement. See Controversial Exercises and Rotary Force in Squat Analysis.",
    "antagonist stabilizers": "rectusabdominis, obliques",
    "stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, obliques",
    "dynamic stabilizers": "hamstrings, gastrocnemius",
    "synergists": "soleus, gastrocnemius, gluteusmaximus, adductors",
    "target": "quadriceps"
  },
  "ThighsDBStepDown": {
    "id": "12",
    "exerciseid": "DBStepDown",
    "musclegroup": "Thighs",
    "equipment": "dumbbell",
    "exercisetype": "WeightExercises",
    "muscleclass": "Quadriceps",
    "name": "Dumbbell Step Down",
    "utility": "Auxiliary",
    "mechanics": "Compound",
    "force": "Push",
    "preparation": "Hold dumbbells in each hand down to sides and stand with one foot on bench. Position foot on bench to side slightly forward of straight knee.",
    "execution": "Stand on bench by straightening leg and pushing body upward. Step down returning foot off of bench to floor and repeat. Continue with opposite position.",
    "comments": "Keep torso upright during exercise. Knee of exercised leg should point same direction as foot. Exercise can also be performed by placing traveling foot onto and off of bench next to foot of exercised leg. See alternative form.",
    "antagonist stabilizers": "rectusabdominis, obliques",
    "stabilizers": "gluteusminimus, quadratuslumborum, erectorspinae, gluteusmedius, obliques",
    "dynamic stabilizers": "hamstrings, gastrocnemius",
    "synergists": "soleus, gastrocnemius, gluteusmaximus, adductors",
    "target": "quadriceps"
  }
}
