{"ChestSTSelfAssistedChestDip":{"id": "0",
"exerciseid": "STSelfAssistedChestDip",
"musclegroup": "Chest",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Suspended Self-assisted Chest Dip",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between two suspension handles, approximately midthigh height. Grasp handles on each side and straighten arms with shoulders above hands. Hold position firmly and place portion of body weight on handles.",
"execution": "Lower body by bending arms back. If necessary, use minimal assistance of lower body to control descent, allowing knees to bend, keeping feet in contact with floor. When slight stretch is felt in chest or shoulders, push body up back up until arms are straight. Repeat with minimal assistance from legs.",
"comments": "If lower body is used for assistance, Quadriceps are utilized. Hips are kept straighter and body more upright, as compared to Assisted Triceps Dip. This exercise can be performed on adjustable length gymnastics rings or a dual anchored suspension trainer. Easier Resistance can be reduced by pushing with legs more. Harder Suspended Chest Dip can be performed with no assistance for greater challenge.",
"stabilizers": "trapeziuslower",
"synergists": "latissimusdorsi, pectoralisclavicular, tricepsbrachii, levatorscapulae, teresmajor, deltoidanterior, pectoralisminor, rhomboids",
"target": "pectoralissternal"},"ChestSTChestPress":{"id": "1",
"exerciseid": "STChestPress",
"musclegroup": "Chest",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Suspended Chest Press",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Grasp handles and step forward between suspension trainers. Position arms downward and slightly forward, nearly parallel with suspension straps. Lean forward, placing upper body weight onto handles with arms straight, while stepping back onto forefeet so body is leaning forward at desired angle. Straighten body so torso is inline with legs.",
"execution": "Lower body by bending arms while keeping body straight. Allow handles to come apart slightly to keep inline with elbows flaring out. Stop descent once mild stretch is felt through shoulders or chest. Push body up to original position, allowing handles to travel inward to keep in line with elbows converging until arms are fully extended. Repeat.",
"comments": "See Suspended Chest Press MountDismount . Arms and suspension straps should be perpendicular to body. Both upper and lower body must be kept straight throughout movement. Elbows largely remain behind hands line of force. See side view. Angle of body affects difficulty of movement. See Gravity Vectors for greater understanding of body angle influences resistance. This exercise can be performed on TRX style suspension trainer or adjustable length gymnastics rings. Easier Resistance is least when body is positioned upright, at top of exercise. Movement can also be made easier with staggered foot position by placing one foot slightly forward. Harder This movement can be made more challenging by positioning body more horizontal at lowest position. This can be achieved by placing feet further back and having handles positioned further down nearer ground andor placing feet on elevated platform.",
"antagonist stabilizers": "erectorspinae",
"stabilizers": "pectoralisminor, soleus, gastrocnemius, quadriceps, serratusanterior, rectusabdominis, obliques",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "tricepsbrachii, pectoralisclavicular, deltoidanterior",
"target": "pectoralissternal"},"ChestSTChestDip":{"id": "2",
"exerciseid": "STChestDip",
"musclegroup": "Chest",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Suspended Chest Dip",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between two suspension handles and grasp handles on each side of torso. Hold position firmly and lift feet from floor.",
"execution": "Push body up until arms are straight. Lower body until slight stretch is felt in shoulders. Repeat.",
"comments": "To emphasize chest, position body bent over by bending hips. Also see Triceps Dips. This exercise can be performed on adjustable length gymnastics rings or a dual anchored suspension trainer. Easier To decrease difficulty, position handles so legs can assist. Selfassisted Suspended Dip Harder Added weight can be placed on dip belt or dumbbell can be placed between ankles to increase intensity.",
"stabilizers": "trapeziuslower",
"synergists": "latissimusdorsi, pectoralisclavicular, tricepsbrachii, levatorscapulae, teresmajor, deltoidanterior, pectoralisminor, rhomboids",
"target": "pectoralissternal"},"ChestSTFly":{"id": "3",
"exerciseid": "STFly",
"musclegroup": "Chest",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Suspended Fly",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Grasp handles and step forward between suspension trainer. Position arms downward and slightly forward, nearly parallel with suspension straps. Lean forward, placing upper body weight onto handles with arms straight, while stepping back onto forefeet, so body is leaning forward at desired angle. Straighten body so torso is inline with legs. Bend elbows slightly and internally rotate shoulders, so elbows are pointed outward to each side.",
"execution": "Lower body by allowing suspension handles to separate outward until mild stretch is felt in chest. Reverse motion by bringing handles back together in hugging motion. Repeat.",
"comments": "See Suspended Prone MountDismount. Throughout movement, keep elbows in fixed, slightly bent position and shoulders internally rotated, so elbows are kept pointed outward and high. Arms and suspension straps plane of motion should be perpendicular to body. Both upper and lower body must be kept straight throughout movement. Angle of body affects difficulty of movement. See Gravity Vectors for greater understanding of how body angle influences resistance. This exercise can be performed on TRX style suspension trainer or adjustable length gymnastics rings. Also known as Suspended Chest Fly. See front angled view. Easier Resistance is least when body is positioned upright, at top of exercise. Movement can also be made easier with staggered foot position by placing one foot slightly forward. Elbows can also become slightly more bent as arms extend further out to sides. Harder This movement can be made more challenging by positioning body more horizontal at lower position. This can be achieved by placing feet further back and having handles positioned further down nearer ground. Elbows can be kept somewhat straighter, particularly as arms extend further out to sides.",
"antagonist stabilizers": "erectorspinae",
"stabilizers": "tricepsbrachii, rectusabdominis, wristflexors, serratusanterior, bicepsbrachii, brachialis, soleus, obliques, gastrocnemius, pectoralisminor, quadriceps",
"synergists": "bicepsbrachii, pectoralisclavicular, deltoidanterior",
"target": "pectoralissternal"}}