{"ShouldersBWRearDeltInvertedRow":{"id": "0",
"exerciseid": "BWRearDeltInvertedRow",
"musclegroup": "Shoulders",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Rear Delt Inverted Row",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand facing waist to lower chest height horizontal bar. Grasp bar with wide overhand grip. Turn elbows outward to sides. Walk forward under bar while pulling upper chest close to bar. With heels on floor, position body at angle under bar with legs, hips and spine straight. Position forearms perpendicular to body, orientated forward. Also, position upper arms perpendicular to body, orientated to each side.",
"execution": "Lower body downward until arms are extended straight while keeping body straight and elbows high (upper arm perpendicular to torso). Pull body toward bar until upper arms are just beyond parallel to one another. Return and repeat.",
"comments": "If elbows fall so upper arms no longer travels perpendicular to trunk, Latissimus Dorsi becomes involved. Elbows should be positioned directly lateral to shoulders at highest position. Pulling bar to lower chest is not sufficient angle to target rear deltoids. A higher bar (ie lighter resistance) is required than what is required on Inverted Row. Bar height can be adjusted to vary resistance. See Gravity Vectors for greater understanding of how body angle influences resistance. Also known as Body Row or Supine Row. Easier Resistance can be reduced by using higher bar or pivoting on hips with lower bar. High BarOn Hips Harder Lowering bar so body is closer to floor will make exercise more challenging.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "hamstrings, gluteusmaximus, deltoidlateral, erectorspinae",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "brachialis, infraspinatus, trapeziusmiddle, rhomboids, trapeziuslower, brachioradialis, teresminor",
"target": "deltoidposterior"},"ShouldersBWRearDeltInvertedRowHigh":{"id": "1",
"exerciseid": "BWRearDeltInvertedRowHigh",
"musclegroup": "Shoulders",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Rear Delt Inverted Row (high bar)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand facing lower to upper chest height horizontal bar. Step toward bar so chest makes contact. Grasp bar with wide overhand grip. Turn elbows outward to sides. Position feet forward on floor so body is reclined back with legs, hips and spine straight. Position forearms perpendicular to body, orientated forward. Also, position upper arms perpendicular to body, orientated to each side.",
"execution": "Lower body back until arms are extended straight while keeping body straight and elbows high (upper arm perpendicular to torso). Pull body toward bar until upper arms are just beyond parallel to one another. Return and repeat.",
"comments": "If elbows fall so upper arms no longer travels perpendicular to trunk, Latissimus Dorsi becomes involved. Elbows should be positioned directly lateral to shoulders at highest position. Pulling bar to lower chest is not sufficient angle to target rear deltoids. A higher bar (ie lighter resistance) is required than what is required on Inverted Row. Bar height can be adjusted to vary resistance. See Gravity Vectors for greater understanding of how body angle influences resistance. Also known as Body Row or Supine Row. Easier Resistance can be reduced by using bar as high as upper chest height. Also consider performing movement on hips. On Hips Harder Lowering bar so body is closer to floor will make exercise more challenging. Rear Delt Inverted Row (lower bar)",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "hamstrings, gluteusmaximus, deltoidlateral, erectorspinae",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "brachialis, infraspinatus, trapeziusmiddle, rhomboids, trapeziuslower, brachioradialis, teresminor",
"target": "deltoidposterior"},"ShouldersBWRearDeltInvertedRowHips":{"id": "2",
"exerciseid": "BWRearDeltInvertedRowHips",
"musclegroup": "Shoulders",
"equipment": "bodyweight",
"exercisetype": "WeightExercises",
"muscleclass": "DeltoidPosterior",
"name": "Rear Delt Inverted Row (on hips)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Lay on back with belly under fixed horizontal bar. Bend knees and position feet on floor. Grasp bar with wide overhand grip. Turn elbows outward to sides.",
"execution": "Keeping hips on floor, low back straight, and elbow pointed out to sides pull torso up to bar. Return when upper arms are just beyond parallel to one another. Lower body downward until arms are extended straight. Return and repeat.",
"comments": "If elbows fall so upper arms no longer travels perpendicular to trunk, Latissimus Dorsi becomes involved. Elbows should be positioned directly lateral to shoulders at highest position. Pulling bar to lower chest is not sufficient angle to target rear deltoids. Also known as Rear Delt Body Row on Hips or Rear Delt Supine Row on Hips. Easier Resistance can be reduced by positioning torso at angle with hips further back. Also try straight body version on high bar. High Bar Harder Exercise will be more challenging when performing standard Inverted Row, where entire body is pulled up, pivoting on back of heels. Rear Delt Inverted Row",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "erectorspinae",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "brachialis, infraspinatus, trapeziusmiddle, rhomboids, trapeziuslower, brachioradialis, teresminor",
"target": "deltoidposterior"}}