{"BackSTPullup":{"id": "0",
"exerciseid": "STPullup",
"musclegroup": "Back",
"equipment": "suspension",
"exercisetype": "WeightExercises",
"muscleclass": "LatissimusDorsi",
"name": "Suspended Pull-up",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Grasp high suspension handles.",
"execution": "Pull body up until neck reaches height of hands. Lower body until arms and shoulders are fully extended. Repeat.",
"comments": "This exercise can be performed on adjustable length gymnastics rings or a dual anchored suspension trainer where the handles can be placed a short distance apart. Performing this exercise on a TRX style suspension trainer would require a narrower grip, with the hands closer together. Easier Decrease difficulty by placing feet on bench or floor under bar for self assistance. Suspended Selfassisted Pullup Harder Added weight can be placed on dip belt or dumbbell can be placed between ankles to increase intensity. Also consider pulling body up over handles. Weighted PullupSelfassisted Muscleup",
"dynamic stabilizers": "tricepsbrachii",
"synergists": "levatorscapulae, brachioradialis, pectoralissternal, bicepsbrachii, brachialis, teresmajor, trapeziuslower, pectoralisminor, rhomboids",
"target": "latissimusdorsi"},"BackSTSelfAssistedPullup":{"id": "1",
"exerciseid": "STSelfAssistedPullup",
"musclegroup": "Back",
"equipment": "suspension",
"exercisetype": "WeightExercises",
"muscleclass": "LatissimusDorsi",
"name": "Suspended Self-assisted Pull-up",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Stand facing suspension handles placed at neck height. Grasp handles and position feet forward on floor, slightly in front of handles.",
"execution": "Lower body under handles until arms and shoulders are fully extended. If necessary, use minimal assistance of lower body to control descent, allowing knees and hips to bend, keeping flat on floor. Pull body up until chin is just above handles, again with minimal assistance from legs. Repeat.",
"comments": "If lower body is used for assistance, Hip and Knee Extensors muscles are utilized. Back extensors may be activated minimally as stabilizer through spine. Range of motion will be compromised if handles are too wide apart. This exercise can be performed on adjustable length gymnastics rings or a dual anchored suspension trainer where the handles can be placed a short distance apart. Performing this exercise on a TRX style suspension trainer would require a narrower grip, with the hands closer together. Easier Resistance can be reduced by pushing more with legs. Harder Performing Pullups by gradually relaxing legs until enough strength is developed achieves multiple pullups without assistance. Suspension Pullup",
"dynamic stabilizers": "tricepsbrachii",
"synergists": "infraspinatus, rhomboids, levatorscapulae, brachioradialis, bicepsbrachii, deltoidposterior, brachialis, trapeziusmiddle, teresmajor, trapeziuslower, pectoralisminor, teresminor",
"target": "latissimusdorsi"}}