{"ChestWtPushup":{"id": "0",
"exerciseid": "WtPushup",
"musclegroup": "Chest",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Weighted Push-up",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Lie prone on floor with hands slightly wider than shoulder width. Raise body up off floor by extending arms with body straight. Partner can place weight plate(s) on back if needed.",
"execution": "Keeping body straight, lower body to floor by bending arms. Push body up until arms are extended. Repeat.",
"comments": "Both upper and lower body must be kept straight throughout movement. Exercise can be performed without additional weight. If additional weight is used, partner will need to add and remove weight, and keep weight from sliding off back. See narrower grip pushup.",
"antagonist stabilizers": "erectorspinae",
"stabilizers": "pectoralisminor, quadriceps, serratusanterior, rectusabdominis, obliques",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "tricepsbrachii, pectoralisclavicular, deltoidanterior",
"target": "pectoralissternal"},"ChestWtChestDip":{"id": "1",
"exerciseid": "WtChestDip",
"musclegroup": "Chest",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Weighted Chest Dip",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Place weight on dip belt around waist or place dumbbell between lower legs just above feet. Mount wide dip bar with oblique grip (bar diagonal under palm), arms straight with shoulders above hands. Keep hips and knees bent.",
"execution": "Lower body by bending arms, allowing elbows to flare out to sides. When slight stretch is felt in chest or shoulders, push body up until arms are straight. Repeat.",
"comments": "Added weight can be placed on dip belt or dumbbell can be placed between ankles. Also see Weighted Triceps Dip.",
"stabilizers": "trapeziuslower",
"synergists": "latissimusdorsi, pectoralisclavicular, tricepsbrachii, levatorscapulae, teresmajor, deltoidanterior, pectoralisminor, rhomboids",
"target": "pectoralissternal"},"ChestWtPushupHandles":{"id": "2",
"exerciseid": "WtPushupHandles",
"musclegroup": "Chest",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Weighted Push-up (on handles)",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Kneel before two pushup handles placed slightly wider than shoulder width apart. Grasp both handles and place feet back on floor or slightly elevated platform. Position body straight with arms extended. Partner can place weight plate(s) on back if needed.",
"execution": "Keeping body ridged, lower body downward by bending arms until slight stretch is felt in chest or shoulders. Push body back up until arms are extended. Repeat.",
"comments": "Both upper and lower body must be kept straight throughout movement. Exercise can be performed without additional weight, without handles, or without platform. Platform compensates for height of handles. If platform is too high, upper chest will be emphasized (see Decline Pushup). If additional weight is used, partner will need to add and remove weight, and keep weight from sliding off back.",
"stabilizers": "pectoralisminor, quadriceps, serratusanterior, rectusabdominis, obliques",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "tricepsbrachii, pectoralisclavicular, deltoidanterior",
"target": "pectoralissternal"}}