{"WaistSTTwist":{"id": "0",
"exerciseid": "STTwist",
"musclegroup": "Waist",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Suspended Twist",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp suspension handle(s) with both hands, together with either one hand over other hand or with interlaced fingers. Momentarily step back until arms are extended forward and straight. While keeping arms straight and shoulders back, step forward so body reclines back behind suspension handle(s). Position body and legs straight at desired angle, hanging from handles with arms straight. Feet can be either shoulder width or as wide as desired.",
"execution": "While keeping arms straight and shoulders fixed, rotate torso up to one side. Twist until upright or slight stretch is felt in waist, whichever comes soonest. Rotate back to starting position and repeat. Continue on opposite side.",
"comments": "The exercise can also be mounted from top position in fully rotated position facing perpendicular to suspension straps while positioning feet parallel to straps. Exercise can also be executed by alternating sides, rotating from one side to the other. Dismounting can be achieved either at top of movement when body is fully rotated or hanging at bottom position by walking backward until body is upright. This exercise can be performed on TRX style suspension trainer or adjustable length gymnastics rings. Both arms should be horizontal and straight throughout movement. This movement involves both spinal rotation and hip rotation. Internal Rotation occurs in far hip and External Rotation occurs in near hip. Unlike traditional isolated spinal rotation exercises, movement is limited, rotating from neutral position as opposed from rotating fluidly from one extreme to the other. See Spot Reduction Myth. Easier Resistance is least when body is positioned upright, at top of exercise. Movement can be made easier with staggered foot position by placing near foot (turning side) slightly back. Harder This movement can be made more challenging by placing feet more forward, thereby angling body back at initiation of movement. See Gravity Vectors for greater understanding of how body angle influences resistance.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "pectoralisclavicular, tricepsbrachii, pectoralissternal, deltoidposterior, hamstrings, trapeziusmiddle, gluteusmaximus, deltoidlateral, erectorspinae, trapeziuslower, pectoralisminor, rhomboids",
"synergists": "hipexernalrotators, iliopsoas, gluteusminimus, quadratuslumborum, erectorspinae, tensorfasciaelatae, gluteusmedius",
"target": "obliques"},"WaistSTSideBend":{"id": "1",
"exerciseid": "STSideBend",
"musclegroup": "Waist",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Suspended Side Bend",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp handles, step away, and face body to one side of suspension trainer anchor. Hold handles above head with arms bent. Stand far enough away to make suspension trainer straps taut. Step in just enough to achieve desired lean of body, while keeping tension on suspension trainer straps.",
"execution": "Lower hips away from direction of suspension trainer anchor by laterally flexing spine. Return to original upright position and repeat. Reposition body facing opposite direction. Continue with other side.",
"comments": "Suspension handle(s) can also be gripped with both hands together with either one hand over other hand or with interlaced fingers. In addition to lateral flexion of spine, lower hip abducts and upper hip adducts. Also see Spot Reduction Myth. This exercise can be performed on TRX style suspension trainer or adjustable length gymnastics rings. Easier Resistance is least when body is positioned upright at top of exercise. Harder This movement can be made more challenging by placing feet toward suspension trainer anchor, thereby leaning body more to one side. See Gravity Vectors for greater understanding of how body angle influences resistance.",
"stabilizers": "latissimusdorsi, tricepsbrachii, levatorscapulae, wristflexors, brachioradialis, serratusanterior, bicepsbrachii, brachialis, supraspinatus, trapeziusmiddle, teresmajor, deltoidlateral, deltoidanterior, trapeziuslower, rhomboids",
"synergists": "gracilis, gluteusmedius, tensorfasciaelatae, iliopsoas, gluteusminimus, quadratuslumborum, erectorspinae, pectineus, gluteusmaximus, adductors",
"target": "obliques"},"WaistSTTwist":{"id": "2",
"exerciseid": "STTwist",
"musclegroup": "Waist",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Suspended Twist",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp suspension handle(s) with both hands, together with either one hand over other hand or with interlaced fingers. Momentarily step back until arms are extended forward and straight. While keeping arms straight and shoulders back, step forward so body reclines back behind suspension handle(s). Position body and legs straight at desired angle, hanging from handles with arms straight. Feet can be either shoulder width or as wide as desired.",
"execution": "While keeping arms straight and shoulders fixed, rotate torso up to one side. Twist until upright or slight stretch is felt in waist, whichever comes soonest. Rotate back to starting position and repeat. Continue on opposite side.",
"comments": "The exercise can also be mounted from top position in fully rotated position facing perpendicular to suspension straps while positioning feet parallel to straps. Exercise can also be executed by alternating sides, rotating from one side to the other. Dismounting can be achieved either at top of movement when body is fully rotated or hanging at bottom position by walking backward until body is upright. This exercise can be performed on TRX style suspension trainer or adjustable length gymnastics rings. Both arms should be horizontal and straight throughout movement. This movement involves both spinal rotation and hip rotation. Internal Rotation occurs in far hip and External Rotation occurs in near hip. Unlike traditional isolated spinal rotation exercises, movement is limited, rotating from neutral position as opposed from rotating fluidly from one extreme to the other. See Spot Reduction Myth. Easier Resistance is least when body is positioned upright, at top of exercise. Movement can be made easier with staggered foot position by placing near foot (turning side) slightly back. Harder This movement can be made more challenging by placing feet more forward, thereby angling body back at initiation of movement. See Gravity Vectors for greater understanding of how body angle influences resistance.",
"antagonist stabilizers": "rectusabdominis, obliques",
"stabilizers": "pectoralisclavicular, tricepsbrachii, pectoralissternal, deltoidposterior, hamstrings, trapeziusmiddle, gluteusmaximus, deltoidlateral, erectorspinae, trapeziuslower, pectoralisminor, rhomboids",
"synergists": "hipexernalrotators, iliopsoas, gluteusminimus, quadratuslumborum, erectorspinae, tensorfasciaelatae, gluteusmedius",
"target": "obliques"},"WaistSTTwistingJackknife":{"id": "3",
"exerciseid": "STTwistingJackknife",
"musclegroup": "Waist",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Suspended Twisting Jack-knife",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Sit on floor facing suspension trainer loops in low position. Place right foot in left lower loop. Cross left leg over right leg placed in right lower loop. Turn body to right and place hands on floor, shoulder width apart. Turn body to kneel on hands and knees. Reposition hands (shoulder width or slightly wider) at desired distance from suspension trainer so that body is square with suspension trainer straps. With arms straight, raise knees from ground so body is supported by arms and suspension trainer.",
"execution": "Pull knees toward one elbow by bending hips a nd knees to one side. Twist legs to one side, until hips and knees are completely flexed. Return by extending hips and knees to original straight position. Perform movement to opposite side. Continue by alternating each side.",
"comments": "See Suspended Prone Feet MountDismount. Keep arms straight with shoulders positioned above hands. Dismount by removing straps while kneeling or after sitting on one side of hip, before rotating body to seated position. This exercise can be performed on TRX style suspension trainer. Rectus Abdominis and Obliques only contract dynamically if actual waist flexion occurs. With no waist flexion, Rectus Abdominis and External Oblique act only to stabilize pelvis and waist during hip flexion. It may be necessary to completely flex hips before waist flexion is possible. Also see Spot Reduction Myth and Lower Ab Myth. Easier Movement can be made easier by lying closer under anchor of suspension trainer. Harder Movement can be made more challenging by lying further forward, away horizontally from anchor of suspension trainer.",
"antagonist stabilizers": "trapeziuslower, trapeziusmiddle, rhomboids, erectorspinae",
"dynamic stabilizers": "quadriceps",
"stabilizers": "tricepsbrachii, rectusabdominis, quadriceps, serratusanterior, pectoralissternal, deltoidanterior",
"synergists": "iliopsoas, sartorius, quadratuslumborum, erectorspinae, pectineus, tensorfasciaelatae, adductors",
"target": "obliques"},"WaistSTSideBridge":{"id": "4",
"exerciseid": "STSideBridge",
"musclegroup": "Waist",
"equipment": "suspended",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Suspended Side Bridge",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Sit on floor or mat, facing suspension trainer loops in low position. Grasp bottom of loops, then lay supine. Raise legs and place heels in loops with soles contacting handles. Extend legs out with one leg crossed over other. Turn on side of lower leg so legs are parallel. Place forearm on mat or floor under shoulder perpendicular to body.",
"execution": "Raise hips upward by lateral flexion of spine. Lower to original position and repeat. Reposition to opposite side and continue.",
"comments": "In addition to lateral flexion of spine, lower hip abducts and upper hip adducts. This exercise can be performed on TRX style suspension trainer. More popular suspension trainers allow limited slippage, so loop around lower leg can be positioned below loop of upper leg once on side (as shown). Other models can be adjusted, so strap on lower leg is slightly longer than strap on upper leg. Also see Spot Reduction Myth. Easier Exercise can be performed with bent knees. Movement can also be made easier by angling body up against wall, horizontal bar or platform. Bent Knee Side Bridge Harder Exercise can be made more challenging with added weight on hip.",
"stabilizers": "latissimusdorsi, pectoralisminor, levatorscapulae, pectoralissternal",
"synergists": "gracilis, gluteusmedius, tensorfasciaelatae, trapeziuslower, serratusanterior, iliopsoas, supraspinatus, trapeziusmiddle, gluteusminimus, quadratuslumborum, erectorspinae, pectineus, gluteusmaximus, deltoidlateral, adductors",
"target": "obliques"}}