{"WaistWtInclineTwistingCrunch":{"id": "0",
"exerciseid": "WtInclineTwistingCrunch",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Weighted Incline Twisting Crunch (arms crossed)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Hook feet under padding and lie supine on incline bench with hips bent. Hold plate on upper chest with both hands or use no weight.",
"execution": "Flex and twist waist to raise upper torso from bench to one side. Return until back of shoulders contact padded incline board. Repeat to opposite side alternating twists.",
"comments": "Exercise can be performed without added weight until more resistance is needed. See Arm Position During Waist Exercises. Elevate incline to increase resistance. If no knee support is built in to incline board, ball can be placed under legs as illustrated. Hip and knee flexors may be involved as stabilizers if incline is steep and no calf support is used. See Spot Reduction Myth.",
"stabilizers": "tibialisanterior",
"synergists": "iliopsoas, rectusabdominis",
"target": "obliques"},"WaistWtBentKneeLyingTwist":{"id": "1",
"exerciseid": "WtBentKneeLyingTwist",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Weighted Bent-knee Lying Twist",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "On floor or mat, place medicine ball between bent knees. Lie on back with arms extended out to sides. Raise bent legs so thighs are vertical and lower legs are horizontal.",
"execution": "Lower legs to one side until side of thigh is on floor. Raise and lower legs to opposite side. Repeat.",
"comments": "Maintain knee position throughout movement. For less resistance, do not use additional weight (See Bentknee lying Twist without ball). See Spot Reduction Myth. Also see Lying Twist with exercise ball.",
"stabilizers": "deltoidposterior, trapeziusmiddle, tricepsbrachii, rhomboids, trapeziuslower, adductors",
"synergists": "iliopsoas, quadratuslumborum, erectorspinae",
"target": "obliques"},"WaistWtTwistingSitUpX":{"id": "2",
"exerciseid": "WtTwistingSitUpX",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Weighted Twisting Situp (arms crossed)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Place feet under low overhanging stationary object. Lie supine on floor or mat with hips and knees bent. With both hands, hold plate on chest with forearms crossed.",
"execution": "Flex and twist waist to one direction while raising torso from bench by bending hips. Return until back of shoulders contact floor or mat. Repeat to opposite side alternating twists.",
"comments": "Exercise can be performed without added weight until more resistance is needed. Add more weight or perform on incline board to increase resistance. Also see Arm Position During Waist Exercises and movement with weight placed behind head. If upper back does not come completely down at end of movement, abdominal muscles may only be isometrically involved in exercise. Pectineus, Adductor Longus, and Brevis do not assist in hip flexion since hips are already initially bent. See Spot Reduction Myth.",
"stabilizers": "tibialisanterior",
"synergists": "iliopsoas, sartorius, tensorfasciaelatae, rectusabdominis, quadriceps",
"target": "obliques"},"WaistWtTwistingCrunch":{"id": "3",
"exerciseid": "WtTwistingCrunch",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Weighted Twisting Crunch",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie supine on floor or bench with knees and hips bent. Hold plate behind neck or on chest with both hands.",
"execution": "Flex and twist waist to raise upper torso off surface to one side. Return until back of shoulders return to surface. Repeat to opposite side alternating twists.",
"comments": "If weight is held behind head, position head hanging off bench. See Spot Reduction Myth. Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. See Arm Position During Waist Exercises.",
"stabilizers": "No significant stabilizers",
"synergists": "iliopsoas, rectusabdominis",
"target": "obliques"},"WaistWtInclineTwistingSitUp":{"id": "4",
"exerciseid": "WtInclineTwistingSitUp",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Weighted Incline Twisting Situp",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Hook feet under foot or ankle brace and lie supine on incline bench with hips and knees bent. Hold plate behind neck with both hands.",
"execution": "Flex and twist waist to one direction while raising torso from bench by bending hips. Return until back of shoulders contact padded incline board. Repeat to opposite side, alternating twists.",
"comments": "Exercise can be performed without added weight until more resistance is needed. Elevate incline to increase resistance. See Arm Position During Waist Exercises. Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. If upper back does not come completely down at end of movement, abdominal muscles may only be isometrically involved in exercise. Pectineus, Adductor Longus, and Brevis do not assist in hip flexion since hips are already initially bent. Knee flexors may be involved as stabilizers if incline is steep and no calf support is used. See Spot Reduction Myth.",
"stabilizers": "tibialisanterior",
"synergists": "iliopsoas, sartorius, tensorfasciaelatae, rectusabdominis, quadriceps",
"target": "obliques"},"WaistWtTwistingSitUp":{"id": "5",
"exerciseid": "WtTwistingSitUp",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Weighted Twisting Situp",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Place feet under low overhanging stationary object. Lie supine on floor or mat with hips and knees bent. Hold plate behind neck with both hands.",
"execution": "Flex and twist waist to one direction while raising torso from bench by bending hips. Return until back of shoulders contact floor or mat. Repeat to opposite side alternating twists.",
"comments": "Feet can be held down by partner instead of foot bar. Exercise can be performed without added weight until more resistance is needed. Add more weight or perform on incline board to increase resistance. Also see Arm Position During Waist Exercises. Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. Also see exercise with weight placed on chest. If upper back does not come completely down at end of movement, abdominal muscles may only be isometrically involved in exercise. Pectineus, Adductor Longus, and Brevis do not assist in hip flexion since hips are already initially bent. See Spot Reduction Myth.",
"stabilizers": "tibialisanterior",
"synergists": "iliopsoas, sartorius, tensorfasciaelatae, rectusabdominis, quadriceps",
"target": "obliques"},"WaistWtSideCrunch":{"id": "6",
"exerciseid": "WtSideCrunch",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Weighted Side Crunch",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie upper back supine on floor or mat. With both legs together, knees and hips bent, position outside of leg down to side. Use no weight or hold weight to opposite side of head or across upper chest.",
"execution": "Flex waist, raising upper torso off surface. Return until back of shoulders return to surface. Repeat and continue with movement in opposite position.",
"comments": "Exercise can be performed without added weight until more resistance is needed. Certain individuals ma y need to keep their neck in neutral position with space between their chin and sternum. See Spot Reduction Myth and Arm Position During Waist Exercises.",
"stabilizers": "No significant stabilizers",
"synergists": "rectusabdominis",
"target": "obliques"},"WaistWTBallSideBend":{"id": "7",
"exerciseid": "WTBallSideBend",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Weighted Side Bend (on stability ball)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie on ball on side of torso, waist, and hip. Position legs outward with feet on floor or against floor board. Hold weight behind or above head.",
"execution": "Raise side of torso up by laterally flexing waist. Lower torso back on ball and repeat. Position other side on ball and repeat with opposite side.",
"comments": "Exercise can be performed without added weight until more resistance is needed. Movement can also be made easier by positioning hip low on ball. In contrast, exercise can be made more challenging by positioning hip higher on ball. In which case, feet may be placed against base of wall for stability. See alternative form. Also see Spot Reduction Myth and Arm Position During Waist Exercises.",
"stabilizers": "No significant stabilizers",
"synergists": "iliopsoas, quadratuslumborum, erectorspinae",
"target": "obliques"},"WaistWT45SideBend":{"id": "8",
"exerciseid": "WT45SideBend",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Weighted 45° Side Bend",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Position side of thigh on padding and side of feet on leg padding or platform lip. Hold weight to chest or behind head.",
"execution": "Raise torso upward by lateral flexing waist. Lower torso by bending waist downward. Repeat. Position body facing opposite side and continue with opposite side.",
"comments": "See Spot Reduction Myth and Arm Position During Waist Exercises.",
"stabilizers": "gluteusmedius, gluteusminimus",
"synergists": "iliopsoas, quadratuslumborum, erectorspinae",
"target": "obliques"},"WaistWtTwistingBallCrunch":{"id": "9",
"exerciseid": "WtTwistingBallCrunch",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Weighted Twisting Crunch (on stability ball)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on exercise ball. Walk forward on ball and lie back on ball with shoulders and head hanging off and knees and hips bent. Gently hyperextend back to contour of ball. Hold plate behind neck or on chest with both hands or use no weight.",
"execution": "Flex waist to raise upper torso. Return to original position and repeat.",
"comments": "Weight can be held behind neck. Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. Exercise can be performed without added weight until more resistance is needed. Movement can be made easier by positioning hips low on ball. In contrast, exercise can be made more challenging by positioning ball lower on back and hips higher. Some individuals may experience low back discomfort if hips are not bent, so they must use smaller ball size or lower their hip position on ball. See Arm Position During Waist Exercises and Spot Reduction Myth.",
"stabilizers": "No significant stabilizers",
"synergists": "rectusabdominis",
"target": "obliques"},"WaistWTSideCrunchOnBall":{"id": "10",
"exerciseid": "WTSideCrunchOnBall",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Weighted Side Crunch (on stability ball)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit on exercise ball. Walk forward on ball and lie back on ball with shoulders and head hanging off. Switch position of feet by positioning bent leg under extended leg so waist is twisted with hip positioned sideways. Gently hyperextend back to contour of ball. Hold plate behind neck or on chest with both hands or use no weight.",
"execution": "Flex waist to raise upper torso. Return to original position and repeat. Position legs in opposite position and continue.",
"comments": "Certain individuals may need to keep their neck in neutral position with space between their chin and sternum. Exercise can be performed without added weight until more resistance is needed. Movement can also be made easier by po sitioning hip low on ball or by using no added weight. In contrast, exercise can be made more challenging by positioning hip higher on ball. In which case, feet may be placed against base of wall for stability. Also see Spot Reduction Myth and Arm Position During Waist Exercises.",
"stabilizers": "No significant stabilizers",
"synergists": "rectusabdominis",
"target": "obliques"},"WaistWtLyingTwist":{"id": "11",
"exerciseid": "WtLyingTwist",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Weighted Lying Twist",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "On floor or mat, place exercise ball between lower legs. Lie on back with arms extended out to sides. Raise legs upward with knees slightly bent.",
"execution": "Lower legs to one side until side of thigh is on floor. Raise and lower legs to opposite side. Repeat.",
"comments": "Maintain knee position throughout movement. For less resistance, bend knees more andor do not use additional weight. See Spot Reduction Myth. Also see Bentknee Lying Twist.",
"stabilizers": "deltoidposterior, trapeziusmiddle, tricepsbrachii, rhomboids, trapeziuslower, adductors",
"synergists": "iliopsoas, quadratuslumborum, erectorspinae",
"target": "obliques"},"WaistWtInclineTwistingSitUpX":{"id": "12",
"exerciseid": "WtInclineTwistingSitUpX",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Weighted Incline Twisting Situp (arms crossed)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Pull",
"preparation": "Hook feet under foot brace and lie supine on incline board with hips and knees bent. Hold plate on chest with both hands or use no weight.",
"execution": "Flex and twist waist to one direction while raising torso from bench by bending hips. Return until back of shoulders contact padded incline board. Repeat to opposite side alternating twists.",
"comments": "Crossed arms can also be brought up above knees at top to increase range of motion. Exercise can be performed without added weight until more resistance is needed. Elevate incline to increase resistance. See Arm Position During Waist Exercises. If no knee support is built in to incline board, ball can be placed under legs as illustrated. Elbows can be raised over opposing knees for fuller range of motion. If upper back does not come completely down at end of movement, abdominal muscles may only be isometrically involved in exercise. Pectineus, Adductor Longus, and Brevis do not assist in hip flexion since hips are already initially bent. Knee flexors may be involved as stabilizers if incline is steep and no calf support is used. See Spot Reduction Myth.",
"stabilizers": "tibialisanterior",
"synergists": "iliopsoas, sartorius, tensorfasciaelatae, rectusabdominis, quadriceps",
"target": "obliques"},"WaistWTRussianTwistBall":{"id": "13",
"exerciseid": "WTRussianTwistBall",
"musclegroup": "Waist",
"equipment": "weighted",
"exercisetype": "WeightExercises",
"muscleclass": "Obliques",
"name": "Weighted Russian Twist (on stability ball)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "With weight plate or medicine ball in hand, sit on stability ball. Roll body down and lie with back on ball, hips nearly straight, and feet apart on floor. Hold onto weight with both hands with arms extending straight upward.",
"execution": "Turn torso to one side while keeping arms straight and perpendicular to torso throughout movement. Return weight back over shoulders by rotating torso to original position. Continue lowering weight to opposite side. Repeat.",
"comments": "Both arms should be kept straight and perpendicular to torso. Hips should also be kept nearly straight, only slightly bent. See Spot Reduction Myth. This movement involves both spinal rotation and hip external rotation. Because leg to the opposite side of added weight acts to counter weights resistance, greatest downward force onto floor is placed on foot nearest side of added weight. Since foot of near leg provides more secured base of support, external rotation of near hip provides significantly more torque as compared to relatively passive internal rotation of far hip.",
"stabilizers": "pectoralisclavicular, tricepsbrachii, pectoralissternal, deltoidposterior, trapeziusmiddle, gluteusmaximus, deltoidlateral, erectorspinae, trapeziuslower, pectoralisminor, rhomboids",
"synergists": "hipexernalrotators, iliopsoas, quadratuslumborum, erectorspinae",
"target": "obliques"}}