{"ChestCBInclineBenchPress":{"id": "0",
"exerciseid": "CBInclineBenchPress",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralClavicular",
"name": "Cable Incline Bench Press",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on seat and grasp stirrups to each side (attached to low cable pulleys). Lie back on incline back support. Position stirrups out to each side of chest with bent arm under each wrist.",
"execution": "Push stirrups up over each shoulder until arms are straight and parallel to one another. Return stirrups to original position, until slight stretch is felt in chest or shoulders. Repeat.",
"comments": "Stirrup should follow slight arch pattern, above upper arm between elbow and chest at bottom, traveling inward over each shoulder at top.",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "tricepsbrachii, deltoidanterior",
"target": "pectoralisclavicular"},"ChestCBBarInclineBenchPress":{"id": "1",
"exerciseid": "CBBarInclineBenchPress",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralClavicular",
"name": "Cable Bar Incline Bench Press",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Position adjustable pulley higher than intended height, but within arms reach from incline bench. Position incline bench under cable bar. Lie supine on incline bench. While lying on bench, reach over and lower each pulley into intended position so that cables are taut in lowest position with bar on chest. Grasp bar with both hands using wide oblique overhand grip.",
"execution": "Press bar upward until arms are extended. Lower bar to upper chest or until slight stretch is felt in shoulders. Repeat.",
"comments": "Range of motion will be compromised if grip is too wide. Also see Bench Press Analysis.",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "tricepsbrachii, deltoidanterior",
"target": "pectoralisclavicular"},"ChestCBInclineChestPress":{"id": "2",
"exerciseid": "CBInclineChestPress",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralClavicular",
"name": "Cable Incline Chest Press",
"utility": "Basic or Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Sit on seat and grasp stirrups to each side (attached to medium height pulleys). Position elbows out to sides, slightly lower than shoulder height. Position hands back approximately shoulder height and elbow width.",
"execution": "Push stirrups away from body, slightly upward at 30 to 45 until arms are straight and parallel to one another. Return stirrups to original position until slight stretch is felt in chest or shoulders. Repeat.",
"comments": "Stirrup should follow slight arch pattern, in frontabove of upper arm between elbow and chest in stretched position, travelling inward in frontabove each shoulder at contracted position.",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "tricepsbrachii, deltoidanterior",
"target": "pectoralisclavicular"},"ChestCBStandingInclineChestPress":{"id": "3",
"exerciseid": "CBStandingInclineChestPress",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralClavicular",
"name": "Cable Standing Incline Chest Press",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand between two hip height pulleys, facing away from cable columns. Grasp cable stirrups from each side. Position elbows out to sides, lower chest height. Position hands back approximately shoulder height and elbow width. Lean and step forward with one foot in front bending forward knee.",
"execution": "Push stirrups forward and upward at 30 to 45 angle until arms are straight and parallel to one another. Return stirrups to original position until slight stretch is felt in chest or shoulders. Repeat.",
"comments": "Stirrup should follow slight arch pattern, in frontabove of upper arm between elbow and chest in stretched position, travelling inward in frontabove each shoulder at contracted position. Cable pulleys should be closer together than what is typically found on standard cable cross over setup.",
"antagonist stabilizers": "erectorspinae",
"stabilizers": "rectusabdominis, obliques",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "serratusanterior, tricepsbrachii, deltoidanterior",
"target": "pectoralisclavicular"},"ChestCBBarStandingInclineChestPress":{"id": "4",
"exerciseid": "CBBarStandingInclineChestPress",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralClavicular",
"name": "Cable Bar Standing Incline Chest Press",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Stand facing behind cable bar, mounted on each side to lower chest height narrow double pulley cables. Grasp cable bar with wide overhand grip. Position bar upper midchest height with elbows angled behind and downward. Lean and step forward with one foot in front, bending forward knee.",
"execution": "Push cable bar forward and upward at 30 to 45 until arms are straight. Return cable bar to original position until slight stretch is felt in chest or shoulders. Repeat.",
"comments": "Cable pulleys should be closer together than what is typically found on standard cable cross over setup. Range of motion will be compromised if grip is too wide.",
"antagonist stabilizers": "erectorspinae",
"stabilizers": "rectusabdominis, obliques",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "serratusanterior, tricepsbrachii, deltoidanterior",
"target": "pectoralisclavicular"},"ChestCBStandTwistInclineChestPress":{"id": "5",
"exerciseid": "CBStandTwistInclineChestPress",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralClavicular",
"name": "Cable One Arm Standing Incline Chest Press",
"utility": "Auxiliary",
"mechanics": "Compound",
"force": "Push",
"preparation": "Grasp cable stirrup from hip height pulley. Turn body away from pulley. Position elbow of loaded arm out to side, lower chest height. Position loaded hand back approximately shoulder height and elbow width. Step far forward with foot of opposite side of loaded arm. Bend knees and position heel of rear foot off floor.",
"execution": "Push stirrups forward and upward at 30 to 45 until arm is straight and inline with cable. Return stirrup to original position until slight stretch is felt in chest or shoulder. Repeat. Continue with opposite arm.",
"comments": "Stirrup should follow slight arch pattern, in frontabove of upper arm between elbow and chest in stretched position, travelling inward in frontabove shoulder at contracted position. In standing position, both spinal rotation and hip rotation contribute to bodys rotation. Because rear leg is only supported by forefoot, hip of forward leg is utilized (hip internal rotation  transverse adduction) much greater than hip of rear leg since forward leg offers more secured base of support. The effective range of motion of Pectoralis Major is only about half of what it is in bilateral nontwisting movement.",
"antagonist stabilizers": "erectorspinae",
"stabilizers": "rectusabdominis",
"dynamic stabilizers": "bicepsbrachii",
"synergists": "erectorspinae, tricepsbrachii, tensorfasciaelatae, gluteusmedius, serratusanterior, iliopsoas, gluteusminimus, quadratuslumborum, deltoidanterior, adductors, obliques",
"target": "pectoralisclavicular"},"ChestCBInclineFly":{"id": "6",
"exerciseid": "CBInclineFly",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralClavicular",
"name": "Cable Incline Fly",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Sit on seat with stirrups in each hand (attached to low cable pulleys). Lie back on incline back support. Position stirrups out to each side of chest with bent arm under each wrist. Press stirrups over each shoulder until arms vertical. Bend elbows slightly and internally rotate shoulders so elbows point out to sides.",
"execution": "Lower stirrups outward to sides of shoulders. Keep elbows fixed in slightly bent position. When a stretch is felt in chest or shoulders, bring stirrups back together in hugging motion above upper chest until stirrups are nearly together Repeat.",
"comments": "Keep shoulders internally rotated so elbows point downward at bottom position and outward at top position. Shoulder will likely have less range of motion in lower position as compared to Fly on flat bench.",
"stabilizers": "brachialis, wristflexors, bicepsbrachii, tricepsbrachii",
"synergists": "bicepsbrachii, deltoidanterior",
"target": "pectoralisclavicular"},"ChestCBStandingInclineFly":{"id": "7",
"exerciseid": "CBStandingInclineFly",
"musclegroup": "Chest",
"equipment": "cable",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralClavicular",
"name": "Cable Standing Incline Fly",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "Stand between two pulleys position hip height and arms width or slightly wider apart. Grasp stirrups, one in each hand. Extend arms out with elbows slightly bent, pointed back and downward slightly. Step forward until cables are taut or when weights are lifted up slightly. Stand with feet staggered.",
"execution": "Keeping elbows fixed in slightly bent position, bring stirrups together in upwardly arching, hugging motion, at 30 to 45 angle until they meet at top of motion. Lower stirrups to original position in reverse pattern. As soon as stretch is felt in chest or shoulders, repeat motion.",
"comments": "None",
"antagonist stabilizers": "erectorspinae",
"stabilizers": "brachialis, tricepsbrachii, wristflexors, rectusabdominis, bicepsbrachii, obliques",
"synergists": "bicepsbrachii, deltoidanterior",
"target": "pectoralisclavicular"}}