{"CalvesBBReverseCalfRaise":{"id": "0",
"exerciseid": "BBReverseCalfRaise",
"musclegroup": "Calves",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "TibialisAnterior",
"name": "Barbell Reverse Calf Raise",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Place barbell on power rack upper chest height and calf block under barbell. Position back of shoulders under barbell with both hands to sides. Position heels on forward edge of calf block. Lean barbell against rack and raise from supports by extending knees and hips. Support barbell against verticals with both hands to sides.",
"execution": "Pull forefoot of both feet up toward body as far as possible. Return by extending feet until toes are pointed downward. Repeat.",
"comments": "Throughout exercise, keep knees and hips straight and support barbell against verticals with both hands to sides. The exercise can be made more difficult by positionin g heels closer to edge of platform. Notice barbell makes contact with only nonpainted surface (plastic or metal surface). See Dorsal Flexor Calf Exercise Analyses.",
"stabilizers": "No significant stabilizers",
"synergists": "None",
"target": "tibialisanterior"},"CalvesSBReverseCalfRaise":{"id": "1",
"exerciseid": "SBReverseCalfRaise",
"musclegroup": "Calves",
"equipment": "barbell",
"exercisetype": "WeightExercises",
"muscleclass": "TibialisAnterior",
"name": "Safety Bar Reverse Calf Raise",
"utility": "Basic or Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Standing facing safety barbell on rack upper chest height and calf block on floor just below. Position heels on forward edge of calf block. Place hands on bar to each sides or on vertical rack bars. Position head in yoke with padded bar around shoulders. Dismount bar from rack by standing erect with safety bar, away yet close to rack.",
"execution": "Pull forefeet up toward body as far as possible. Return by extending feet until toes are pointed downward. Repeat.",
"comments": "Position rack just below lowest range of motion. Calf block should be positioned so safety bar is close to but does not make contact with rack. Keep knees and hips straight throughout exercise. See Dorsal Flexor Calf Exercise Analyses.",
"stabilizers": "No significant stabilizers",
"synergists": "None",
"target": "tibialisanterior"}}