{"ChestAsChestDipKneeling":{"id": "0",
"exerciseid": "AsChestDipKneeling",
"musclegroup": "Chest",
"equipment": "assisted",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Machine-assisted Chest Dip (kneeling)",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Mount wide dip bar with oblique grip (bar diagonal under palm), arms straight with shoulders above hands. Kneel on padded platform, lowering it down slightly so hips are slightly bent.",
"execution": "Lower body by bending arms, allowing elbows to flare out to sides. When slight stretch is felt in chest or shoulders push body up until arms are straight. Repeat.",
"comments": "See mount and dismount. Some assisted machines require you to standing on bar. Also see Assisted Triceps Dip.",
"stabilizers": "trapeziuslower",
"synergists": "latissimusdorsi, pectoralisclavicular, tricepsbrachii, levatorscapulae, teresmajor, deltoidanterior, pectoralisminor, rhomboids",
"target": "pectoralissternal"},"ChestAsChestDip":{"id": "1",
"exerciseid": "AsChestDip",
"musclegroup": "Chest",
"equipment": "assisted",
"exercisetype": "WeightExercises",
"muscleclass": "PectoralSternal",
"name": "Machine-assisted Chest Dip",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Mount wide dip bar with oblique grip (bar diagonal under palm), arms straight with shoulders above hands. Step down onto assistance lever with hips and knees bent.",
"execution": "Lower body by bending arms, allowing elbows to flare out to sides. When slight stretch is felt in chest or shoulders, push body up until arms are straight. Repeat.",
"comments": "See mount and dismount. Some assisted machines require you to kneel on platform instead of standing on bar. Also see Assisted Triceps Dip.",
"stabilizers": "trapeziuslower",
"synergists": "latissimusdorsi, pectoralisclavicular, tricepsbrachii, levatorscapulae, teresmajor, deltoidanterior, pectoralisminor, rhomboids",
"target": "pectoralissternal"}}