{"WaistDBPushCrunch":{"id": "0",
"exerciseid": "DBPushCrunch",
"musclegroup": "Waist",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Dumbbell Push Crunch",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Push",
"preparation": "With dumbbells in each hand, position feet under foot pad and lie supine on steep incline bench. Position dumbbells straight over shoulders.",
"execution": "Flex waist to raise upper torso from bench, keeping low back on bench. Return until back of shoulders contact padded incline bench. Repeat.",
"comments": "Keep weight above shoulders throughout movement. A standard incline crunch without additional weight should be performed until greater resistance is required. Incline bench shown is designed for chest exercises, not abdominal exercise. Flexible hip flexors are required if bench does not provide for fixed hip flexion. A relatively steep incline is required to adequately position abdominal against load throughout fuller range of motion. See Spot Reduction Myth.",
"stabilizers": "pectoralisminor, pectoralisclavicular, tricepsbrachii, serratusanterior, pectoralissternal",
"synergists": "obliques",
"target": "rectusabdominis"},"WaistDBPushSitUp":{"id": "1",
"exerciseid": "DBPushSitUp",
"musclegroup": "Waist",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "RectusAbdominis",
"name": "Dumbbell Push Sit-up",
"utility": "Basic",
"mechanics": "Compound",
"force": "Push",
"preparation": "Position feet under foot pad and lie supine on flat or incline bench. Position dumbbells straight over shoulders.",
"execution": "Raise torso from bench as high as possible by bending waist and hips. Keep weight positioned above shoulders. Achieve near upright posture (hip flexibility, incline, and initial hip position permitting). Return to original lying posture with back of shoulders, contacting padded incline board. Repeat.",
"comments": "Keep weight above shoulders throughout movement. Incline can also be elevated to increase resistance. If upper back does not come completely down at end of movement, abdominal muscles may only be isometrically involved in exercise. Pectineus, Adductor Longus, and Brevis do not assist in hip flexion since hips are already initially bent. Knee flexors may be involved as stabilizers if incline is steep and no calf support is used. Incline bench should allow for significant bend in hip as shown. Decline benches designed for chest exercises generally do not offer this positioning. Flexible hip flexors are required if bench does not provide for fixed hip flexion. See Spot Reduction Myth. Also see Dangerous Exercise Essay.",
"stabilizers": "pectoralisclavicular, tricepsbrachii, tibialisanterior, serratusanterior, pectoralissternal, deltoidlateral, deltoidanterior, pectoralisminor",
"synergists": "iliopsoas, sartorius, obliques, tensorfasciaelatae, quadriceps",
"target": "rectusabdominis"}}