{"ForearmsDBLyingSupinationUp":{"id": "0",
"exerciseid": "DBLyingSupinationUp",
"musclegroup": "Forearms",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Supinators",
"name": "Dumbbell Lying Supination",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Lie on bench or mat. With hand of upper arm, grasp unilaterally loaded dumbbell thumb next to side with weight. Bend elbow approximately 90degrees and place forearm on hip, or side of waist. Position thumb downward (pronated).",
"execution": "Rotate dumbbell so thumb turns upward (supination). Return and repeat.",
"comments": "Pad or firm pillow may be placed between hip and arm. Elevation of elbow allows resistance during final range of motion. If unilaterally loaded dumbbell, or half dumbbell is not available, grasp conventional dumbbell to one side of handle with pinkie against inside surface. Also see Dumbbell Lying Supination with arm down. This exercise can also be performed seated by corner of table higher than shoulder height (See Seated Supination).",
"synergists": "bicepsbrachii",
"target": "Supinator"},"ForearmsDBLyingSupinationDown":{"id": "1",
"exerciseid": "DBLyingSupinationDown",
"musclegroup": "Forearms",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Supinators",
"name": "Dumbbell Lying Supination (arm down)",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Grasp unilaterally loaded dumbbell with pinkie finger next to weight side. Lie on bench on side with weight and position arm with half dumbbell on bench. Bend elbow approximately 90degrees and tuck bent elbow under body. Position thumb up (pronated).",
"execution": "Rotate dumbbell so thumb turns downward (supinated). Return and repeat.",
"comments": "Bench can be flat or slightly incline (030 degrees) so resistance occurs during final range of motion. If unilaterally loaded dumbbell, or half dumbbell is not available, grasp conventional dumbbell to one side of handle with thumb against inside surface. Also see conventional Dumbbell Lying Supination.",
"synergists": "bicepsbrachii",
"target": "Supinator"},"ForearmsDBSeatedSupination":{"id": "2",
"exerciseid": "DBSeatedSupination",
"musclegroup": "Forearms",
"equipment": "dumbbell",
"exercisetype": "WeightExercises",
"muscleclass": "Supinators",
"name": "Dumbbell Seated Supination",
"utility": "Auxiliary",
"mechanics": "Isolated",
"force": "Pull",
"preparation": "Sit next to elevated surface, approximately arm pit height. With hand of arm next to elevated surface, grasp unilaterally loaded dumbbell thumb next to side with weight. Bend elbow approximately 90degrees and place upperarm on elevated surface. Position thumb downward (pronated).",
"execution": "Rotate dumbbell so thumb turns upward (supination). Return and repeat.",
"comments": "If unilaterally loaded dumbbell, or half dumbbell is not available, grasp conventional dumbbell to one side of handle with pinkie against inside surface.",
"synergists": "bicepsbrachii",
"target": "Supinator"}}